{"sha": "f0b7065e6f2d8dcd64c536bb4ce3066186850a09", "node_id": "MDY6Q29tbWl0NzI0NzEyOmYwYjcwNjVlNmYyZDhkY2Q2NGM1MzZiYjRjZTMwNjYxODY4NTBhMDk=", "commit": {"author": {"name": "John Kleint", "email": "jk@hinge.co", "date": "2014-10-20T00:49:10Z"}, "committer": {"name": "John Kleint", "email": "jk@hinge.co", "date": "2014-10-21T13:09:32Z"}, "message": "Guide: articulate the advantages of ownership over garbage collection.\n\nExplain the primary disadvantage of garbage collection is runtime\noverhead and unpredictable pauses.  Elucidate where the name \"race\ncondition\" comes from.  Emphasize that Rust can guarantee your code is\nfree of race conditions and other memory errors, with no runtime\noverhead.", "tree": {"sha": "5298b9ebc7900154398a5f222dd43dc44b4e9ea4", "url": "https://api.github.com/repos/rust-lang/rust/git/trees/5298b9ebc7900154398a5f222dd43dc44b4e9ea4"}, "url": "https://api.github.com/repos/rust-lang/rust/git/commits/f0b7065e6f2d8dcd64c536bb4ce3066186850a09", "comment_count": 5, "verification": {"verified": false, "reason": "unsigned", "signature": null, "payload": null}}, "url": "https://api.github.com/repos/rust-lang/rust/commits/f0b7065e6f2d8dcd64c536bb4ce3066186850a09", "html_url": "https://github.com/rust-lang/rust/commit/f0b7065e6f2d8dcd64c536bb4ce3066186850a09", "comments_url": "https://api.github.com/repos/rust-lang/rust/commits/f0b7065e6f2d8dcd64c536bb4ce3066186850a09/comments", "author": null, "committer": null, "parents": [{"sha": "e8cc3f26ec998181a883d79c9a668fe55695e681", "url": "https://api.github.com/repos/rust-lang/rust/commits/e8cc3f26ec998181a883d79c9a668fe55695e681", "html_url": "https://github.com/rust-lang/rust/commit/e8cc3f26ec998181a883d79c9a668fe55695e681"}], "stats": {"total": 33, "additions": 18, "deletions": 15}, "files": [{"sha": "03fbf90e465c44d511361741f7a2d5f6fa3178fc", "filename": "src/doc/guide.md", "status": "modified", "additions": 18, "deletions": 15, "changes": 33, "blob_url": "https://github.com/rust-lang/rust/blob/f0b7065e6f2d8dcd64c536bb4ce3066186850a09/src%2Fdoc%2Fguide.md", "raw_url": "https://github.com/rust-lang/rust/raw/f0b7065e6f2d8dcd64c536bb4ce3066186850a09/src%2Fdoc%2Fguide.md", "contents_url": "https://api.github.com/repos/rust-lang/rust/contents/src%2Fdoc%2Fguide.md?ref=f0b7065e6f2d8dcd64c536bb4ce3066186850a09", "patch": "@@ -3466,13 +3466,14 @@ for destroying that resource as well. Given that we're discussing pointers\n right now, let's discuss this in the context of memory allocation, though\n it applies to other resources as well.\n \n-When you allocate heap memory, you need a mechanism to free that memory.  Many\n-languages let the programmer control the allocation, and then use a garbage\n-collector to handle the deallocation. This is a valid, time-tested strategy,\n-but it's not without its drawbacks. Because the programmer does not have to\n-think as much about deallocation, allocation becomes something commonplace,\n-because it's easy. And if you need precise control over when something is\n-deallocated, leaving it up to your runtime can make this difficult.\n+When you allocate heap memory, you need a mechanism to free that memory. Many\n+languages use a garbage collector to handle deallocation. This is a valid,\n+time-tested strategy, but it's not without its drawbacks: it adds overhead, and\n+can lead to unpredictable pauses in execution. Because the programmer does not\n+have to think as much about deallocation, allocation becomes something\n+commonplace, leading to more memory usage. And if you need precise control\n+over when something is deallocated, leaving it up to your runtime can make this\n+difficult.\n \n Rust chooses a different path, and that path is called **ownership**. Any\n binding that creates a resource is the **owner** of that resource.\n@@ -3498,17 +3499,19 @@ memory. The length of time that the borrower is borrowing the pointer\n from you is called a **lifetime**.\n \n If two distinct bindings share a pointer, and the memory that pointer points to\n-is immutable, then there are no problems. But if it's mutable, both pointers\n-can attempt to write to the memory at the same time, causing a **race\n-condition**. Therefore, if someone wants to mutate something that they've\n-borrowed from you, you must not have lent out that pointer to anyone else.\n+is immutable, then there are no problems. But if it's mutable, the result of\n+changing it can vary unpredictably depending on who happens to access it first,\n+which is called a **race condition**. To avoid this, if someone wants to mutate\n+something that they've borrowed from you, you must not have lent out that\n+pointer to anyone else.\n \n Rust has a sophisticated system called the **borrow checker** to make sure that\n everyone plays by these rules. At compile time, it verifies that none of these\n-rules are broken. If there's no problem, our program compiles successfully, and\n-there is no runtime overhead for any of this. The borrow checker works only at\n-compile time. If the borrow checker did find a problem, it will report a\n-**lifetime error**, and your program will refuse to compile.\n+rules are broken. If our program compiles successfully, Rust can guarantee it\n+is free of data races and other memory errors, and there is no runtime overhead\n+for any of this. The borrow checker works only at compile time. If the borrow\n+checker did find a problem, it will report a **lifetime error**, and your\n+program will refuse to compile.\n \n That's a lot to take in. It's also one of the _most_ important concepts in\n all of Rust. Let's see this syntax in action:"}]}