{"sha": "30c4a23d026c9f3fb6d2f688b294d41c07ecbc51", "node_id": "MDY6Q29tbWl0MTM2NTMxMDA6MzBjNGEyM2QwMjZjOWYzZmI2ZDJmNjg4YjI5NGQ0MWMwN2VjYmM1MQ==", "commit": {"author": {"name": "Jonathan Wakely", "email": "jwakely.gcc@gmail.com", "date": "2011-02-08T09:43:53Z"}, "committer": {"name": "Jonathan Wakely", "email": "redi@gcc.gnu.org", "date": "2011-02-08T09:43:53Z"}, "message": "fdl-1.2.xml: Remove.\n\n2011-02-08  Jonathan Wakely  <jwakely.gcc@gmail.com>\n\n\t* doc/xml/gnu/fdl-1.2.xml: Remove.\n\t* doc/xml/gnu/gpl-2.0.xml: Remove.\n\t* doc/Makefile.am: Update.\n\t* doc/Makefile.in: Regnerate.\n\nFrom-SVN: r169915", "tree": {"sha": "63c33a0c0a2f5620cac41d79f9ba509965b2615b", "url": "https://api.github.com/repos/Rust-GCC/gccrs/git/trees/63c33a0c0a2f5620cac41d79f9ba509965b2615b"}, "url": "https://api.github.com/repos/Rust-GCC/gccrs/git/commits/30c4a23d026c9f3fb6d2f688b294d41c07ecbc51", "comment_count": 0, "verification": {"verified": false, "reason": "unsigned", "signature": null, "payload": null}}, "url": "https://api.github.com/repos/Rust-GCC/gccrs/commits/30c4a23d026c9f3fb6d2f688b294d41c07ecbc51", "html_url": "https://github.com/Rust-GCC/gccrs/commit/30c4a23d026c9f3fb6d2f688b294d41c07ecbc51", "comments_url": "https://api.github.com/repos/Rust-GCC/gccrs/commits/30c4a23d026c9f3fb6d2f688b294d41c07ecbc51/comments", "author": null, "committer": {"login": "jwakely", "id": 1254480, "node_id": "MDQ6VXNlcjEyNTQ0ODA=", "avatar_url": "https://avatars.githubusercontent.com/u/1254480?v=4", "gravatar_id": "", "url": "https://api.github.com/users/jwakely", "html_url": "https://github.com/jwakely", "followers_url": "https://api.github.com/users/jwakely/followers", "following_url": "https://api.github.com/users/jwakely/following{/other_user}", "gists_url": "https://api.github.com/users/jwakely/gists{/gist_id}", "starred_url": "https://api.github.com/users/jwakely/starred{/owner}{/repo}", "subscriptions_url": "https://api.github.com/users/jwakely/subscriptions", "organizations_url": "https://api.github.com/users/jwakely/orgs", "repos_url": "https://api.github.com/users/jwakely/repos", "events_url": "https://api.github.com/users/jwakely/events{/privacy}", "received_events_url": "https://api.github.com/users/jwakely/received_events", "type": "User", "site_admin": false}, "parents": [{"sha": "24780fe16b9f147711fc51bf41a3aaf24858f7b4", "url": "https://api.github.com/repos/Rust-GCC/gccrs/commits/24780fe16b9f147711fc51bf41a3aaf24858f7b4", "html_url": "https://github.com/Rust-GCC/gccrs/commit/24780fe16b9f147711fc51bf41a3aaf24858f7b4"}], "stats": {"total": 878, "additions": 7, "deletions": 871}, "files": [{"sha": "7127f26ae0dec5a14f08652045aceb1bcacdfd5c", "filename": "libstdc++-v3/ChangeLog", "status": "modified", "additions": 7, "deletions": 0, "changes": 7, "blob_url": "https://github.com/Rust-GCC/gccrs/blob/30c4a23d026c9f3fb6d2f688b294d41c07ecbc51/libstdc%2B%2B-v3%2FChangeLog", "raw_url": "https://github.com/Rust-GCC/gccrs/raw/30c4a23d026c9f3fb6d2f688b294d41c07ecbc51/libstdc%2B%2B-v3%2FChangeLog", "contents_url": "https://api.github.com/repos/Rust-GCC/gccrs/contents/libstdc%2B%2B-v3%2FChangeLog?ref=30c4a23d026c9f3fb6d2f688b294d41c07ecbc51", "patch": "@@ -1,3 +1,10 @@\n+2011-02-08  Jonathan Wakely  <jwakely.gcc@gmail.com>\n+\n+\t* doc/xml/gnu/fdl-1.2.xml: Remove.\n+\t* doc/xml/gnu/gpl-2.0.xml: Remove.\n+\t* doc/Makefile.am: Update.\n+\t* doc/Makefile.in: Regnerate.\n+\n 2011-02-07  Paolo Carlini  <paolo.carlini@oracle.com>\n \n \tPR libstdc++/47628"}, {"sha": "f8e939fb38e55bc2fa7397c32717583bd3ede4a0", "filename": "libstdc++-v3/doc/Makefile.am", "status": "modified", "additions": 0, "deletions": 2, "changes": 2, "blob_url": "https://github.com/Rust-GCC/gccrs/blob/30c4a23d026c9f3fb6d2f688b294d41c07ecbc51/libstdc%2B%2B-v3%2Fdoc%2FMakefile.am", "raw_url": "https://github.com/Rust-GCC/gccrs/raw/30c4a23d026c9f3fb6d2f688b294d41c07ecbc51/libstdc%2B%2B-v3%2Fdoc%2FMakefile.am", "contents_url": "https://api.github.com/repos/Rust-GCC/gccrs/contents/libstdc%2B%2B-v3%2Fdoc%2FMakefile.am?ref=30c4a23d026c9f3fb6d2f688b294d41c07ecbc51", "patch": "@@ -349,9 +349,7 @@ xml_sources_manual = \\\n \t${xml_dir}/manual/appendix_porting.xml\n \n xml_sources_extra = \\\n-\t${xml_dir}/gnu/fdl-1.2.xml \\\n \t${xml_dir}/gnu/fdl-1.3.xml \\\n-\t${xml_dir}/gnu/gpl-2.0.xml \\\n \t${xml_dir}/gnu/gpl-3.0.xml\n \n xml_sources = \\"}, {"sha": "e6e19203ebd50404671c40f062820f678a97d109", "filename": "libstdc++-v3/doc/Makefile.in", "status": "modified", "additions": 0, "deletions": 2, "changes": 2, "blob_url": "https://github.com/Rust-GCC/gccrs/blob/30c4a23d026c9f3fb6d2f688b294d41c07ecbc51/libstdc%2B%2B-v3%2Fdoc%2FMakefile.in", "raw_url": "https://github.com/Rust-GCC/gccrs/raw/30c4a23d026c9f3fb6d2f688b294d41c07ecbc51/libstdc%2B%2B-v3%2Fdoc%2FMakefile.in", "contents_url": "https://api.github.com/repos/Rust-GCC/gccrs/contents/libstdc%2B%2B-v3%2Fdoc%2FMakefile.in?ref=30c4a23d026c9f3fb6d2f688b294d41c07ecbc51", "patch": "@@ -400,9 +400,7 @@ xml_sources_manual = \\\n \t${xml_dir}/manual/appendix_porting.xml\n \n xml_sources_extra = \\\n-\t${xml_dir}/gnu/fdl-1.2.xml \\\n \t${xml_dir}/gnu/fdl-1.3.xml \\\n-\t${xml_dir}/gnu/gpl-2.0.xml \\\n \t${xml_dir}/gnu/gpl-3.0.xml\n \n xml_sources = \\"}, {"sha": "ebf54f4a21bbaf56819814fd301165d11b48638a", "filename": "libstdc++-v3/doc/xml/gnu/fdl-1.2.xml", "status": "removed", "additions": 0, "deletions": 503, "changes": 503, "blob_url": "https://github.com/Rust-GCC/gccrs/blob/24780fe16b9f147711fc51bf41a3aaf24858f7b4/libstdc%2B%2B-v3%2Fdoc%2Fxml%2Fgnu%2Ffdl-1.2.xml", "raw_url": "https://github.com/Rust-GCC/gccrs/raw/24780fe16b9f147711fc51bf41a3aaf24858f7b4/libstdc%2B%2B-v3%2Fdoc%2Fxml%2Fgnu%2Ffdl-1.2.xml", "contents_url": "https://api.github.com/repos/Rust-GCC/gccrs/contents/libstdc%2B%2B-v3%2Fdoc%2Fxml%2Fgnu%2Ffdl-1.2.xml?ref=24780fe16b9f147711fc51bf41a3aaf24858f7b4", "patch": "@@ -1,503 +0,0 @@\n-<appendix xmlns=\"http://docbook.org/ns/docbook\" version=\"5.0\" \n-\t  xml:id=\"appendix.gfdl-1.2\">\n-<info><title>GNU Free Documentation License</title></info>\n-  <?dbhtml filename=\"appendix_gfdl.html\"?>\n-  \n-  <para>\n-    Copyright (C) 2000, 2001, 2002 Free Software Foundation,\n-    <abbrev>Inc.</abbrev> 51 Franklin <abbrev>St</abbrev>, Fifth Floor,\n-    Boston, <abbrev>MA</abbrev> 02110-1301 <abbrev role=\"initialism\">USA</abbrev>.  Everyone is permitted to copy and\n-    distribute verbatim copies of this license document, but changing it is\n-    not allowed.\n-  </para>\n-  <bridgehead xml:id=\"fdl-1-preamble\" renderas=\"sect1\">\n-    0. PREAMBLE\n-  </bridgehead>\n-  <para>\n-    The purpose of this License is to make a manual, textbook, or other\n-    functional and useful document \"free\" in the sense of freedom: to assure\n-    everyone the effective freedom to copy and redistribute it, with or\n-    without modifying it, either commercially or noncommercially.\n-    Secondarily, this License preserves for the author and publisher a way to\n-    get credit for their work, while not being considered responsible for\n-    modifications made by others.\n-  </para>\n-  <para>\n-    This License is a kind of \"copyleft\", which means that derivative works of\n-    the document must themselves be free in the same sense.  It complements\n-    the GNU General Public License, which is a copyleft license designed for\n-    free software.\n-  </para>\n-  <para>\n-    We have designed this License in order to use it for manuals for free\n-    software, because free software needs free documentation: a free program\n-    should come with manuals providing the same freedoms that the software\n-    does.  But this License is not limited to software manuals; it can be used\n-    for any textual work, regardless of subject matter or whether it is\n-    published as a printed book.  We recommend this License principally for\n-    works whose purpose is instruction or reference.</para>\n-  <bridgehead xml:id=\"fdl-1-definitions\" renderas=\"sect1\">\n-    1. APPLICABILITY AND DEFINITIONS\n-  </bridgehead>\n-  <para>\n-    This License applies to any manual or other work, in any medium, that\n-    contains a notice placed by the copyright holder saying it can be\n-    distributed under the terms of this License.  Such a notice grants a\n-    world-wide, royalty-free license, unlimited in duration, to use that work\n-    under the conditions stated herein.  The \"Document\", below, refers to any\n-    such manual or work.  Any member of the public is a licensee, and is\n-    addressed as \"you\".  You accept the license if you copy, modify or\n-    distribute the work in a way requiring permission under copyright\n-    law.\n-  </para>\n-  <para>\n-    A \"Modified Version\" of the Document means any work containing the\n-    Document or a portion of it, either copied verbatim, or with modifications\n-    and/or translated into another language.\n-  </para>\n-  <para>\n-    A \"Secondary Section\" is a named appendix or a front-matter section of the\n-    Document that deals exclusively with the relationship of the publishers or\n-    authors of the Document to the Document's overall subject (or to related\n-    matters) and contains nothing that could fall directly within that overall\n-    subject.  (Thus, if the Document is in part a textbook of mathematics, a\n-    Secondary Section may not explain any mathematics.)  The relationship\n-    could be a matter of historical connection with the subject or with\n-    related matters, or of legal, commercial, philosophical, ethical or\n-    political position regarding them.\n-  </para>\n-  <para>\n-    The \"Invariant Sections\" are certain Secondary Sections whose titles are\n-    designated, as being those of Invariant Sections, in the notice that says\n-    that the Document is released under this License.  If a section does not\n-    fit the above definition of Secondary then it is not allowed to be\n-    designated as Invariant.  The Document may contain zero Invariant\n-    Sections.  If the Document does not identify any Invariant Sections then\n-    there are none.\n-  </para>\n-  <para>\n-    The \"Cover Texts\" are certain short passages of text that are listed, as\n-    Front-Cover Texts or Back-Cover Texts, in the notice that says that the\n-    Document is released under this License.  A Front-Cover Text may be at\n-    most 5 words, and a Back-Cover Text may be at most 25 words.\n-  </para>\n-  <para>\n-    A \"Transparent\" copy of the Document means a machine-readable copy,\n-    represented in a format whose specification is available to the general\n-    public, that is suitable for revising the document straightforwardly with\n-    generic text editors or (for images composed of pixels) generic paint\n-    programs or (for drawings) some widely available drawing editor, and that\n-    is suitable for input to text formatters or for automatic translation to a\n-    variety of formats suitable for input to text formatters.  A copy made in\n-    an otherwise Transparent file format whose markup, or absence of markup,\n-    has been arranged to thwart or discourage subsequent modification by\n-    readers is not Transparent.  An image format is not Transparent if used\n-    for any substantial amount of text.  A copy that is not \"Transparent\" is\n-    called \"Opaque\".\n-  </para>\n-  <para>\n-    Examples of suitable formats for Transparent copies include plain ASCII\n-    without markup, Texinfo input format, LaTeX input format, SGML or XML\n-    using a publicly available DTD, and standard-conforming simple HTML,\n-    PostScript or PDF designed for human modification.  Examples of\n-    transparent image formats include PNG, XCF and JPG.  Opaque formats\n-    include proprietary formats that can be read and edited only by\n-    proprietary word processors, SGML or XML for which the DTD and/or\n-    processing tools are not generally available, and the machine-generated\n-    HTML, PostScript or PDF produced by some word processors for output\n-    purposes only.\n-  </para>\n-  <para>\n-    The \"Title Page\" means, for a printed book, the title page itself, plus\n-    such following pages as are needed to hold, legibly, the material this\n-    License requires to appear in the title page.  For works in formats which\n-    do not have any title page as such, \"Title Page\" means the text near the\n-    most prominent appearance of the work's title, preceding the beginning of\n-    the body of the text.\n-  </para>\n-  <para>\n-    A section \"Entitled XYZ\" means a named subunit of the Document whose title\n-    either is precisely XYZ or contains XYZ in parentheses following text that\n-    translates XYZ in another language.  (Here XYZ stands for a specific\n-    section name mentioned below, such as \"Acknowledgements\", \"Dedications\",\n-    \"Endorsements\", or \"History\".)  To \"Preserve the Title\" of such a section\n-    when you modify the Document means that it remains a section \"Entitled\n-    XYZ\" according to this definition.\n-  </para>\n-  <para>\n-    The Document may include Warranty Disclaimers next to the notice which\n-    states that this License applies to the Document.  These Warranty\n-    Disclaimers are considered to be included by reference in this License,\n-    but only as regards disclaiming warranties: any other implication that\n-    these Warranty Disclaimers may have is void and has no effect on the\n-    meaning of this License.\n-  </para>\n-  <bridgehead xml:id=\"VerbatimCopying\" renderas=\"sect1\">\n-    2. VERBATIM COPYING\n-  </bridgehead>\n-  <para>\n-    You may copy and distribute the Document in any medium, either\n-    commercially or noncommercially, provided that this License, the copyright\n-    notices, and the license notice saying this License applies to the\n-    Document are reproduced in all copies, and that you add no other\n-    conditions whatsoever to those of this License.  You may not use technical\n-    measures to obstruct or control the reading or further copying of the\n-    copies you make or distribute.  However, you may accept compensation in\n-    exchange for copies.  If you distribute a large enough number of copies\n-    you must also follow the conditions in section 3.\n-  </para>\n-  <para>\n-    You may also lend copies, under the same conditions stated above, and you\n-    may publicly display copies.\n-  </para>\n-  <bridgehead xml:id=\"QuantityCopying\" renderas=\"sect1\">\n-    3. COPYING IN QUANTITY\n-  </bridgehead>\n-  <para>\n-    If you publish printed copies (or copies in media that commonly have\n-    printed covers) of the Document, numbering more than 100, and the\n-    Document's license notice requires Cover Texts, you must enclose the\n-    copies in covers that carry, clearly and legibly, all these Cover Texts:\n-    Front-Cover Texts on the front cover, and Back-Cover Texts on the back\n-    cover.  Both covers must also clearly and legibly identify you as the\n-    publisher of these copies.  The front cover must present the full title\n-    with all words of the title equally prominent and visible.  You may add\n-    other material on the covers in addition.  Copying with changes limited to\n-    the covers, as long as they preserve the title of the Document and satisfy\n-    these conditions, can be treated as verbatim copying in other\n-    respects.\n-  </para>\n-  <para>\n-    If the required texts for either cover are too voluminous to fit legibly,\n-    you should put the first ones listed (as many as fit reasonably) on the\n-    actual cover, and continue the rest onto adjacent pages.\n-  </para>\n-  <para>\n-    If you publish or distribute Opaque copies of the Document numbering more\n-    than 100, you must either include a machine-readable Transparent copy\n-    along with each Opaque copy, or state in or with each Opaque copy a\n-    computer-network location from which the general network-using public has\n-    access to download using public-standard network protocols a complete\n-    Transparent copy of the Document, free of added material.  If you use the\n-    latter option, you must take reasonably prudent steps, when you begin\n-    distribution of Opaque copies in quantity, to ensure that this Transparent\n-    copy will remain thus accessible at the stated location until at least one\n-    year after the last time you distribute an Opaque copy (directly or\n-    through your agents or retailers) of that edition to the public.\n-  </para>\n-  <para>\n-    It is requested, but not required, that you contact the authors of the\n-    Document well before redistributing any large number of copies, to give\n-    them a chance to provide you with an updated version of the\n-    Document.\n-  </para>\n-  <bridgehead xml:id=\"Modifications\" renderas=\"sect1\">\n-    4. MODIFICATIONS\n-  </bridgehead>\n-  <para>\n-    You may copy and distribute a Modified Version of the Document under the\n-    conditions of sections 2 and 3 above, provided that you release the\n-    Modified Version under precisely this License, with the Modified Version\n-    filling the role of the Document, thus licensing distribution and\n-    modification of the Modified Version to whoever possesses a copy of it.\n-    In addition, you must do these things in the Modified Version:\n-  </para>\n-  <orderedlist numeration=\"upperalpha\">\n-    <listitem>\n-      <simpara>\n-        Use in the Title Page (and on the covers, if any) a title distinct\n-        from that of the Document, and from those of previous versions (which\n-        should, if there were any, be listed in the History section of the\n-        Document).  You may use the same title as a previous version if the\n-        original publisher of that version gives permission.\n-        </simpara>\n-    </listitem>\n-    <listitem>\n-      <simpara>\n-        List on the Title Page, as authors, one or more persons or entities\n-        responsible for authorship of the modifications in the Modified\n-        Version, together with at least five of the principal authors of the\n-        Document (all of its principal authors, if it has fewer than five),\n-        unless they release you from this requirement.\n-      </simpara>\n-    </listitem>\n-    <listitem>\n-      <simpara>\n-        State on the Title page the name of the publisher of the Modified\n-        Version, as the publisher.\n-      </simpara>\n-    </listitem>\n-    <listitem>\n-      <simpara>\n-        Preserve all the copyright notices of the Document.\n-      </simpara>\n-    </listitem>\n-    <listitem>\n-      <simpara>\n-        Add an appropriate copyright notice for your modifications adjacent to\n-        the other copyright notices.\n-      </simpara>\n-    </listitem>\n-    <listitem>\n-      <simpara>\n-        Include, immediately after the copyright notices, a license notice\n-        giving the public permission to use the Modified Version under the\n-        terms of this License, in the form shown in the Addendum below.\n-      </simpara>\n-    </listitem>\n-    <listitem>\n-      <simpara>\n-        Preserve in that license notice the full lists of Invariant Sections\n-        and required Cover Texts given in the Document's license notice.\n-      </simpara>\n-    </listitem>\n-    <listitem>\n-      <simpara>\n-        Include an unaltered copy of this License.\n-      </simpara>\n-    </listitem>\n-    <listitem>\n-      <simpara>\n-        Preserve the section Entitled \"History\", Preserve its Title, and add\n-        to it an item stating at least the title, year, new authors, and\n-        publisher of the Modified Version as given on the Title Page.  If\n-        there is no section Entitled \"History\" in the Document, create one\n-        stating the title, year, authors, and publisher of the Document as\n-        given on its Title Page, then add an item describing the Modified\n-        Version as stated in the previous sentence.\n-      </simpara>\n-    </listitem>\n-    <listitem>\n-      <simpara>\n-        Preserve the network location, if any, given in the Document for\n-        public access to a Transparent copy of the Document, and likewise the\n-        network locations given in the Document for previous versions it was\n-        based on.  These may be placed in the \"History\" section.  You may omit\n-        a network location for a work that was published at least four years\n-        before the Document itself, or if the original publisher of the\n-        version it refers to gives permission.\n-      </simpara>\n-    </listitem>\n-    <listitem>\n-      <simpara>\n-        For any section Entitled \"Acknowledgements\" or \"Dedications\", Preserve\n-        the Title of the section, and preserve in the section all the\n-        substance and tone of each of the contributor acknowledgements and/or\n-        dedications given therein.\n-      </simpara>\n-    </listitem>\n-    <listitem>\n-      <simpara>\n-        Preserve all the Invariant Sections of the Document, unaltered in\n-        their text and in their titles.  Section numbers or the equivalent are\n-        not considered part of the section titles.\n-      </simpara>\n-    </listitem>\n-    <listitem>\n-      <simpara>\n-        Delete any section Entitled \"Endorsements\".  Such a section may not be\n-        included in the Modified Version.\n-      </simpara>\n-    </listitem>\n-    <listitem>\n-      <simpara>\n-        Do not retitle any existing section to be Entitled \"Endorsements\" or\n-        to conflict in title with any Invariant Section.\n-      </simpara>\n-    </listitem>\n-    <listitem>\n-      <simpara>\n-        Preserve any Warranty Disclaimers.\n-      </simpara>\n-    </listitem>\n-  </orderedlist>\n-  <para>\n-    If the Modified Version includes new front-matter sections or appendices\n-    that qualify as Secondary Sections and contain no material copied from the\n-    Document, you may at your option designate some or all of these sections\n-    as invariant.  To do this, add their titles to the list of Invariant\n-    Sections in the Modified Version's license notice.  These titles must be\n-    distinct from any other section titles.\n-  </para>\n-  <para>\n-    You may add a section Entitled \"Endorsements\", provided it contains\n-    nothing but endorsements of your Modified Version by various parties--for\n-    example, statements of peer review or that the text has been approved by\n-    an organization as the authoritative definition of a standard.\n-  </para>\n-  <para>\n-    You may add a passage of up to five words as a Front-Cover Text, and a\n-    passage of up to 25 words as a Back-Cover Text, to the end of the list of\n-    Cover Texts in the Modified Version.  Only one passage of Front-Cover Text\n-    and one of Back-Cover Text may be added by (or through arrangements made\n-    by) any one entity.  If the Document already includes a cover text for the\n-    same cover, previously added by you or by arrangement made by the same\n-    entity you are acting on behalf of, you may not add another; but you may\n-    replace the old one, on explicit permission from the previous publisher\n-    that added the old one.\n-  </para>\n-  <para>\n-    The author(s) and publisher(s) of the Document do not by this License give\n-    permission to use their names for publicity for or to assert or imply\n-    endorsement of any Modified Version.\n-  </para>\n-  <bridgehead xml:id=\"Combining\" renderas=\"sect1\">\n-    5. COMBINING DOCUMENTS\n-  </bridgehead>\n-  <para>\n-    You may combine the Document with other documents released under this\n-    License, under the terms defined in section 4 above for modified versions,\n-    provided that you include in the combination all of the Invariant Sections\n-    of all of the original documents, unmodified, and list them all as\n-    Invariant Sections of your combined work in its license notice, and that\n-    you preserve all their Warranty Disclaimers.\n-  </para>\n-  <para>\n-    The combined work need only contain one copy of this License, and multiple\n-    identical Invariant Sections may be replaced with a single copy.  If there\n-    are multiple Invariant Sections with the same name but different contents,\n-    make the title of each such section unique by adding at the end of it, in\n-    parentheses, the name of the original author or publisher of that section\n-    if known, or else a unique number.  Make the same adjustment to the\n-    section titles in the list of Invariant Sections in the license notice of\n-    the combined work.\n-  </para>\n-  <para>\n-    In the combination, you must combine any sections Entitled \"History\" in\n-    the various original documents, forming one section Entitled \"History\";\n-    likewise combine any sections Entitled \"Acknowledgements\", and any\n-    sections Entitled \"Dedications\".  You must delete all sections Entitled\n-    \"Endorsements\".\n-  </para>\n-  <bridgehead xml:id=\"Collections\" renderas=\"sect1\">\n-    6. COLLECTIONS OF DOCUMENTS\n-  </bridgehead>\n-  <para>\n-    You may make a collection consisting of the Document and other documents\n-    released under this License, and replace the individual copies of this\n-    License in the various documents with a single copy that is included in\n-    the collection, provided that you follow the rules of this License for\n-    verbatim copying of each of the documents in all other respects.\n-  </para>\n-  <para>\n-    You may extract a single document from such a collection, and distribute\n-    it individually under this License, provided you insert a copy of this\n-    License into the extracted document, and follow this License in all other\n-    respects regarding verbatim copying of that document.\n-  </para>\n-  <bridgehead xml:id=\"Aggregation\" renderas=\"sect1\">\n-    7. AGGREGATION WITH INDEPENDENT WORKS\n-  </bridgehead>\n-  <para>\n-    A compilation of the Document or its derivatives with other separate and\n-    independent documents or works, in or on a volume of a storage or\n-    distribution medium, is called an \"aggregate\" if the copyright resulting\n-    from the compilation is not used to limit the legal rights of the\n-    compilation's users beyond what the individual works permit.  When the\n-    Document is included in an aggregate, this License does not apply to the\n-    other works in the aggregate which are not themselves derivative works of\n-    the Document.\n-  </para>\n-  <para>\n-    If the Cover Text requirement of section 3 is applicable to these copies\n-    of the Document, then if the Document is less than one half of the entire\n-    aggregate, the Document's Cover Texts may be placed on covers that bracket\n-    the Document within the aggregate, or the electronic equivalent of covers\n-    if the Document is in electronic form.  Otherwise they must appear on\n-    printed covers that bracket the whole aggregate.\n-  </para>\n-  <bridgehead xml:id=\"Translation\" renderas=\"sect1\">\n-    8. TRANSLATION\n-  </bridgehead>\n-  <para>\n-    Translation is considered a kind of modification, so you may distribute\n-    translations of the Document under the terms of section 4.  Replacing\n-    Invariant Sections with translations requires special permission from\n-    their copyright holders, but you may include translations of some or all\n-    Invariant Sections in addition to the original versions of these Invariant\n-    Sections.  You may include a translation of this License, and all the\n-    license notices in the Document, and any Warranty Disclaimers, provided\n-    that you also include the original English version of this License and the\n-    original versions of those notices and disclaimers.  In case of a\n-    disagreement between the translation and the original version of this\n-    License or a notice or disclaimer, the original version will prevail.\n-  </para>\n-  <para>\n-    If a section in the Document is Entitled \"Acknowledgements\",\n-    \"Dedications\", or \"History\", the requirement (section 4) to Preserve its\n-    Title (section 1) will typically require changing the actual title.\n-  </para>\n-  <bridgehead xml:id=\"fdl-1-termination\" renderas=\"sect1\">\n-    9. TERMINATION\n-  </bridgehead>\n-  <para>\n-    You may not copy, modify, sublicense, or distribute the Document except as\n-    expressly provided for under this License.  Any other attempt to copy,\n-    modify, sublicense or distribute the Document is void, and will\n-    automatically terminate your rights under this License.  However, parties\n-    who have received copies, or rights, from you under this License will not\n-    have their licenses terminated so long as such parties remain in full\n-    compliance.\n-  </para>\n-  <bridgehead xml:id=\"FutureRevisions\" renderas=\"sect1\">\n-    10. FUTURE REVISIONS OF THIS LICENSE\n-  </bridgehead>\n-  <para>\n-    The Free Software Foundation may publish new, revised versions of the GNU\n-    Free Documentation License from time to time.  Such new versions will be\n-    similar in spirit to the present version, but may differ in detail to\n-    address new problems or concerns.  See <link xmlns:xlink=\"http://www.w3.org/1999/xlink\" xlink:href=\"http://www.gnu.org/copyleft/\">http://www.gnu.org/copyleft/</link>.\n-  </para>\n-  <para>\n-    Each version of the License is given a distinguishing version number.  If\n-    the Document specifies that a particular numbered version of this License\n-    \"or any later version\" applies to it, you have the option of following the\n-    terms and conditions either of that specified version or of any later\n-    version that has been published (not as a draft) by the Free Software\n-    Foundation.  If the Document does not specify a version number of this\n-    License, you may choose any version ever published (not as a draft) by the\n-    Free Software Foundation.\n-  </para>\n-  <bridgehead xml:id=\"HowToUse\" renderas=\"sect1\">\n-    ADDENDUM: How to use this License for your documents\n-  </bridgehead>\n-  <para>\n-    To use this License in a document you have written, include a copy of the\n-    License in the document and put the following copyright and license\n-    notices just after the title page:\n-  </para>\n-  <blockquote>\n-    <para>\n-      Copyright (C) YEAR YOUR NAME.\n-    </para>\n-    <para>\n-      Permission is granted to copy, distribute and/or modify this document\n-      under the terms of the GNU Free Documentation License, Version 1.2 or\n-      any later version published by the Free Software Foundation; with no\n-      Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts.  A\n-      copy of the license is included in the section entitled \"GNU Free\n-      Documentation License\".\n-    </para>\n-  </blockquote>\n-  <para>\n-    If you have Invariant Sections, Front-Cover Texts and Back-Cover Texts,\n-    replace the \"with...Texts.\" line with this:\n-  </para>\n-  <blockquote>\n-    <para>\n-      with the Invariant Sections being LIST THEIR TITLES, with the\n-      Front-Cover Texts being LIST, and with the Back-Cover Texts being LIST.\n-    </para>\n-  </blockquote>\n-  <para>\n-    If you have Invariant Sections without Cover Texts, or some other\n-    combination of the three, merge those two alternatives to suit the\n-    situation.\n-  </para>\n-  <para>\n-    If your document contains nontrivial examples of program code, we\n-    recommend releasing these examples in parallel under your choice of free\n-    software license, such as the GNU General Public License, to permit their\n-    use in free software.\n-  </para>\n-</appendix>"}, {"sha": "cf012ec960b240a459b05c5ad1940faa0e668651", "filename": "libstdc++-v3/doc/xml/gnu/gpl-2.0.xml", "status": "removed", "additions": 0, "deletions": 364, "changes": 364, "blob_url": "https://github.com/Rust-GCC/gccrs/blob/24780fe16b9f147711fc51bf41a3aaf24858f7b4/libstdc%2B%2B-v3%2Fdoc%2Fxml%2Fgnu%2Fgpl-2.0.xml", "raw_url": "https://github.com/Rust-GCC/gccrs/raw/24780fe16b9f147711fc51bf41a3aaf24858f7b4/libstdc%2B%2B-v3%2Fdoc%2Fxml%2Fgnu%2Fgpl-2.0.xml", "contents_url": "https://api.github.com/repos/Rust-GCC/gccrs/contents/libstdc%2B%2B-v3%2Fdoc%2Fxml%2Fgnu%2Fgpl-2.0.xml?ref=24780fe16b9f147711fc51bf41a3aaf24858f7b4", "patch": "@@ -1,364 +0,0 @@\n-<appendix xmlns=\"http://docbook.org/ns/docbook\" version=\"5.0\" \n-\t  xml:id=\"appendix.gpl-2.0\">\n-  <info><title>GNU General Public License</title>\n-    \n-    <pubdate>Version 2, June 1991</pubdate>\n-    <copyright>\n-      <year>1989, 1991</year>\n-      <holder>Free Software Foundation, Inc.</holder>\n-    </copyright>\n-    <legalnotice xml:id=\"gpl-legalnotice\">\n-      <para>\n-\t<address>Free Software Foundation, Inc. \n-\t  <street>51 Franklin Street, Fifth Floor</street>, \n-\t  <city>Boston</city>, <state>MA</state> <postcode>02110-1301</postcode>\n-\t  <country>USA</country>\n-\t</address>\n-      </para>\n-      <para>Everyone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.</para>\n-    </legalnotice>\n-    <releaseinfo>Version 2, June 1991</releaseinfo>\n-  </info>\n-  \n-  <section xml:id=\"gpl-1\"><info><title>Preamble</title></info>\n-    \n-    <para>The licenses for most software are designed to take away your \n-      freedom to share and change it. By contrast, the GNU General Public License is \n-      intended to guarantee your freedom to share and change \n-      free software - to make sure the software is free for all its users. \n-      This General Public License applies to most of the Free Software \n-      Foundation's software and to any other program whose authors commit \n-      to using it. (Some other Free Software Foundation software is covered \n-      by the GNU Library General Public License instead.) You can apply it \n-      to your programs, too.</para>\n-\n-    <para>When we speak of free software, we are referring to freedom, not price. \n-      Our General Public Licenses are designed to make sure that you have the \n-      freedom to distribute copies of free software (and charge for this \n-      service if you wish), that you receive source code or can get it if you \n-      want it, that you can change the software or use pieces of it in new free \n-      programs; and that you know you can do these things.</para>\n-\n-    <para>To protect your rights, we need to make restrictions that forbid anyone \n-      to deny you these rights or to ask you to surrender the rights. These \n-      restrictions translate to certain responsibilities for you if you distribute \n-      copies of the software, or if you modify it.</para>\n-\n-    <para>For example, if you distribute copies of such a program, whether gratis or \n-      for a fee, you must give the recipients all the rights that you have. You \n-      must make sure that they, too, receive or can get the source code. And you \n-      must show them these terms so they know their rights.</para>\n-\n-    <para>We protect your rights with two steps:\n-      <orderedlist inheritnum=\"ignore\" continuation=\"restarts\">\n-\t<listitem>\n-\t  <para>copyright the software, and</para>\n-\t</listitem>\n-\t<listitem>\n-\t  <para>offer you this license which gives you legal permission to copy, \n-\t    distribute and/or modify the software.</para>\n-\t</listitem>\n-      </orderedlist>\n-    </para>\n-\n-    <para>Also, for each author's protection and ours, we want to make certain that \n-      everyone understands that there is no warranty for this free software. If \n-      the software is modified by someone else and passed on, we want its \n-      recipients to know that what they have is not the original, so that any \n-      problems introduced by others will not reflect on the original authors' \n-      reputations.</para>\n-\n-    <para>Finally, any free program is threatened constantly by software patents. \n-      We wish to avoid the danger that redistributors of a free program will \n-      individually obtain patent licenses, in effect making the program \n-      proprietary. To prevent this, we have made it clear that any patent must be \n-      licensed for everyone's free use or not licensed at all.</para>\n-\n-    <para>The precise terms and conditions for copying, distribution and modification \n-      follow.</para>\n-  </section>\n-  <section xml:id=\"gpl-2\"><info><title>TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION</title></info>\n-    \n-    <section xml:id=\"gpl-2-0\"><info><title>Section 0</title></info>\n-      \n-      <para>This License applies to any program or other work which contains a notice \n-\tplaced by the copyright holder saying it may be distributed under the terms \n-\tof this General Public License. The <quote>Program</quote>, below, refers to any such \n-\tprogram or work, and a \n-\t<quote>work based on the Program</quote> means either \n-\tthe Program or any derivative work under copyright law: that is to say, a \n-\twork containing the Program or a portion of it, either verbatim or with \n-\tmodifications and/or translated into another language. (Hereinafter, translation \n-\tis included without limitation in the term \n-\t<quote>modification</quote>.) Each licensee is addressed as <quote>you</quote>.</para>\n-\n-      <para>Activities other than copying, distribution and modification are not covered by \n-\tthis License; they are outside its scope. The act of running the Program is not \n-\trestricted, and the output from the Program is covered only if its contents \n-\tconstitute a work based on the Program (independent of having been made by running \n-\tthe Program). Whether that is true depends on what the Program does.</para>\n-    </section>\n-    <section xml:id=\"gpl-2-1\"><info><title>Section 1</title></info>\n-      \n-      <para>You may copy and distribute verbatim copies of the Program's source code as you \n-\treceive it, in any medium, provided that you conspicuously and appropriately \n-\tpublish on each copy an appropriate copyright notice and disclaimer of warranty; \n-\tkeep intact all the notices that refer to this License and to the absence of any \n-\twarranty; and give any other recipients of the Program a copy of this License \n-\talong with the Program.</para>\n-\n-      <para>You may charge a fee for the physical act of transferring a copy, and you may at \n-\tyour option offer warranty protection in exchange for a fee.</para>\n-    </section>\n-    <section xml:id=\"gpl-2-2\"><info><title>Section 2</title></info>\n-      \n-      <para>You may modify your copy or copies of the Program or any portion of it, thus \n-\tforming a work based on the Program, and copy and distribute such modifications \n-\tor work under the terms of \n-\t<link linkend=\"gpl-2-1\">Section 1</link> above, provided \n-\tthat you also meet all of these conditions:\n-\t<orderedlist numeration=\"loweralpha\" inheritnum=\"ignore\" continuation=\"restarts\">\n-\t  <listitem>\n-\t    <para>You must cause the modified files to carry prominent notices stating that \n-\t      you changed the files and the date of any change.</para>\n-\t  </listitem>\n-\t  <listitem>\n-\t    <para>You must cause any work that you distribute or publish, that in whole or \n-\t      in part contains or is derived from the Program or any part thereof, to be \n-\t      licensed as a whole at no charge to all third parties under the terms of \n-\t      this License.</para>\n-\t  </listitem>\n-\t  <listitem>\n-\t    <para>If the modified program normally reads commands interactively when run, you \n-\t      must cause it, when started running for such interactive use in the most \n-\t      ordinary way, to print or display an announcement including an appropriate \n-\t      copyright notice and a notice that there is no warranty (or else, saying \n-\t      that you provide a warranty) and that users may redistribute the program \n-\t      under these conditions, and telling the user how to view a copy of this \n-\t      License. (Exception: If the Program itself is interactive but does not \n-              normally print such an announcement, your work based on the Program is not \n-              required to print an   announcement.)</para>\n-\t  </listitem>\n-\t</orderedlist>\n-      </para>\n-\n-      <para>These requirements apply to the modified work as a whole. If identifiable sections \n-\tof that work are not derived from the Program, and can be reasonably considered \n-\tindependent and separate works in themselves, then this License, and its terms, \n-\tdo not apply to those sections when you distribute them as separate works. But when \n-\tyou distribute the same sections as part of a whole which is a work based on the \n-\tProgram, the distribution of the whole must be on the terms of this License, whose \n-\tpermissions for other licensees extend to the entire whole, and thus to each and \n-\tevery part regardless of who wrote it.</para>\n-\n-      <para>Thus, it is not the intent of this section to claim rights or contest your rights \n-\tto work written entirely by you; rather, the intent is to exercise the right to control \n-\tthe distribution of derivative or collective works based on the Program.</para>\n-\n-      <para>In addition, mere aggregation of another work not based on the Program with the Program \n-\t(or with a work based on the Program) on a volume of a storage or distribution medium \n-\tdoes not bring the other work under the scope of this License.</para>\n-    </section>\n-    <section xml:id=\"gpl-2-3\"><info><title>Section 3</title></info>\n-      \n-      <para>You may copy and distribute the Program (or a work based on it, under \n-\t<link linkend=\"gpl-2-2\">Section 2</link> in object code or executable form under the terms of \n-\t<link linkend=\"gpl-2-1\">Sections 1</link> and \n-\t<link linkend=\"gpl-2-2\">2</link> above provided that you also do one of the following:\n-\t<orderedlist numeration=\"loweralpha\" inheritnum=\"ignore\" continuation=\"restarts\">\n-\t  <listitem>\n-\t    <para>Accompany it with the complete corresponding machine-readable source code, which \n-\t      must be distributed under the terms of Sections 1 and 2 above on a medium \n-\t      customarily used for software interchange; or,</para>\n-\t  </listitem>\n-\t  <listitem>\n-\t    <para>Accompany it with a written offer, valid for at least three years, to give any \n-\t      third party, for a charge no more than your cost of physically performing source \n-\t      distribution, a complete machine-readable copy of the corresponding source code, \n-\t      to be distributed under the terms of Sections 1 and 2 above on a medium customarily \n-\t      used for software interchange; or,</para>\n-\t  </listitem>\n-\t  <listitem>\n-\t    <para>Accompany it with the information you received as to the offer to distribute \n-\t      corresponding source code. (This alternative is allowed only for noncommercial \n-\t      distribution and only if you received the program in object code or executable form \n-\t      with such an offer, in accord with Subsection b above.)</para>\n-\t  </listitem>\n-\t</orderedlist>\n-      </para>\n-\n-      <para>The source code for a work means the preferred form of the work for making modifications \n-\tto it. For an executable work, complete source code means all the source code for all modules \n-\tit contains, plus any associated interface definition files, plus the scripts used to control \n-\tcompilation and installation of the executable. However, as a special exception, the source \n-\tcode distributed need not include anything that is normally distributed (in either source or \n-\tbinary form) with the major components (compiler, kernel, and so on) of the operating system \n-\ton which the executable runs, unless that component itself accompanies the executable.</para>\n-\n-      <para>If distribution of executable or object code is made by offering access to copy from a \n-\tdesignated place, then offering equivalent access to copy the source code from the same place \n-\tcounts as distribution of the source code, even though third parties are not compelled to \n-\tcopy the source along with the object code.</para>\n-    </section>\n-    <section xml:id=\"gpl-2-4\"><info><title>Section 4</title></info>\n-      \n-      <para>You may not copy, modify, sublicense, or distribute the Program except as expressly provided \n-\tunder this License. Any attempt otherwise to copy, modify, sublicense or distribute the \n-\tProgram is void, and will automatically terminate your rights under this License. However, \n-\tparties who have received copies, or rights, from you under this License will not have their \n-\tlicenses terminated so long as such parties remain in full compliance.</para>\n-    </section>\n-    <section xml:id=\"gpl-2-5\"><info><title>Section 5</title></info>\n-      \n-      <para>You are not required to accept this License, since you have not signed it. However, nothing \n-\telse grants you permission to modify or distribute the Program or its derivative works. \n-\tThese actions are prohibited by law if you do not accept this License. Therefore, by modifying \n-\tor distributing the Program (or any work based on the Program), you indicate your acceptance \n-\tof this License to do so, and all its terms and conditions for copying, distributing or \n-\tmodifying the Program or works based on it.</para>\n-    </section>\n-    <section xml:id=\"gpl-2-6\"><info><title>Section 6</title></info>\n-      \n-      <para>Each time you redistribute the Program (or any work based on the Program), the recipient \n-\tautomatically receives a license from the original licensor to copy, distribute or modify \n-\tthe Program subject to these terms and conditions. You may not impose any further restrictions \n-\ton the recipients' exercise of the rights granted herein. You are not responsible for enforcing \n-\tcompliance by third parties to this License.</para>\n-    </section>\n-    <section xml:id=\"gpl-2-7\"><info><title>Section 7</title></info>\n-      \n-      <para>If, as a consequence of a court judgment or allegation of patent infringement or for any other \n-\treason (not limited to patent issues), conditions are imposed on you (whether by court order, \n-\tagreement or otherwise) that contradict the conditions of this License, they do not excuse you \n-\tfrom the conditions of this License. If you cannot distribute so as to satisfy simultaneously \n-\tyour obligations under this License and any other pertinent obligations, then as a consequence \n-\tyou may not distribute the Program at all. For example, if a patent license would not permit \n-\troyalty-free redistribution of the Program by all those who receive copies directly or \n-\tindirectly through you, then the only way you could satisfy both it and this License would be \n-\tto refrain entirely from distribution of the Program.</para>\n-\n-      <para>If any portion of this section is held invalid or unenforceable under any particular circumstance, \n-\tthe balance of the section is intended to apply and the section as a whole is intended to apply \n-\tin other circumstances.</para>\n-\n-      <para>It is not the purpose of this section to induce you to infringe any patents or other property \n-\tright claims or to contest validity of any such claims; this section has the sole purpose of \n-\tprotecting the integrity of the free software distribution system, which is implemented by public \n-\tlicense practices. Many people have made generous contributions to the wide range of software \n-\tdistributed through that system in reliance on consistent application of that system; it is up \n-\tto the author/donor to decide if he or she is willing to distribute software through any other \n-\tsystem and a licensee cannot impose that choice.</para>\n-\n-      <para>This section is intended to make thoroughly clear what is believed to be a consequence of the \n-\trest of this License.</para>\n-    </section>\n-    <section xml:id=\"gpl-2-8\"><info><title>Section 8</title></info>\n-      \n-      <para>If the distribution and/or use of the Program is restricted in certain countries either by patents \n-\tor by copyrighted interfaces, the original copyright holder who places the Program under this License \n-\tmay add an explicit geographical distribution limitation excluding those countries, so that \n-\tdistribution is permitted only in or among countries not thus excluded. In such case, this License \n-\tincorporates the limitation as if written in the body of this License.</para>\n-    </section>\n-    <section xml:id=\"gpl-2-9\"><info><title>Section 9</title></info>\n-      \n-      <para>The Free Software Foundation may publish revised and/or new versions of the General Public License \n-\tfrom time to time. Such new versions will be similar in spirit to the present version, but may differ \n-\tin detail to address new problems or concerns.</para>\n-\n-      <para>Each version is given a distinguishing version number. If the Program specifies a version number of \n-\tthis License which applies to it and <quote>any later version</quote>, you have the option of following the terms \n-\tand conditions either of that version or of any later version published by the Free Software \n-\tFoundation. If the Program does not specify a version number of this License, you may choose any \n-\tversion ever published by the Free Software Foundation.</para>\n-    </section>\n-    <section xml:id=\"gpl-2-10\"><info><title>Section 10</title></info>\n-      \n-      <para>If you wish to incorporate parts of the Program into other free programs whose distribution \n-\tconditions are different, write to the author to ask for permission. For software which is copyrighted \n-\tby the Free Software Foundation, write to the Free Software Foundation; we sometimes make exceptions \n-\tfor this. Our decision will be guided by the two goals of preserving the free status of all \n-\tderivatives of our free software and of promoting the sharing and reuse of software generally.</para>\n-    </section>\n-    <section xml:id=\"gpl-2-11\"><info><title>NO WARRANTY Section 11</title></info>\n-      \n-      <para>BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT \n-\tPERMITTED BY APPLICABLE LAW. EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR \n-\tOTHER PARTIES PROVIDE THE PROGRAM <quote>AS IS</quote> WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, \n-\tINCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR \n-\tPURPOSE. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU. SHOULD THE \n-\tPROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.</para>\n-    </section>\n-    <section xml:id=\"gpl-2-12\"><info><title>Section 12</title></info>\n-      \n-      <para>IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL ANY COPYRIGHT HOLDER, OR \n-\tANY OTHER PARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU \n-\tFOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE \n-\tUSE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING RENDERED \n-\tINACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH \n-\tANY OTHER PROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH \n-\tDAMAGES.</para>\n-\n-      <para>END OF TERMS AND CONDITIONS</para>\n-    </section>\n-  </section>\n-  <section xml:id=\"gpl-3\"><info><title>How to Apply These Terms to Your New Programs</title></info>\n-    \n-    <para>If you develop a new program, and you want it to be of the greatest\n-      possible use to the public, the best way to achieve this is to make it\n-      free software which everyone can redistribute and change under these terms.</para>\n-\n-    <para>To do so, attach the following notices to the program.  It is safest\n-      to attach them to the start of each source file to most effectively\n-      convey the exclusion of warranty; and each file should have at least\n-      the <quote>copyright</quote> line and a pointer to where the full notice is found.</para>\n-\n-    <para>&lt;one line to give the program's name and a brief idea of what it does.&gt;\n-      Copyright (C) &lt;year&gt;    &lt;name of author&gt;</para>\n-\n-    <para>This program is free software; you can redistribute it and/or modify\n-      it under the terms of the GNU General Public License as published by\n-      the Free Software Foundation; either version 2 of the License, or\n-      (at your option) any later version.</para>\n-\n-    <para>This program is distributed in the hope that it will be useful,\n-      but WITHOUT ANY WARRANTY; without even the implied warranty of\n-      MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n-      GNU General Public License for more details.</para>\n-\n-    <para>You should have received a copy of the GNU General Public License\n-      along with this program; if not, write to the Free Software\n-      Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301  USA</para>\n-\n-    <para>Also add information on how to contact you by electronic and paper mail.</para>\n-\n-    <para>If the program is interactive, make it output a short notice like this\n-      when it starts in an interactive mode:</para>\n-\n-    <para>Gnomovision version 69, Copyright (C) year name of author\n-      Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type <quote>show w</quote>.\n-      This is free software, and you are welcome to redistribute it\n-      under certain conditions; type <quote>show c</quote> for details.</para>\n-\n-    <para>The hypothetical commands <quote>show w</quote> and <quote>show c</quote> should \n-      show the appropriate parts of the General Public License.  Of course, the commands you \n-      use may be called something other than <quote>show w</quote> and <quote>show c</quote>; \n-      they could even be mouse-clicks or menu items--whatever suits your program.</para>\n-\n-    <para>You should also get your employer (if you work as a programmer) or your\n-      school, if any, to sign a <quote>copyright disclaimer</quote> for the program, if\n-      necessary.  Here is a sample; alter the names:</para>\n-\n-    <para>Yoyodyne, Inc., hereby disclaims all copyright interest in the program\n-      <quote>Gnomovision</quote> (which makes passes at compilers) written by James Hacker.</para>\n-\n-    <para>&lt;signature of Ty Coon&gt;, 1 April 1989\n-      Ty Coon, President of Vice</para>\n-\n-    <para>This General Public License does not permit incorporating your program into\n-      proprietary programs.  If your program is a subroutine library, you may\n-      consider it more useful to permit linking proprietary applications with the\n-      library.  If this is what you want to do, use the GNU Library General\n-      Public License instead of this License.</para>\n-  </section>\n-</appendix>"}]}