{"sha": "42c10750911b52ea95101f93eb29803c9064a420", "node_id": "MDY6Q29tbWl0MTM2NTMxMDA6NDJjMTA3NTA5MTFiNTJlYTk1MTAxZjkzZWIyOTgwM2M5MDY0YTQyMA==", "commit": {"author": {"name": "Gerald Pfeifer", "email": "pfeifer@dbai.tuwien.ac.at", "date": "2000-10-18T09:05:45Z"}, "committer": {"name": "Gerald Pfeifer", "email": "gerald@gcc.gnu.org", "date": "2000-10-18T09:05:45Z"}, "message": "contrib.texi: Update references to steering committee members and Jeff Law's entry.\n\n\t* contrib.texi: Update references to steering committee members\n\tand Jeff Law's entry.\n\nFrom-SVN: r36933", "tree": {"sha": "c86f652a6c5efeaead676f776b31e2ed3932118e", "url": "https://api.github.com/repos/Rust-GCC/gccrs/git/trees/c86f652a6c5efeaead676f776b31e2ed3932118e"}, "url": "https://api.github.com/repos/Rust-GCC/gccrs/git/commits/42c10750911b52ea95101f93eb29803c9064a420", "comment_count": 0, "verification": {"verified": false, "reason": "unsigned", "signature": null, "payload": null}}, "url": "https://api.github.com/repos/Rust-GCC/gccrs/commits/42c10750911b52ea95101f93eb29803c9064a420", "html_url": "https://github.com/Rust-GCC/gccrs/commit/42c10750911b52ea95101f93eb29803c9064a420", "comments_url": "https://api.github.com/repos/Rust-GCC/gccrs/commits/42c10750911b52ea95101f93eb29803c9064a420/comments", "author": null, "committer": null, "parents": [{"sha": "864ab6c772dd69ec4e79bfb074f5235006de9edd", "url": "https://api.github.com/repos/Rust-GCC/gccrs/commits/864ab6c772dd69ec4e79bfb074f5235006de9edd", "html_url": "https://github.com/Rust-GCC/gccrs/commit/864ab6c772dd69ec4e79bfb074f5235006de9edd"}], "stats": {"total": 58, "additions": 34, "deletions": 24}, "files": [{"sha": "46e67c24ee7abb44c3d13cadac6f650e1fa7f20d", "filename": "gcc/ChangeLog", "status": "modified", "additions": 5, "deletions": 0, "changes": 5, "blob_url": "https://github.com/Rust-GCC/gccrs/blob/42c10750911b52ea95101f93eb29803c9064a420/gcc%2FChangeLog", "raw_url": "https://github.com/Rust-GCC/gccrs/raw/42c10750911b52ea95101f93eb29803c9064a420/gcc%2FChangeLog", "contents_url": "https://api.github.com/repos/Rust-GCC/gccrs/contents/gcc%2FChangeLog?ref=42c10750911b52ea95101f93eb29803c9064a420", "patch": "@@ -1,3 +1,8 @@\n+2000-10-18  Gerald Pfeifer  <pfeifer@dbai.tuwien.ac.at>\n+\n+\t* contrib.texi: Update references to steering committee members\n+\tand Jeff Law's entry.\n+\n 2000-10-18  Joseph S. Myers  <jsm28@cam.ac.uk>\n \n \t* c-common.c (CPLUSPLUS_STD_VER, C_STD_VER, C_STD_NAME): Define."}, {"sha": "0fa2b446bbc683386bb290875cae04d9e3aba68c", "filename": "gcc/contrib.texi", "status": "modified", "additions": 29, "deletions": 24, "changes": 53, "blob_url": "https://github.com/Rust-GCC/gccrs/blob/42c10750911b52ea95101f93eb29803c9064a420/gcc%2Fcontrib.texi", "raw_url": "https://github.com/Rust-GCC/gccrs/raw/42c10750911b52ea95101f93eb29803c9064a420/gcc%2Fcontrib.texi", "contents_url": "https://api.github.com/repos/Rust-GCC/gccrs/contents/gcc%2Fcontrib.texi?ref=42c10750911b52ea95101f93eb29803c9064a420", "patch": "@@ -25,8 +25,9 @@ Gerald Baumgartner added the signature extension to the C++ front-end.\n Neil Booth for various work on cpplib.\n \n @item\n-Per Bothner for various improvements to our infrastructure for\n-supporting new languages.  Chill and Java.\n+Per Bothner for his direction via the steering committee and various\n+improvements to our infrastructure for supporting new languages.  Chill\n+and Java.\n \n @item\n Devon Bowen helped port GCC to the Tahoe.\n@@ -47,14 +48,14 @@ Christian Bruel for improvements to local store elimination.\n Herman A.J. ten Brugge for various fixes.\n \n @item\n-Joe Buck for his guidance and leadership via the steering committee.\n+Joe Buck for his direction via the steering committee.\n \n @item\n Craig Burley for leadership of the Fortran effort.\n \n @item\n John Carr for his alias work, SPARC hacking, infrastructure improvements,\n-direction via the steering committee, loop optimizations, etc.\n+previous contributions to the steering committee, loop optimizations, etc.\n \n @item\n Steve Chamberlain wrote the support for the Hitachi SH and H8 processors\n@@ -125,17 +126,18 @@ Peter Gerwinski for various bugfixes and the Pascal front end.\n @item\n Anthony Green for his -Os contributions and Java front end work.\n \n-@item\n-Kaveh Ghazi for overall direction via the steering committee and\n+@item \n+Kaveh Ghazi for his direction via the steering committee and\n amazing work to make -W -Wall useful.\n \n @item\n Judy Goldberg for c++ contributions.\n \n @item\n Torbjorn Granlund for various fixes and the c-torture testsuite,\n-multiply- and divide-by-constant optimization, improved long long support,\n-and improved leaf function register allocation.\n+multiply- and divide-by-constant optimization, improved long long\n+support, improved leaf function register allocation, and his direction\n+via the steering committee.\n \n @item\n Michael K. Gschwind contributed the port to the PDP-11.\n@@ -255,12 +257,13 @@ Charles LaBrec contributed the support for the Integrated Solutions\n 68020 system.\n \n @item\n-Jeff Law for coordinating the entire project, rolling out snapshots\n-and releases, handling merges from GCC2, and random but extensive\n-hacking.\n+Jeff Law for his direction via the steering committee, coordinating the\n+entire egcs project and GCC 2.95, rolling out snapshots and releases,\n+handling merges from GCC2, reviewing tons of patches that might have\n+fallen through the cracks else, and random but extensive hacking.\n \n @item\n-Marc Lehmann for his guidance via the steering committee and helping\n+Marc Lehmann for his direction via the steering committee and helping\n with analysis and improvements of x86 performance.\n \n @item\n@@ -288,7 +291,7 @@ Dave Love for his ongoing work with the Fortran front end and\n runtime libraries.\n \n @item\n-H.J. Lu for his contributions to the steering committee, many x86\n+H.J. Lu for his previous contributions to the steering committee, many x86\n bug reports, prototype patches, and keeping the Linux ports working.\n \n @item\n@@ -311,7 +314,8 @@ Michael Meissner for LRS framework, ia32, m32r, v850, m88k, MIPS powerpc, haifa,\n ECOFF debug support, and other assorted hacking.\n \n @item\n-Jason Merrill for leading the g++ effort.\n+Jason Merrill for his direction via the steering committee and leading\n+the g++ effort.\n \n @item\n Jason Molenda for major help in the care and feeding of all the services\n@@ -330,24 +334,24 @@ than 64 bits and for ISO C99 support.\n Bill Moyer for his behind the scenes work on various issues.\n \n @item\n-David Miller for overall direction via the steering committee, lots of\n+David Miller for his direction via the steering committee, lots of\n SPARC work, improvements in jump.c and interfacing with the Linux kernel\n developers.\n \n @item\n Gary Miller ported GCC to Charles River Data Systems machines.\n \n @item\n-Mark Mitchell for mountains of\n-C++ work, load/store hoisting out of\n-loops and alias analysis improvements, ISO \"restrict\" support.\n+Mark Mitchell for his direction via the steering committee, mountains\n+of C++ work, load/store hoisting out of loops and alias analysis\n+improvements, ISO \"restrict\" support.\n \n @item\n Alan Modra for various Linux bits and testing.\n \n @item\n-Toon Moene for overall leadership via the steering committee, and his\n-ongoing work to make us make Fortran run fast.\n+Toon Moene for his direction via the steering committee, Fortran\n+maintainance, and his ongoing work to make us make Fortran run fast.\n \n @item\n Catherine Moore for fixing various ugly problems we have sent her\n@@ -396,8 +400,8 @@ Alexandre Petit-Bianco for his Java work.\n Matthias Pfaller for major improvements to the NS32k port.\n \n @item\n-Gerald Pfeifer for maintenance of the web pages and pointing out lots\n-of problems we need to solve.\n+Gerald Pfeifer his direction via the steering committee, maintenance of\n+the web pages and pointing out lots of problems we need to solve.\n \n @item\n Ovidiu Predescu for his work on the ObjC front end and runtime libraries.\n@@ -550,8 +554,9 @@ Dale Wiles helped port GCC to the Tahoe.\n Zack Weinberg for major work on cpplib and various other bugfixes.\n \n @item\n-Jim Wilson for tackling hard problems in various places that nobody else\n-wanted to work on, strength reduction and other loop optimizations.\n+Jim Wilson for his direction via the steering committee, tackling hard\n+problems in various places that nobody else wanted to work on, strength\n+reduction and other loop optimizations.\n \n @item\n Carlo Wood for various fixes."}]}