{"sha": "6f5ed7369f36c1206dab010fb95b5349509b1bc2", "node_id": "MDY6Q29tbWl0MTM2NTMxMDA6NmY1ZWQ3MzY5ZjM2YzEyMDZkYWIwMTBmYjk1YjUzNDk1MDliMWJjMg==", "commit": {"author": {"name": "Benjamin Kosnik", "email": "bkoz@purist.soma.redhat.com", "date": "2000-05-23T04:24:31Z"}, "committer": {"name": "Benjamin Kosnik", "email": "bkoz@gcc.gnu.org", "date": "2000-05-23T04:24:31Z"}, "message": "libstdc++-assign.txt: Change Cygnus to FSF.\n\n\n2000-05-22  Benjamin Kosnik  <bkoz@purist.redhat.soma.com>\n\n\t* docs/17_intro/libstdc++-assign.txt: Change Cygnus to FSF.\n\nFrom-SVN: r34099", "tree": {"sha": "734589d32638aadbcf3d5f580049bed89a01d2a6", "url": "https://api.github.com/repos/Rust-GCC/gccrs/git/trees/734589d32638aadbcf3d5f580049bed89a01d2a6"}, "url": "https://api.github.com/repos/Rust-GCC/gccrs/git/commits/6f5ed7369f36c1206dab010fb95b5349509b1bc2", "comment_count": 0, "verification": {"verified": false, "reason": "unsigned", "signature": null, "payload": null}}, "url": "https://api.github.com/repos/Rust-GCC/gccrs/commits/6f5ed7369f36c1206dab010fb95b5349509b1bc2", "html_url": "https://github.com/Rust-GCC/gccrs/commit/6f5ed7369f36c1206dab010fb95b5349509b1bc2", "comments_url": "https://api.github.com/repos/Rust-GCC/gccrs/commits/6f5ed7369f36c1206dab010fb95b5349509b1bc2/comments", "author": null, "committer": null, "parents": [{"sha": "ca1117ccf724e0b1b543e3e7b607087444340191", "url": "https://api.github.com/repos/Rust-GCC/gccrs/commits/ca1117ccf724e0b1b543e3e7b607087444340191", "html_url": "https://github.com/Rust-GCC/gccrs/commit/ca1117ccf724e0b1b543e3e7b607087444340191"}], "stats": {"total": 87, "additions": 49, "deletions": 38}, "files": [{"sha": "a11f2a2bda5d535d0dc21d38780731af10c17851", "filename": "libstdc++-v3/ChangeLog", "status": "modified", "additions": 4, "deletions": 0, "changes": 4, "blob_url": "https://github.com/Rust-GCC/gccrs/blob/6f5ed7369f36c1206dab010fb95b5349509b1bc2/libstdc%2B%2B-v3%2FChangeLog", "raw_url": "https://github.com/Rust-GCC/gccrs/raw/6f5ed7369f36c1206dab010fb95b5349509b1bc2/libstdc%2B%2B-v3%2FChangeLog", "contents_url": "https://api.github.com/repos/Rust-GCC/gccrs/contents/libstdc%2B%2B-v3%2FChangeLog?ref=6f5ed7369f36c1206dab010fb95b5349509b1bc2", "patch": "@@ -1,3 +1,7 @@\n+2000-05-22  Benjamin Kosnik  <bkoz@purist.redhat.soma.com>\n+\n+\t* docs/17_intro/libstdc++-assign.txt: Change Cygnus to FSF.\n+\n 2000-05-22  Phil Edwards  <pme@sourceware.cygnus.com>\n \n \t* mkcheck.in:  Tweak for Solaris 8.  Additional minor output comment."}, {"sha": "b70be688bcae63bd45fc29e2d3447b72d179e490", "filename": "libstdc++-v3/docs/17_intro/libstdc++-assign.txt", "status": "modified", "additions": 45, "deletions": 38, "changes": 83, "blob_url": "https://github.com/Rust-GCC/gccrs/blob/6f5ed7369f36c1206dab010fb95b5349509b1bc2/libstdc%2B%2B-v3%2Fdocs%2F17_intro%2Flibstdc%2B%2B-assign.txt", "raw_url": "https://github.com/Rust-GCC/gccrs/raw/6f5ed7369f36c1206dab010fb95b5349509b1bc2/libstdc%2B%2B-v3%2Fdocs%2F17_intro%2Flibstdc%2B%2B-assign.txt", "contents_url": "https://api.github.com/repos/Rust-GCC/gccrs/contents/libstdc%2B%2B-v3%2Fdocs%2F17_intro%2Flibstdc%2B%2B-assign.txt?ref=6f5ed7369f36c1206dab010fb95b5349509b1bc2", "patch": "@@ -1,8 +1,8 @@\n-The way to assign copyright to Cygnus Solutions is to sign an assignment\n-contract.  This is what legally makes Cygnus Solutions the copyright\n-holder so that we can register the copyright on the new version.\n-I'm assuming that you wrote these changes yourself;\n-if other people wrote parts, we may need papers from them.\n+The way to assign copyright to the Free Software Foundation is to sign\n+an assignment contract.  This is what legally makes the Free Software\n+Foundation the copyright holder so that we can register the copyright\n+on the new version.  I'm assuming that you wrote these changes\n+yourself; if other people wrote parts, we may need papers from them.\n \n If you are employed to do programming (even at a university), or have\n made an agreement with your employer or school saying it owns programs\n@@ -41,10 +41,10 @@ open Pandora's box and cause a long and unnecessary delay.\n Below is the assignment contract that we usually use.  You need\n to print it out, sign it, and snail it to:\n \n-Benjamin Kosnik\n-Cygnus Solutions\n-1325 Chesapeake Terrace\n-Sunnyvale, CA 94089 USA\n+Richard Stallman \n+545 Tech Sq rm 425 \n+Cambridge, MA 02139 \n+USA \n \n Please try to print the whole first page below on a single piece of\n paper.  If it doesn't fit on one printed page, put it on two sides of\n@@ -58,51 +58,58 @@ Europe.\n Snail a copy of the employer's disclaimer as well.\n \n Please send me email about what you decide to do.  If you have any\n-questions, or would like something to be changed, ask bkoz@cygnus.com via\n+questions, or would like something to be changed, ask bkoz@gnu.org via\n email.\n \f                           ASSIGNMENT\n \n-   For good and valuable consideration, receipt of which I acknowledge, I,\n-[your name here], hereby transfer to Cygnus Solutions, Inc. (\"Cygnus\")\n-my entire right, title, and interest (including all rights under copyright)\n-in my changes and enhancements to the libstdc++ library, subject to the\n-conditions below.  These changes and enhancements are herein called the\n-\"Work\".  The work hereby assigned shall also include any future revisions\n-of these changes and enhancements hereafter made by me.\n+   For good and valuable consideration, receipt of which I\n+acknowledge, I, [your name here], hereby transfer to the Free Software\n+Foundation, Inc. (the \"Foundation\") my entire right, title, and\n+interest (including all rights under copyright) in my changes and\n+enhancements to the libstdc++ library, subject to the conditions\n+below.  These changes and enhancements are herein called the \"Work\".\n+The work hereby assigned shall also include any future revisions of\n+these changes and enhancements hereafter made by me.\n \n-   Upon thirty days' prior written notice, Cygnus agrees to\n+   Upon thirty days' prior written notice, the \"Foundation\" agrees to\n grant me non-exclusive rights to use the Work (i.e. my changes and\n enhancements, not the program which I enhanced) as I see fit; (and\n-Cygnus's rights shall otherwise continue unchanged).\n+the \"Foundation\"'s rights shall otherwise continue unchanged).\n \n    I hereby agree that if I have or acquire hereafter any patent or\n-interface copyright or other intellectual property interest dominating the\n-program enhanced by the Work (or use of that program), such dominating\n-interest will not be used to undermine the effect of this assignment, i.e.\n-Cygnus and the general public will be licensed to use, in that program and\n-its derivative works, without royalty or limitation, the subject matter of\n-the dominating interest.  This license provision will be binding on my\n-heirs, assignees, or other successors to the dominating interest, as well\n-as on me.\n-\n-   I hereby represent and warrant that I am the sole copyright holder for the\n-Work and that I have the right and power to enter into this contract.  I\n-hereby indemnify and hold harmless Cygnus, its officers, employees,\n-and agents against any and all claims, actions or damages (including\n-attorney's reasonable fees) asserted by or paid to any party on account of a\n-breach or alleged breach of the foregoing warranty.  I make no other express\n-or implied warranty (including without limitation, in this disclaimer of\n-warranty, any warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE).\n+interface copyright or other intellectual property interest dominating\n+the program enhanced by the Work (or use of that program), such\n+dominating interest will not be used to undermine the effect of this\n+assignment, i.e.  the \"Foundation\" and the general public will be\n+licensed to use, in that program and its derivative works, without\n+royalty or limitation, the subject matter of the dominating interest.\n+This license provision will be binding on my heirs, assignees, or\n+other successors to the dominating interest, as well as on me.\n+\n+   I hereby represent and warrant that I am the sole copyright holder\n+for the Work and that I have the right and power to enter into this\n+contract.  I hereby indemnify and hold harmless the \"Foundation\", its\n+officers, employees, and agents against any and all claims, actions or\n+damages (including attorney's reasonable fees) asserted by or paid to\n+any party on account of a breach or alleged breach of the foregoing\n+warranty.  I make no other express or implied warranty (including\n+without limitation, in this disclaimer of warranty, any warranty of\n+MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE).\n \n Agreed:  [signature]                    Date [Write the month with LETTERS]:\n \n \n-For Cygnus,\n-Alex Daly, CEO\n+For the \"Foundation\",\n+Richard Stallman, head dude in charge\n \f\n Please do not delete the control-l character before this line.\n Please print this as a separate page.\n \n+Please email a copy of the information on this page to\n+fsf-records@gnu.ai.mit.edu, and cc bkoz@gnu.org, if you can, so that\n+our clerk doesn't have to type it in.  Use your full name as the\n+subject line.\n+\n [For the copyright registration, what country are you a citizen of?\n What year were you born?]\n "}]}