{"sha": "73bb94549e0777fbd981ad68745efa6c0715f0c5", "node_id": "MDY6Q29tbWl0MTM2NTMxMDA6NzNiYjk0NTQ5ZTA3NzdmYmQ5ODFhZDY4NzQ1ZWZhNmMwNzE1ZjBjNQ==", "commit": {"author": {"name": "Jeff Law", "email": "law@gcc.gnu.org", "date": "2000-05-25T01:28:57Z"}, "committer": {"name": "Jeff Law", "email": "law@gcc.gnu.org", "date": "2000-05-25T01:28:57Z"}, "message": "gcc.texi: Remove contributor list.\n\n        * gcc.texi: Remove contributor list.  Instead include contrib.texi.\n        * contrib.texi: New file.\n\nFrom-SVN: r34152", "tree": {"sha": "b1d3e760103afd9736d10a64758b4f65c932b23a", "url": "https://api.github.com/repos/Rust-GCC/gccrs/git/trees/b1d3e760103afd9736d10a64758b4f65c932b23a"}, "url": "https://api.github.com/repos/Rust-GCC/gccrs/git/commits/73bb94549e0777fbd981ad68745efa6c0715f0c5", "comment_count": 0, "verification": {"verified": false, "reason": "unsigned", "signature": null, "payload": null}}, "url": "https://api.github.com/repos/Rust-GCC/gccrs/commits/73bb94549e0777fbd981ad68745efa6c0715f0c5", "html_url": "https://github.com/Rust-GCC/gccrs/commit/73bb94549e0777fbd981ad68745efa6c0715f0c5", "comments_url": "https://api.github.com/repos/Rust-GCC/gccrs/commits/73bb94549e0777fbd981ad68745efa6c0715f0c5/comments", "author": null, "committer": null, "parents": [{"sha": "98d1cd45719bc8a96ad8b2ada02e9d1791d62b25", "url": "https://api.github.com/repos/Rust-GCC/gccrs/commits/98d1cd45719bc8a96ad8b2ada02e9d1791d62b25", "html_url": "https://github.com/Rust-GCC/gccrs/commit/98d1cd45719bc8a96ad8b2ada02e9d1791d62b25"}], "stats": {"total": 865, "additions": 681, "deletions": 184}, "files": [{"sha": "e2ec005767333af350e40fc9533e23d57e7152c8", "filename": "gcc/contrib.texi", "status": "added", "additions": 680, "deletions": 0, "changes": 680, "blob_url": "https://github.com/Rust-GCC/gccrs/blob/73bb94549e0777fbd981ad68745efa6c0715f0c5/gcc%2Fcontrib.texi", "raw_url": "https://github.com/Rust-GCC/gccrs/raw/73bb94549e0777fbd981ad68745efa6c0715f0c5/gcc%2Fcontrib.texi", "contents_url": "https://api.github.com/repos/Rust-GCC/gccrs/contents/gcc%2Fcontrib.texi?ref=73bb94549e0777fbd981ad68745efa6c0715f0c5", "patch": "@@ -0,0 +1,680 @@\n+The GCC project would like to thank its many contributors.  Without them the\n+project would not have been nearly as successful as it has been.  Any omissions\n+in this list are accidental.  Feel free to contact\n+@code{law@@cygnus.com} if you have been left out\n+or some of your contributions are not listed.  Please keep this list in\n+alphabetical order.\n+\n+@itemize @bullet\n+\n+@item\n+Analog Devices helped implement the support for complex data types\n+and iterators.\n+\n+@item\n+James van Artsdalen wrote the code that makes efficient use of\n+the Intel 80387 register stack.\n+\n+@item\n+Alasdair Baird for various bugfixes.\n+\n+@item\n+Gerald Baumgartner added the signature extension to the C++ front-end.\n+\n+@item\n+Per Bothner for various improvements to our infrastructure for\n+supporting new languages.  Chill and Java.\n+\n+@item\n+Devon Bowen helped port GCC to the Tahoe.\n+\n+@item\n+Don Bowman for mips-vxworks contributions.\n+\n+@item\n+Dave Brolley for work on cpplib and Chill.\n+\n+@item\n+Robert Brown implemented the support for Encore 32000 systems.\n+\n+@item\n+Christian Bruel for improvements to local store elimination.\n+\n+@item\n+Herman A.J. ten Brugge for various fixes.\n+\n+@item\n+Joe Buck for his guidance and leadership via the steering committee.\n+\n+@item\n+Craig Burley for leadership of the Fortran effort.\n+\n+@item\n+John Carr for his alias work, SPARC hacking, infrastructure improvements,\n+direction via the steering committee, loop optimizations, etc.\n+\n+@item\n+Steve Chamberlain wrote the support for the Hitachi SH and H8 processors\n+and the PicoJava processor.\n+\n+@item\n+Scott Christley for his ObjC contributions.\n+\n+@item\n+Branko Cibej for more warning contributions.\n+\n+@item\n+Nick Clifton for arm, mcore, fr30, v850, m32r work, --help, and other random\n+hacking.\n+\n+@item\n+Ralf Corsepius for SH testing and minor bugfixing.\n+\n+@item\n+Stan Cox for care and feeding of the x86 port and lots of behind\n+the scenes hacking.\n+\n+@item\n+Alex Crain provided changes for the 3b1.\n+\n+@item\n+Ian Dall for major improvements to the NS32k port.\n+\n+@item\n+Dario Dariol contributed the four varieties of sample programs\n+that print a copy of their source.\n+\n+@item\n+Ulrich Drepper for his work on the C++ runtime libraries, glibc, \n+ testing of GCC using glibc, ISO C9X support, CFG dumping support, etc.\n+\n+@item\n+Richard Earnshaw for his ongoing work with the ARM.\n+\n+@item\n+David Edelsohn for his direction via the steering committee,\n+ongoing work with the RS6000/PowerPC port, and help cleaning up Haifa\n+loop changes.\n+\n+@item\n+Mark Elbrecht for various DJGPP improvements.\n+\n+@item\n+Ben Elliston for his work to move the Objective-C runtime into its\n+own subdirectory and for his work on autoconf.\n+\n+@item\n+Paul Eggert for random hacking all over gcc.\n+\n+@item\n+Marc Espie for OpenBSD support.\n+\n+@item\n+Doug Evans for much of the global optimization framework, arc, m32r,\n+and SPARC work.\n+\n+@item\n+Fred Fish for BeOS support and Ada fixes.\n+\n+@item\n+Peter Gerwinski for various bugfixes and the Pascal front end.\n+\n+@item\n+Anthony Green for his -Os contributions and Java front end work.\n+\n+@item\n+Kaveh Ghazi for overall direction via the steering committee and\n+amazing work to make -W -Wall useful.\n+\n+@item\n+Judy Goldberg for c++ contributions.\n+\n+@item\n+Torbjorn Granlund for various fixes and the c-torture testsuite,\n+multiply- and divide-by-constant optimization, improved long long support,\n+and improved leaf function register allocation.\n+\n+@item\n+Michael K. Gschwind contributed the port to the PDP-11.\n+\n+@item\n+Ron Guilmette implemented the @code{protoize} and @code{unprotoize}\n+tools, the support for Dwarf symbolic debugging information, and much of\n+the support for System V Release 4.  He has also worked heavily on the\n+Intel 386 and 860 support.\n+\n+@item\n+Bruno Haible for improvements in the runtime overhead for EH, new\n+warnings and assorted bugfixes.\n+\n+@item\n+Andrew Haley for his Java work.\n+\n+@item\n+Chris Hanson assisted in making GCC work on HP-UX for the 9000 series 300.\n+\n+@item\n+Michael Hayes for various thankless work he's done trying to get\n+the c30/c40 ports functional.  Lots of loop and unroll improvements and\n+fixes.\n+\n+@item\n+Kate Hedstrom for staking the g77 folks with an initial testsuite.\n+\n+@item\n+Richard Henderson for his ongoing SPARC and alpha work, loop opts, and\n+generally fixing lots of old problems we've ignored for years, flow\n+rewrite and lots of stuff I've forgotten.\n+\n+@item\n+Nobuyuki Hikichi of Software Research Associates, Tokyo, contributed\n+the support for the Sony NEWS machine.\n+\n+@item\n+Manfred Hollstein for his ongoing work to keep the m88k alive, lots\n+of testing an bugfixing, particularly of our configury code.\n+\n+@item\n+Steve Holmgren for MachTen patches.\n+\n+@item\n+Jan Hubicka for his x86 port improvements.\n+\n+@item\n+Christian Iseli for various bugfixes.\n+\n+@item\n+Kamil Iskra for general m68k hacking.\n+\n+@item\n+Lee Iverson for random fixes and mips testing.\n+\n+@item\n+Andreas Jaeger for various fixes to the MIPS port\n+\n+@item\n+Jakub Jelinek for his SPARC work and sibling call optimizations.\n+\n+@item\n+J. Kean Johnston for OpenServer support.\n+\n+@item\n+Klaus Kaempf for his ongoing work to make alpha-vms a viable target.\n+\n+@item\n+David Kashtan of SRI adapted GCC to VMS.\n+\n+@item\n+Richard Kenner of the New York University Ultracomputer Research\n+Laboratory wrote the machine descriptions for the AMD 29000, the DEC\n+Alpha, the IBM RT PC, and the IBM RS/6000 as well as the support for\n+instruction attributes.  He also made changes to better support RISC\n+processors including changes to common subexpression elimination,\n+strength reduction, function calling sequence handling, and condition\n+code support, in addition to generalizing the code for frame pointer\n+elimination and delay slot scheduling.  Richard Kenner was also the\n+head maintainer of GCC for several years.\n+\n+@item\n+Robin Kirkham for cpu32 support.\n+\n+@item\n+Mark Klein for PA improvements.\n+\n+@item\n+Geoffrey Keating for his ongoing work to make the PPC work for Linux.\n+\n+@item\n+Brendan Kehoe for his ongoing work with g++.\n+\n+@item\n+Oliver M. Kellogg of Deutsche Aerospace contributed the port to the\n+MIL-STD-1750A.\n+\n+@item\n+Mumit Khan for various contributions to the cygwin and mingw32 ports and\n+maintaining binary releases for Windows hosts.\n+\n+@item\n+Thomas Koenig for various bugfixes.\n+\n+@item\n+Bruce Korb for the new and improved fixincludes code.\n+\n+@item\n+Benjamin Kosnik for his g++ work.\n+\n+@item\n+Ted Lemon wrote parts of the RTL reader and printer.\n+\n+@item\n+Charles LaBrec contributed the support for the Integrated Solutions\n+68020 system.\n+\n+@item\n+Jeff Law for coordinating the entire project, rolling out snapshots\n+and releases, handling merges from GCC2, and random but extensive\n+hacking.\n+\n+@item\n+Marc Lehmann for his guidance via the steering committee and helping\n+with analysis and improvements of x86 performance.\n+\n+@item\n+Kriang Lerdsuwanakij for improvements to demangler and various c++ fixes.\n+\n+@item\n+Warren Levy major work on libgjc (Java Runtime Library) and random\n+work on the Java front-end.\n+\n+@item\n+Alain Lichnewsky ported GCC to the Mips cpu.\n+\n+@item\n+Robert Lipe for OpenServer support, new testsuites, testing, etc.\n+\n+@item\n+Weiwen Liu for testing and various bugfixes.\n+\n+@item\n+Martin von L&ouml;wis for internal consistency checking infrastructure,\n+and various C++ improvements including namespace support.\n+\n+@item\n+Dave Love for his ongoing work with the Fortran front end and \n+runtime libraries.\n+\n+@item\n+H.J. Lu for his contributions to the steering committee, many x86\n+bug reports, prototype patches, and keeping the Linux ports working.\n+\n+@item\n+Andrew MacLeod for his ongoing work in building a real EH system,\n+various code generation improvements, work on the global optimizer, etc.\n+\n+@item\n+Bob Manson for his behind the scenes work on dejagnu.\n+\n+@item\n+Vladimir Makarov for hacking some ugly i960 problems, PowerPC\n+hacking improvements to compile-time performance and overall knowledge\n+and direction in the area of instruction scheduling.\n+\n+@item\n+Greg McGary for random fixes and (someday) bounded pointers.\n+\n+@item\n+Michael Meissner for LRS framework, ia32, m32r, v850, m88k, MIPS powerpc, haifa,\n+ECOFF debug support, and other assorted hacking.\n+\n+@item\n+Jason Merrill for leading the g++ effort.\n+\n+@item\n+Jason Molenda for major help in the care and feeding of all the services\n+on the gcc.gnu.org (formerly egcs.cygnus.com) machine -- mail, web\n+services, ftp services, etc etc.\n+\n+@item\n+David Mosberger-Tang for various Alpha improvements.\n+\n+@item\n+Stephen Moshier contributed the floating point emulator that assists in\n+cross-compilation and permits support for floating point numbers wider\n+than 64 bits and for ISO C9X support.\n+\n+@item\n+Bill Moyer for his behind the scenes work on various issues.\n+\n+@item\n+David Miller for overall direction via the steering committee, lots of\n+SPARC work, improvements in jump.c and interfacing with the Linux kernel\n+developers.\n+\n+@item\n+Gary Miller ported GCC to Charles River Data Systems machines.\n+\n+@item\n+Mark Mitchell for mountains of\n+C++ work, load/store hoisting out of\n+loops and alias analysis improvements, ISO \"restrict\" support.\n+\n+@item\n+Alan Modra for various Linux bits and testing.\n+\n+@item\n+Toon Moene for overall leadership via the steering committee, and his\n+ongoing work to make us make Fortran run fast.\n+\n+@item\n+Catherine Moore for fixing various ugly problems we have sent her\n+way, including the haifa bug which was killing the Alpha & PowerPC Linux\n+kernels.\n+\n+@item\n+Philippe De Muyter for his work on the m68k port.\n+\n+@item\n+Joseph Myers for his work on the PDP-11 port.\n+\n+@item\n+Nathan Myers for his work on libstdc++-v3.\n+\n+@item\n+NeXT, Inc.@: donated the front end that supports the Objective C\n+language.\n+\n+@item\n+Hans-Peter Nilsson for improvements to the search engine\n+setup, various documentation fixes and other small fixes.\n+\n+@item\n+Geoff Noer for this work on getting cygwin native builds working.\n+\n+@item\n+Alexandre Oliva for various build infrastructure improvements, scripts and\n+amazing testing work.\n+\n+@item\n+Rainer Orth for random MIPS work, including improvements to our o32\n+ABI support, improvements to dejagnu's MIPS support, etc.\n+\n+@item\n+Melissa O'Neill for various NeXT fixes.\n+\n+@item\n+Paul Petersen wrote the machine description for the Alliant FX/8.\n+\n+@item\n+Alexandre Petit-Bianco for his Java work.\n+\n+@item\n+Matthias Pfaller for major improvements to the NS32k port.\n+\n+@item\n+Gerald Pfeifer for maintenance of the web pages and pointing out lots\n+of problems we need to solve.\n+\n+@item\n+Ovidiu Predescu for his work on the ObjC front end and runtime libraries.\n+\n+@item\n+Ken Raeburn for various improvements to checker, mips ports and various\n+cleanups in the compiler.\n+\n+@item\n+David Reese of Sun Microsystems contributed to the Solaris on PowerPC\n+port.\n+@item\n+Gabriel Dos Reis for contributions and maintenance of libstdc++-v3,\n+including valarray implementation and limits support.\n+\n+@item\n+Joern Rennecke for maintaining the sh port, loop, regmove & reload\n+hacking.\n+\n+@item\n+Gavin Romig-Koch for lots of behind the scenes MIPS work.\n+\n+@item\n+Ken Rose for fixes to our delay slot filling code.\n+\n+@item\n+Paul Rubin wrote most of the preprocessor.\n+\n+@item\n+Andreas Schwab for his work on the m68k port.\n+\n+@item\n+Jeffrey Siegal for helping RMS with the original design of GCC, some\n+code which handles the parse tree and RTL data structures, constant\n+folding and help with the original VAX & m68k ports.\n+\n+of the parsing code\n+@item\n+Graham Stott. for various infrastructure improvements.\n+\n+@item\n+Juha Sarlin for improvements to the H8 code generator.\n+\n+@item\n+Greg Satz assisted in making GCC work on HP-UX for the 9000 series 300.\n+\n+@item\n+Peter Schauer wrote the code to allow debugging to work on the Alpha.\n+\n+@item\n+William Schelter did most of the work on the Intel 80386 support.\n+\n+@item\n+Bernd Schmidt for various code generation improvements and major\n+work in the reload pass.\n+\n+@item\n+Franz Sirl for his ongoing work with making the PPC port stable\n+for linux.\n+\n+@item\n+Joel Sherrill for his direction via the steering committee, RTEMS\n+contributions and RTEMS testing.\n+\n+@item\n+Nathan Sidwell for many C++ fixes/improvements.\n+\n+@item\n+Andrey Slepuhin for assorted AIX hacking.\n+\n+@item\n+Randy Smith finished the Sun FPA support.\n+\n+@item\n+Christopher Smith did the port for Convex machines.\n+\n+@item\n+Scott Snyder for various fixes.\n+\n+@item\n+Richard Stallman, for writing the original gcc and launching the GNU project.\n+\n+@item\n+Jan Stein of the Chalmers Computer Society provided support for\n+Genix, as well as part of the 32000 machine description.\n+\n+@item\n+Nigel Stephens for various mips16 related fixes/improvements.\n+\n+@item\n+Jonathan Stone wrote the machine description for the Pyramid computer.\n+\n+@item\n+Mike Stump for his Elxsi port, g++ contributions over the years and more\n+recently his vxworks contributions\n+\n+@item\n+Shigeya Suzuki for this fixes for the bsdi platforms.\n+\n+@item\n+Ian Lance Taylor for his mips16 work, general configury hacking,\n+fixincludes, etc.\n+\n+@item\n+Holger Teutsch provided the support for the Clipper cpu.\n+\n+@item\n+Michael Tiemann for random bugfixes the first instruction scheduler, \n+initial C++ support, function integration, NS32k, sparc and M88k \n+machine description work, delay slot scheduling.\n+\n+@item\n+Gary Thomas for his ongoing work to make the PPC work for Linux.\n+\n+@item\n+Philipp Thomas for random bugfixes throughout the compiler\n+\n+@item\n+Kresten Krab Thorup wrote the run time support for the Objective C\n+language.\n+\n+@item\n+Teemu Torma for thread safe exception handling support.\n+\n+@item\n+Leonard Tower wrote parts of the parser, RTL generator, and RTL\n+definitions, and of the Vax machine description.\n+\n+@item\n+Tom Tromey for internationalization support and his Java work.\n+\n+@item\n+Lassi Tuura for improvements to config.guess to determine HP processor\n+types.\n+\n+@item\n+Todd Vierling for contributions for NetBSD ports.\n+\n+@item\n+Krister Walfridsson for random bugfixes.\n+\n+@item\n+John Wehle for various improvements for the x86 code generator,\n+related infrastructure improvements to help x86 code generation,\n+value range propagation and other work, WE32k port.\n+\n+@item\n+Dale Wiles helped port GCC to the Tahoe.\n+\n+@item\n+Zack Weinberg for major work on cpplib and various other bugfixes.\n+\n+@item\n+Jim Wilson for tackling hard problems in various places that nobody else\n+wanted to work on, strength reduction and other loop optimizations.\n+\n+@item\n+Carlo Wood for various fixes.\n+\n+@item\n+Tom Wood for work on the m88k port.\n+\n+@item\n+Masanobu Yuhara of Fujitsu Laboratories implemented the machine\n+description for the Tron architecture (specifically, the Gmicro).\n+\n+@item\n+Kevin Zachmann helped ported GCC to the Tahoe.\n+\n+@end itemize\n+\n+\n+We'd also like to thank the folks who have contributed time and energy in\n+testing GCC:\n+\n+@itemize @bullet\n+@item\n+David Billinghurst\n+\n+@item\n+Horst von Brand\n+\n+@item\n+Rodney Brown\n+\n+@item\n+Joe Buck\n+\n+@item\n+Craig Burley\n+\n+@item\n+Ulrich Drepper\n+\n+@item\n+David Edelsohn\n+\n+@item\n+Kaveh Ghazi\n+\n+@item\n+Yung Shing Gene\n+\n+@item\n+Richard Henderson\n+\n+@item\n+Manfred Hollstein\n+\n+@item\n+Kate Hedstrom\n+\n+@item\n+Kamil Iskra\n+\n+@item\n+Christian Joensson\n+\n+@item\n+Jeff Law\n+\n+@item\n+Robert Lipe\n+\n+@item\n+Dave Love\n+\n+@item\n+Damon Love\n+\n+@item\n+H.J. Lu\n+\n+@item\n+Mumit Khan\n+\n+@item\n+Matthias Klose\n+\n+@item\n+Martin Knoblauch\n+\n+@item\n+Toon Moene\n+\n+@item\n+David Miller\n+\n+@item\n+Matthias Mueller\n+\n+@item\n+Alexandre Oliva\n+\n+@item\n+Richard Polton\n+\n+@item\n+David Rees\n+\n+@item\n+Peter Schmid\n+\n+@item\n+David Schuler\n+\n+@item\n+Vin Shelton\n+\n+@item\n+Franz Sirl\n+\n+@item\n+Mike Stump\n+\n+@item\n+Carlo Wood\n+\n+@item\n+And many others\n+@end itemize\n+\n+And finally we'd like to thank everyone who uses the compiler, submits bug\n+reports and generally reminds us why we're doing this work in the first place."}, {"sha": "affda9744e18aa47045752a559af46f14183b0c6", "filename": "gcc/gcc.texi", "status": "modified", "additions": 1, "deletions": 184, "changes": 185, "blob_url": "https://github.com/Rust-GCC/gccrs/blob/73bb94549e0777fbd981ad68745efa6c0715f0c5/gcc%2Fgcc.texi", "raw_url": "https://github.com/Rust-GCC/gccrs/raw/73bb94549e0777fbd981ad68745efa6c0715f0c5/gcc%2Fgcc.texi", "contents_url": "https://api.github.com/repos/Rust-GCC/gccrs/contents/gcc%2Fgcc.texi?ref=73bb94549e0777fbd981ad68745efa6c0715f0c5", "patch": "@@ -4686,190 +4686,7 @@ Public License instead of this License.\n @node Contributors\n @unnumbered Contributors to GCC\n @cindex contributors\n-\n-In addition to Richard Stallman, several people have written parts\n-of GCC.\n-\n-@itemize @bullet\n-@item\n-The idea of using RTL and some of the optimization ideas came from the\n-program PO written at the University of Arizona by Jack Davidson and\n-Christopher Fraser.  See ``Register Allocation and Exhaustive Peephole\n-Optimization'', Software Practice and Experience 14 (9), Sept. 1984,\n-857-866.\n-\n-@item\n-Paul Rubin wrote most of the preprocessor.\n-\n-@item\n-Leonard Tower wrote parts of the parser, RTL generator, and RTL\n-definitions, and of the Vax machine description.\n-\n-@item\n-Ted Lemon wrote parts of the RTL reader and printer.\n-\n-@item\n-Jim Wilson implemented loop strength reduction and some other\n-loop optimizations.\n-\n-@item\n-Nobuyuki Hikichi of Software Research Associates, Tokyo, contributed\n-the support for the Sony NEWS machine.\n-\n-@item\n-Charles LaBrec contributed the support for the Integrated Solutions\n-68020 system.\n-\n-@item\n-Michael Tiemann of Cygnus Support wrote the front end for C++, as well\n-as the support for inline functions and instruction scheduling.  Also\n-the descriptions of the National Semiconductor 32000 series cpu, the\n-SPARC cpu and part of the Motorola 88000 cpu.\n-\n-@item\n-Gerald Baumgartner added the signature extension to the C++ front-end.\n-\n-@item\n-Jan Stein of the Chalmers Computer Society provided support for\n-Genix, as well as part of the 32000 machine description.\n-\n-@item\n-Randy Smith finished the Sun FPA support.\n-\n-@item\n-Robert Brown implemented the support for Encore 32000 systems.\n-\n-@item\n-David Kashtan of SRI adapted GCC to VMS.\n-\n-@item\n-Alex Crain provided changes for the 3b1.\n-\n-@item\n-Greg Satz and Chris Hanson assisted in making GCC work on HP-UX for\n-the 9000 series 300.\n-\n-@item\n-William Schelter did most of the work on the Intel 80386 support.\n-\n-@item\n-Christopher Smith did the port for Convex machines.\n-\n-@item\n-Paul Petersen wrote the machine description for the Alliant FX/8.\n-\n-@item\n-Dario Dariol contributed the four varieties of sample programs\n-that print a copy of their source.\n-\n-@item\n-Alain Lichnewsky ported GCC to the Mips cpu.\n-\n-@item\n-Devon Bowen, Dale Wiles and Kevin Zachmann ported GCC to the Tahoe.\n-\n-@item\n-Jonathan Stone wrote the machine description for the Pyramid computer.\n-\n-@item\n-Gary Miller ported GCC to Charles River Data Systems machines.\n-\n-@item\n-Richard Kenner of the New York University Ultracomputer Research\n-Laboratory wrote the machine descriptions for the AMD 29000, the DEC\n-Alpha, the IBM RT PC, and the IBM RS/6000 as well as the support for\n-instruction attributes.  He also made changes to better support RISC\n-processors including changes to common subexpression elimination,\n-strength reduction, function calling sequence handling, and condition\n-code support, in addition to generalizing the code for frame pointer\n-elimination.\n-\n-@item\n-Richard Kenner and Michael Tiemann jointly developed reorg.c, the delay\n-slot scheduler.\n-\n-@item\n-Mike Meissner and Tom Wood of Data General finished the port to the\n-Motorola 88000.\n-\n-@item\n-Masanobu Yuhara of Fujitsu Laboratories implemented the machine\n-description for the Tron architecture (specifically, the Gmicro).\n-\n-@item\n-NeXT, Inc.@: donated the front end that supports the Objective C\n-language.\n-@c We need to be careful to make it clear that \"Objective C\"\n-@c is the name of a language, not that of a program or product.\n-\n-@item\n-James van Artsdalen wrote the code that makes efficient use of\n-the Intel 80387 register stack.\n-\n-@item\n-Mike Meissner at the Open Software Foundation finished the port to the\n-MIPS cpu, including adding ECOFF debug support, and worked on the\n-Intel port for the Intel 80386 cpu.  Later at Cygnus Support, he worked\n-on the rs6000 and PowerPC ports.\n-\n-@item\n-Ron Guilmette implemented the @code{protoize} and @code{unprotoize}\n-tools, the support for Dwarf symbolic debugging information, and much of\n-the support for System V Release 4.  He has also worked heavily on the\n-Intel 386 and 860 support.\n-\n-@item\n-Torbjorn Granlund implemented multiply- and divide-by-constant\n-optimization, improved long long support, and improved leaf function\n-register allocation.\n-\n-@item\n-Mike Stump implemented the support for Elxsi 64 bit CPU.\n-\n-@item\n-John Wehle added the machine description for the Western Electric 32000\n-processor used in several 3b series machines (no relation to the\n-National Semiconductor 32000 processor).\n-\n-@ignore @c These features aren't advertised yet, since they don't fully work.\n-@item\n-Analog Devices helped implement the support for complex data types\n-and iterators.\n-@end ignore\n-\n-@item\n-Holger Teutsch provided the support for the Clipper cpu.\n-\n-@item\n-Kresten Krab Thorup wrote the run time support for the Objective C\n-language.\n-\n-@item\n-Stephen Moshier contributed the floating point emulator that assists in\n-cross-compilation and permits support for floating point numbers wider\n-than 64 bits.\n-\n-@item\n-David Edelsohn contributed the changes to RS/6000 port to make it\n-support the PowerPC and POWER2 architectures.\n-\n-@item\n-Steve Chamberlain wrote the support for the Hitachi SH processor.\n-\n-@item\n-Peter Schauer wrote the code to allow debugging to work on the Alpha.\n-\n-@item\n-Oliver M. Kellogg of Deutsche Aerospace contributed the port to the\n-MIL-STD-1750A.\n-\n-@item\n-Michael K. Gschwind contributed the port to the PDP-11.\n-\n-@item\n-David Reese of Sun Microsystems contributed to the Solaris on PowerPC\n-port.\n-@end itemize\n+@include contrib.texi\n \n @node Index\n @unnumbered Index"}]}