{"sha": "7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5", "node_id": "MDY6Q29tbWl0MTM2NTMxMDA6N2JiNmZiZDFjNmNhYjc4YzhiNjI2Y2FhYzc0YTM4N2Y4ZTFkYzViNQ==", "commit": {"author": {"name": "Jeffrey A Law", "email": "law@cygnus.com", "date": "1997-08-12T17:13:25Z"}, "committer": {"name": "Jeff Law", "email": "law@gcc.gnu.org", "date": "1997-08-12T17:13:25Z"}, "message": "version.c: Bump version to \"gcc-3.0.0 970802 experimental\".\n\n        * version.c: Bump version to \"gcc-3.0.0 970802 experimental\".\n\n        * gcc.info*: Rebuilt.\n\n        * COPYING.g77, README.g77: New files.\n        * real.c (ereal_unto_float, ereal_unto_double): New functions.\n        * real.h (ereal_unto_float, ereal_unto_double): Declare them.\n        (REAL_VALUE_UNTO_TARGET_DOUBLE, REAL_VALUE_UNTO_TARGET_SINGLE): Define.\nGet g77 to work with gcc3.\n\nFrom-SVN: r14776", "tree": {"sha": "6af686cdfe6c11c549f23151dfd216cd90b4573f", "url": "https://api.github.com/repos/Rust-GCC/gccrs/git/trees/6af686cdfe6c11c549f23151dfd216cd90b4573f"}, "url": "https://api.github.com/repos/Rust-GCC/gccrs/git/commits/7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5", "comment_count": 0, "verification": {"verified": false, "reason": "unsigned", "signature": null, "payload": null}}, "url": "https://api.github.com/repos/Rust-GCC/gccrs/commits/7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5", "html_url": "https://github.com/Rust-GCC/gccrs/commit/7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5", "comments_url": "https://api.github.com/repos/Rust-GCC/gccrs/commits/7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5/comments", "author": null, "committer": null, "parents": [{"sha": "8f87a56384ff536fb794390a541437b4261b2fd2", "url": "https://api.github.com/repos/Rust-GCC/gccrs/commits/8f87a56384ff536fb794390a541437b4261b2fd2", "html_url": "https://github.com/Rust-GCC/gccrs/commit/8f87a56384ff536fb794390a541437b4261b2fd2"}], "stats": {"total": 600, "additions": 595, "deletions": 5}, "files": [{"sha": "916d1f0f28429fa417ab35d2c37250ec1ab8934d", "filename": "gcc/COPYING.g77", "status": "added", "additions": 339, "deletions": 0, "changes": 339, "blob_url": "https://github.com/Rust-GCC/gccrs/blob/7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5/gcc%2FCOPYING.g77", "raw_url": "https://github.com/Rust-GCC/gccrs/raw/7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5/gcc%2FCOPYING.g77", "contents_url": "https://api.github.com/repos/Rust-GCC/gccrs/contents/gcc%2FCOPYING.g77?ref=7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5", "patch": "@@ -0,0 +1,339 @@\n+\t\t    GNU GENERAL PUBLIC LICENSE\n+\t\t       Version 2, June 1991\n+\n+ Copyright (C) 1989, 1991 Free Software Foundation, Inc.\n+ 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA\n+ Everyone is permitted to copy and distribute verbatim copies\n+ of this license document, but changing it is not allowed.\n+\n+\t\t\t    Preamble\n+\n+  The licenses for most software are designed to take away your\n+freedom to share and change it.  By contrast, the GNU General Public\n+License is intended to guarantee your freedom to share and change free\n+software--to make sure the software is free for all its users.  This\n+General Public License applies to most of the Free Software\n+Foundation's software and to any other program whose authors commit to\n+using it.  (Some other Free Software Foundation software is covered by\n+the GNU Library General Public License instead.)  You can apply it to\n+your programs, too.\n+\n+  When we speak of free software, we are referring to freedom, not\n+price.  Our General Public Licenses are designed to make sure that you\n+have the freedom to distribute copies of free software (and charge for\n+this service if you wish), that you receive source code or can get it\n+if you want it, that you can change the software or use pieces of it\n+in new free programs; and that you know you can do these things.\n+\n+  To protect your rights, we need to make restrictions that forbid\n+anyone to deny you these rights or to ask you to surrender the rights.\n+These restrictions translate to certain responsibilities for you if you\n+distribute copies of the software, or if you modify it.\n+\n+  For example, if you distribute copies of such a program, whether\n+gratis or for a fee, you must give the recipients all the rights that\n+you have.  You must make sure that they, too, receive or can get the\n+source code.  And you must show them these terms so they know their\n+rights.\n+\n+  We protect your rights with two steps: (1) copyright the software, and\n+(2) offer you this license which gives you legal permission to copy,\n+distribute and/or modify the software.\n+\n+  Also, for each author's protection and ours, we want to make certain\n+that everyone understands that there is no warranty for this free\n+software.  If the software is modified by someone else and passed on, we\n+want its recipients to know that what they have is not the original, so\n+that any problems introduced by others will not reflect on the original\n+authors' reputations.\n+\n+  Finally, any free program is threatened constantly by software\n+patents.  We wish to avoid the danger that redistributors of a free\n+program will individually obtain patent licenses, in effect making the\n+program proprietary.  To prevent this, we have made it clear that any\n+patent must be licensed for everyone's free use or not licensed at all.\n+\n+  The precise terms and conditions for copying, distribution and\n+modification follow.\n+\f\n+\t\t    GNU GENERAL PUBLIC LICENSE\n+   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n+\n+  0. This License applies to any program or other work which contains\n+a notice placed by the copyright holder saying it may be distributed\n+under the terms of this General Public License.  The \"Program\", below,\n+refers to any such program or work, and a \"work based on the Program\"\n+means either the Program or any derivative work under copyright law:\n+that is to say, a work containing the Program or a portion of it,\n+either verbatim or with modifications and/or translated into another\n+language.  (Hereinafter, translation is included without limitation in\n+the term \"modification\".)  Each licensee is addressed as \"you\".\n+\n+Activities other than copying, distribution and modification are not\n+covered by this License; they are outside its scope.  The act of\n+running the Program is not restricted, and the output from the Program\n+is covered only if its contents constitute a work based on the\n+Program (independent of having been made by running the Program).\n+Whether that is true depends on what the Program does.\n+\n+  1. You may copy and distribute verbatim copies of the Program's\n+source code as you receive it, in any medium, provided that you\n+conspicuously and appropriately publish on each copy an appropriate\n+copyright notice and disclaimer of warranty; keep intact all the\n+notices that refer to this License and to the absence of any warranty;\n+and give any other recipients of the Program a copy of this License\n+along with the Program.\n+\n+You may charge a fee for the physical act of transferring a copy, and\n+you may at your option offer warranty protection in exchange for a fee.\n+\n+  2. You may modify your copy or copies of the Program or any portion\n+of it, thus forming a work based on the Program, and copy and\n+distribute such modifications or work under the terms of Section 1\n+above, provided that you also meet all of these conditions:\n+\n+    a) You must cause the modified files to carry prominent notices\n+    stating that you changed the files and the date of any change.\n+\n+    b) You must cause any work that you distribute or publish, that in\n+    whole or in part contains or is derived from the Program or any\n+    part thereof, to be licensed as a whole at no charge to all third\n+    parties under the terms of this License.\n+\n+    c) If the modified program normally reads commands interactively\n+    when run, you must cause it, when started running for such\n+    interactive use in the most ordinary way, to print or display an\n+    announcement including an appropriate copyright notice and a\n+    notice that there is no warranty (or else, saying that you provide\n+    a warranty) and that users may redistribute the program under\n+    these conditions, and telling the user how to view a copy of this\n+    License.  (Exception: if the Program itself is interactive but\n+    does not normally print such an announcement, your work based on\n+    the Program is not required to print an announcement.)\n+\f\n+These requirements apply to the modified work as a whole.  If\n+identifiable sections of that work are not derived from the Program,\n+and can be reasonably considered independent and separate works in\n+themselves, then this License, and its terms, do not apply to those\n+sections when you distribute them as separate works.  But when you\n+distribute the same sections as part of a whole which is a work based\n+on the Program, the distribution of the whole must be on the terms of\n+this License, whose permissions for other licensees extend to the\n+entire whole, and thus to each and every part regardless of who wrote it.\n+\n+Thus, it is not the intent of this section to claim rights or contest\n+your rights to work written entirely by you; rather, the intent is to\n+exercise the right to control the distribution of derivative or\n+collective works based on the Program.\n+\n+In addition, mere aggregation of another work not based on the Program\n+with the Program (or with a work based on the Program) on a volume of\n+a storage or distribution medium does not bring the other work under\n+the scope of this License.\n+\n+  3. You may copy and distribute the Program (or a work based on it,\n+under Section 2) in object code or executable form under the terms of\n+Sections 1 and 2 above provided that you also do one of the following:\n+\n+    a) Accompany it with the complete corresponding machine-readable\n+    source code, which must be distributed under the terms of Sections\n+    1 and 2 above on a medium customarily used for software interchange; or,\n+\n+    b) Accompany it with a written offer, valid for at least three\n+    years, to give any third party, for a charge no more than your\n+    cost of physically performing source distribution, a complete\n+    machine-readable copy of the corresponding source code, to be\n+    distributed under the terms of Sections 1 and 2 above on a medium\n+    customarily used for software interchange; or,\n+\n+    c) Accompany it with the information you received as to the offer\n+    to distribute corresponding source code.  (This alternative is\n+    allowed only for noncommercial distribution and only if you\n+    received the program in object code or executable form with such\n+    an offer, in accord with Subsection b above.)\n+\n+The source code for a work means the preferred form of the work for\n+making modifications to it.  For an executable work, complete source\n+code means all the source code for all modules it contains, plus any\n+associated interface definition files, plus the scripts used to\n+control compilation and installation of the executable.  However, as a\n+special exception, the source code distributed need not include\n+anything that is normally distributed (in either source or binary\n+form) with the major components (compiler, kernel, and so on) of the\n+operating system on which the executable runs, unless that component\n+itself accompanies the executable.\n+\n+If distribution of executable or object code is made by offering\n+access to copy from a designated place, then offering equivalent\n+access to copy the source code from the same place counts as\n+distribution of the source code, even though third parties are not\n+compelled to copy the source along with the object code.\n+\f\n+  4. You may not copy, modify, sublicense, or distribute the Program\n+except as expressly provided under this License.  Any attempt\n+otherwise to copy, modify, sublicense or distribute the Program is\n+void, and will automatically terminate your rights under this License.\n+However, parties who have received copies, or rights, from you under\n+this License will not have their licenses terminated so long as such\n+parties remain in full compliance.\n+\n+  5. You are not required to accept this License, since you have not\n+signed it.  However, nothing else grants you permission to modify or\n+distribute the Program or its derivative works.  These actions are\n+prohibited by law if you do not accept this License.  Therefore, by\n+modifying or distributing the Program (or any work based on the\n+Program), you indicate your acceptance of this License to do so, and\n+all its terms and conditions for copying, distributing or modifying\n+the Program or works based on it.\n+\n+  6. Each time you redistribute the Program (or any work based on the\n+Program), the recipient automatically receives a license from the\n+original licensor to copy, distribute or modify the Program subject to\n+these terms and conditions.  You may not impose any further\n+restrictions on the recipients' exercise of the rights granted herein.\n+You are not responsible for enforcing compliance by third parties to\n+this License.\n+\n+  7. If, as a consequence of a court judgment or allegation of patent\n+infringement or for any other reason (not limited to patent issues),\n+conditions are imposed on you (whether by court order, agreement or\n+otherwise) that contradict the conditions of this License, they do not\n+excuse you from the conditions of this License.  If you cannot\n+distribute so as to satisfy simultaneously your obligations under this\n+License and any other pertinent obligations, then as a consequence you\n+may not distribute the Program at all.  For example, if a patent\n+license would not permit royalty-free redistribution of the Program by\n+all those who receive copies directly or indirectly through you, then\n+the only way you could satisfy both it and this License would be to\n+refrain entirely from distribution of the Program.\n+\n+If any portion of this section is held invalid or unenforceable under\n+any particular circumstance, the balance of the section is intended to\n+apply and the section as a whole is intended to apply in other\n+circumstances.\n+\n+It is not the purpose of this section to induce you to infringe any\n+patents or other property right claims or to contest validity of any\n+such claims; this section has the sole purpose of protecting the\n+integrity of the free software distribution system, which is\n+implemented by public license practices.  Many people have made\n+generous contributions to the wide range of software distributed\n+through that system in reliance on consistent application of that\n+system; it is up to the author/donor to decide if he or she is willing\n+to distribute software through any other system and a licensee cannot\n+impose that choice.\n+\n+This section is intended to make thoroughly clear what is believed to\n+be a consequence of the rest of this License.\n+\f\n+  8. If the distribution and/or use of the Program is restricted in\n+certain countries either by patents or by copyrighted interfaces, the\n+original copyright holder who places the Program under this License\n+may add an explicit geographical distribution limitation excluding\n+those countries, so that distribution is permitted only in or among\n+countries not thus excluded.  In such case, this License incorporates\n+the limitation as if written in the body of this License.\n+\n+  9. The Free Software Foundation may publish revised and/or new versions\n+of the General Public License from time to time.  Such new versions will\n+be similar in spirit to the present version, but may differ in detail to\n+address new problems or concerns.\n+\n+Each version is given a distinguishing version number.  If the Program\n+specifies a version number of this License which applies to it and \"any\n+later version\", you have the option of following the terms and conditions\n+either of that version or of any later version published by the Free\n+Software Foundation.  If the Program does not specify a version number of\n+this License, you may choose any version ever published by the Free Software\n+Foundation.\n+\n+  10. If you wish to incorporate parts of the Program into other free\n+programs whose distribution conditions are different, write to the author\n+to ask for permission.  For software which is copyrighted by the Free\n+Software Foundation, write to the Free Software Foundation; we sometimes\n+make exceptions for this.  Our decision will be guided by the two goals\n+of preserving the free status of all derivatives of our free software and\n+of promoting the sharing and reuse of software generally.\n+\n+\t\t\t    NO WARRANTY\n+\n+  11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\n+FOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\n+OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\n+PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\n+OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\n+MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\n+TO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\n+PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\n+REPAIR OR CORRECTION.\n+\n+  12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\n+WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\n+REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\n+INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\n+OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\n+TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\n+YOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\n+PROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\n+POSSIBILITY OF SUCH DAMAGES.\n+\n+\t\t     END OF TERMS AND CONDITIONS\n+\f\n+\tAppendix: How to Apply These Terms to Your New Programs\n+\n+  If you develop a new program, and you want it to be of the greatest\n+possible use to the public, the best way to achieve this is to make it\n+free software which everyone can redistribute and change under these terms.\n+\n+  To do so, attach the following notices to the program.  It is safest\n+to attach them to the start of each source file to most effectively\n+convey the exclusion of warranty; and each file should have at least\n+the \"copyright\" line and a pointer to where the full notice is found.\n+\n+    <one line to give the program's name and a brief idea of what it does.>\n+    Copyright (C) 19yy  <name of author>\n+\n+    This program is free software; you can redistribute it and/or modify\n+    it under the terms of the GNU General Public License as published by\n+    the Free Software Foundation; either version 2 of the License, or\n+    (at your option) any later version.\n+\n+    This program is distributed in the hope that it will be useful,\n+    but WITHOUT ANY WARRANTY; without even the implied warranty of\n+    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n+    GNU General Public License for more details.\n+\n+    You should have received a copy of the GNU General Public License\n+    along with this program; if not, write to the Free Software\n+    Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA\n+\n+Also add information on how to contact you by electronic and paper mail.\n+\n+If the program is interactive, make it output a short notice like this\n+when it starts in an interactive mode:\n+\n+    Gnomovision version 69, Copyright (C) 19yy name of author\n+    Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n+    This is free software, and you are welcome to redistribute it\n+    under certain conditions; type `show c' for details.\n+\n+The hypothetical commands `show w' and `show c' should show the appropriate\n+parts of the General Public License.  Of course, the commands you use may\n+be called something other than `show w' and `show c'; they could even be\n+mouse-clicks or menu items--whatever suits your program.\n+\n+You should also get your employer (if you work as a programmer) or your\n+school, if any, to sign a \"copyright disclaimer\" for the program, if\n+necessary.  Here is a sample; alter the names:\n+\n+  Yoyodyne, Inc., hereby disclaims all copyright interest in the program\n+  `Gnomovision' (which makes passes at compilers) written by James Hacker.\n+\n+  <signature of Ty Coon>, 1 April 1989\n+  Ty Coon, President of Vice\n+\n+This General Public License does not permit incorporating your program into\n+proprietary programs.  If your program is a subroutine library, you may\n+consider it more useful to permit linking proprietary applications with the\n+library.  If this is what you want to do, use the GNU Library General\n+Public License instead of this License."}, {"sha": "88847772d5e0082b1f19912813c17684813f08ee", "filename": "gcc/ChangeLog", "status": "modified", "additions": 11, "deletions": 0, "changes": 11, "blob_url": "https://github.com/Rust-GCC/gccrs/blob/7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5/gcc%2FChangeLog", "raw_url": "https://github.com/Rust-GCC/gccrs/raw/7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5/gcc%2FChangeLog", "contents_url": "https://api.github.com/repos/Rust-GCC/gccrs/contents/gcc%2FChangeLog?ref=7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5", "patch": "@@ -1,3 +1,14 @@\n+Tue Aug 12 10:20:36 1997  Jeffrey A Law  (law@cygnus.com)\n+\n+\t* version.c: Bump version to \"gcc-3.0.0 970802 experimental\".\n+\n+\t* gcc.info*: Rebuilt.\n+\n+\t* COPYING.g77, README.g77: New files.\n+\t* real.c (ereal_unto_float, ereal_unto_double): New functions.\n+\t* real.h (ereal_unto_float, ereal_unto_double): Declare them.\n+\t(REAL_VALUE_UNTO_TARGET_DOUBLE, REAL_VALUE_UNTO_TARGET_SINGLE): Define.\n+\n Mon Aug 11 14:50:55 1997  Jeffrey A Law  (law@cygnus.com)\n \n \t* Integrate Haifa instruction scheduler."}, {"sha": "14d328673f629c0763d4925643522f23729abb67", "filename": "gcc/README.g77", "status": "added", "additions": 166, "deletions": 0, "changes": 166, "blob_url": "https://github.com/Rust-GCC/gccrs/blob/7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5/gcc%2FREADME.g77", "raw_url": "https://github.com/Rust-GCC/gccrs/raw/7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5/gcc%2FREADME.g77", "contents_url": "https://api.github.com/repos/Rust-GCC/gccrs/contents/gcc%2FREADME.g77?ref=7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5", "patch": "@@ -0,0 +1,166 @@\n+1997-06-20\n+\n+This directory contains the version 0.5.21 release of the GNU Fortran\n+compiler.  The GNU Fortran compiler is free software.  See the file\n+COPYING.g77 for copying permission.\n+\n+* IMPORTANT: Things you _must_ do are marked with a * at the beginning of\n+  the line in this file!!!\n+\n+This README is for GNU Fortran, and describes the files in the f/\n+directory.  The f/ directory is intended to be a subdirectory of a\n+gcc source tree.  These directories are referred to below as gcc/,\n+which is the top-level directory containing the gcc back end, the\n+gcc C front end, and other non-Fortran files, and gcc/f/, which\n+contains all of the Fortran files.\n+\n+* To build GNU Fortran, you must have a source distribution of gcc\n+  version 2.7.2.2.  Do not attempt to use any other version\n+  of gcc, because this version of g77 is designed to work only with\n+  gcc version 2.7.2.2.\n+\n+* Note that you must have source copies of these gcc distributions!!\n+  You cannot build g77 just using binaries of gcc.  Also, unless you\n+  are an expert, avoid using any distribution of gcc not identical to\n+  the one distributed by the FSF -- for example, using a special version\n+  modified to produce better code for the Pentium (sometimes labeled\n+  gcc-i2.6.3 -- note the `i') will not work with this distribution of g77.\n+\n+If you have just unpacked the g77 distribution, before proceeding,\n+you must merge the contents of the g77 distribution with the appropriate\n+gcc distribution on your system before proceeding.\n+\n+* Read and follow the instructions in g77-0.5.21/f/INSTALL that\n+  explain how to merge a g77 source directory into a gcc source\n+  directory.  You can use Info to read the same installation\n+  instructions via:\n+\n+    info -f g77-0.5.21/f/g77.info -n Unpacking\n+\n+The resulting directory layout includes the following, where gcc/ might be\n+a link to, for example, gcc-2.7.2.2/:\n+\n+    gcc/                    Non-Fortran files in gcc (not part of g77*.tar)\n+    gcc/README.g77          This file\n+    gcc/f/                  GNU Fortran front end\n+    gcc/f/gbe/              Patches required for gcc back end versions\n+    gcc/f/runtime/          libf2c configuration and f2c.h file generation\n+    gcc/f/runtime/libF77/   Non-I/O portion of libf2c\n+    gcc/f/runtime/libI77/   I/O portion of libf2c\n+    gcc/f/runtime/libU77/   Additional interfaces to libc for libf2c\n+\n+gcc/f/ as a whole contains the program GNU Fortran (g77), plus a portion\n+of the separate program f2c, which is in gcc/f/runtime.  NOTE: The f2c\n+code is not part of the program g77, just distributed with it.\n+\n+This directory is named gcc/f/ because it, along with its contents, is\n+designed to be a subdirectory of a GNU CC (gcc) development directory.  I.e.\n+when a gcc distribution is unpacked into a directory (named gcc/ for\n+example), it typically contains subdirectories like gcc/config/ and\n+gcc/cp/.  The latter is the subdirectory for the GNU C++ (g++) program.\n+\n+Similarly, the g77 directory f/ is designed to be placed in gcc/ so that\n+it becomes the subdirectory gcc/f/.  g77 is distributed as g77-someversion/f/\n+so that unpacking the g77 distribution is done in the normal GNU way,\n+resulting in a directory having the version number in the name.  However,\n+to build g77, the g77 distribution must be merged with an appropriate gcc\n+distribution, normally in a gcc directory, before configuring, building,\n+and installing g77.\n+\n+Applying g77 patches in the form of .diff files is done by typing\n+\"patch -p1 -d gcc\" (where gcc/f/ is the active version).  That is,\n+g77 patches are distributed in the same form, and at the same directory\n+level, as patches to the gcc distribution.\n+\n+gcc/f/ has text files that document the Fortran compiler, source\n+files for the GNU Fortran Front End (FFE), and some other stuff.\n+\n+gcc/f/gbe/ has patch files for various versions of gcc, primarily\n+needed to patch the GNU compiler Back End (GBE) to fix and improve it\n+for use with g77.  If a patch file exists for the version of gcc you\n+want to build along with g77, you MUST apply the patch before building\n+g77 with that version or g77 will not build or work properly.*\n+\n+* Read gcc/f/gbe/README for more information.\n+\n+gcc/f/runtime/ contains the run-time libraries for the f2c program, also used\n+by g77, and referred to as libf2c (though libf2c is really a combination of\n+two distinct libraries, libF77 and libI77 -- in g77, this distinction is\n+not made, and, further, Dave Love's implementation of libU77 is added\n+to the mix).  This separate subdirectory is not part of the program g77, just\n+distributed with it.  Some new files have been added to this subdirectory\n+and some minor changes made to the files contained therein, to fix some\n+bugs and facilitate automatic configuration, building, and installation of\n+libf2c for use by g77 users.  See gcc/f/runtime/README for more information.\n+\n+gcc/f/BUGS lists some important bugs known to be in g77.  Or:\n+\n+  info -f gcc/f/g77.info -n \"Actual Bugs\"\n+\n+gcc/f/ChangeLog lists recent changes to g77 internals.\n+\n+gcc/f/INSTALL describes how to build and install GNU Fortran.  Or:\n+\n+  info -f gcc/f/g77.info -n Installation\n+\n+gcc/f/NEWS contains the per-release changes (not just user-visible ones\n+seen in gcc/f/DOC) listed in the ~fortran/.plan file.  Or:\n+\n+  info -f gcc/f/g77.info -n News\n+\n+* Read gcc/f/BUGS, gcc/f/INSTALL, and gcc/f/NEWS at the very least!\n+  All users of g77 (not just installers) should read gcc/f/g77.info*\n+  as well, using the \"more\" command if the \"info\" command is\n+  unavailable or they aren't accustomed to using it.\n+\n+If you want to get into the FFE code, which lives entirely in gcc/f/, here\n+are a few clues.  The file g77.c is the stand-alone source file for the\n+`g77' command driver only -- this just invokes the `gcc' command, so it has\n+nothing to do with the rest of the code in g77.  Most of the code\n+ends up in an executable named `f771', which does the actual compiling,\n+so it has the FFE merged with the gcc back end.\n+\n+The file parse.c is the source file for main() for a stand-alone FFE and\n+yyparse() for f771.  (Stand-alone building of the FFE doesn't work these days.)\n+The file top.c contains the top-level FFE function ffe_file and it (along\n+with top.h) define all ffe_[a-z].*, ffe[A-Z].*, and FFE_[A-Za-z].* symbols.\n+The file fini.c is a main() program that is used when building the FFE to\n+generate C header and source files for recognizing keywords.  The files\n+malloc.c and malloc.h comprise a memory manager that defines all\n+malloc_[a-z].*, malloc[A-Z].*, and MALLOC_[A-Za-z].* symbols.  All other\n+modules named <xyz> are comprised of all files named <xyz>*.<ext> and\n+define all ffe<xyz>_[a-z].*, ffe<xyz>[A-Z].*, and FFE<XYZ>_[A-Za-z].* symbols.\n+If you understand all this, congratulations -- it's easier for me to remember\n+how it works than to type in these grep patterns (such as they are).  But it\n+does make it easy to find where a symbol is defined -- for example,\n+the symbol \"ffexyz_set_something\" would be defined in xyz.h and implemented\n+there (if it's a macro) or in xyz.c.\n+\n+The \"porting\" files of note currently are: proj.h, which defines the\n+\"language\" used by all the other source files (the language being\n+Standard C plus some useful things like ARRAY_SIZE and such) -- change\n+this file when you find your system doesn't properly define a Standard C\n+macro or function, for example; target.h and target.c, which describe\n+the target machine in terms of what data types are supported, how they are\n+denoted (what C type does an INTEGER*8 map to, for example), how to convert\n+between them, and so on (though as of 0.5.3, more and more of this information\n+is being dynamically configured by ffecom_init_0); com.h and com.c, which\n+interface to the target back end (currently only FFE stand-alone and the GBE);\n+ste.c, which contains code for implementing recognized executable statements\n+in the target back end (again currently either FFE or GBE); src.h and src.c,\n+which describe information on the format(s) of source files (like whether\n+they are never to be processed as case-insensitive with regard to Fortran\n+keywords); and proj.c, which contains whatever code is needed to support\n+the language defined by proj.h.\n+\n+If you want to debug the f771 executable, for example if it crashes,\n+note that the global variables \"lineno\" and \"input_filename\" are set\n+to reflect the current line being read by the lexer during the first-pass\n+analysis of a program unit and to reflect the current line being\n+processed during the second-pass compilation of a program unit.  If\n+an invocation of the function ffestd_exec_end() is on the stack,\n+the compiler is in the second pass, otherwise it is in the first.\n+(This information might help you reduce a test case and/or work around\n+a bug in g77 until a fix is available.)\n+\n+Any questions or comments on these topics, email fortran@gnu.ai.mit.edu."}, {"sha": "b1bb94e2e2d0eeff40a869ba0e1f5691d624bdea", "filename": "gcc/real.c", "status": "modified", "additions": 70, "deletions": 4, "changes": 74, "blob_url": "https://github.com/Rust-GCC/gccrs/blob/7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5/gcc%2Freal.c", "raw_url": "https://github.com/Rust-GCC/gccrs/raw/7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5/gcc%2Freal.c", "contents_url": "https://api.github.com/repos/Rust-GCC/gccrs/contents/gcc%2Freal.c?ref=7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5", "patch": "@@ -5799,10 +5799,76 @@ make_nan (nan, sign, mode)\n     *nan = (sign << 15) | *p;\n }\n \n-/* Convert an SFmode target `float' value to a REAL_VALUE_TYPE.\n-   This is the inverse of the function `etarsingle' invoked by\n+/* This is the inverse of the function `etarsingle' invoked by\n    REAL_VALUE_TO_TARGET_SINGLE.  */\n \n+REAL_VALUE_TYPE\n+ereal_unto_float (f)\n+     long f;\n+{\n+  REAL_VALUE_TYPE r;\n+  unsigned EMUSHORT s[2];\n+  unsigned EMUSHORT e[NE];\n+\n+  /* Convert 32 bit integer to array of 16 bit pieces in target machine order.\n+   This is the inverse operation to what the function `endian' does.  */\n+  if (REAL_WORDS_BIG_ENDIAN)\n+    {\n+      s[0] = (unsigned EMUSHORT) (f >> 16);\n+      s[1] = (unsigned EMUSHORT) f;\n+    }\n+  else\n+    {\n+      s[0] = (unsigned EMUSHORT) f;\n+      s[1] = (unsigned EMUSHORT) (f >> 16);\n+    }\n+  /* Convert and promote the target float to E-type. */\n+  e24toe (s, e);\n+  /* Output E-type to REAL_VALUE_TYPE. */\n+  PUT_REAL (e, &r);\n+  return r;\n+}\n+\n+\n+/* This is the inverse of the function `etardouble' invoked by\n+   REAL_VALUE_TO_TARGET_DOUBLE.  */\n+\n+REAL_VALUE_TYPE\n+ereal_unto_double (d)\n+     long d[];\n+{\n+  REAL_VALUE_TYPE r;\n+  unsigned EMUSHORT s[4];\n+  unsigned EMUSHORT e[NE];\n+\n+  /* Convert array of HOST_WIDE_INT to equivalent array of 16-bit pieces.  */\n+  if (REAL_WORDS_BIG_ENDIAN)\n+    {\n+      s[0] = (unsigned EMUSHORT) (d[0] >> 16);\n+      s[1] = (unsigned EMUSHORT) d[0];\n+      s[2] = (unsigned EMUSHORT) (d[1] >> 16);\n+      s[3] = (unsigned EMUSHORT) d[1];\n+    }\n+  else\n+    {\n+      /* Target float words are little-endian.  */\n+      s[0] = (unsigned EMUSHORT) d[0];\n+      s[1] = (unsigned EMUSHORT) (d[0] >> 16);\n+      s[2] = (unsigned EMUSHORT) d[1];\n+      s[3] = (unsigned EMUSHORT) (d[1] >> 16);\n+    }\n+  /* Convert target double to E-type. */\n+  e53toe (s, e);\n+  /* Output E-type to REAL_VALUE_TYPE. */\n+  PUT_REAL (e, &r);\n+  return r;\n+}\n+\n+\n+/* Convert an SFmode target `float' value to a REAL_VALUE_TYPE.\n+   This is somewhat like ereal_unto_float, but the input types\n+   for these are different.  */\n+\n REAL_VALUE_TYPE\n ereal_from_float (f)\n      HOST_WIDE_INT f;\n@@ -5832,8 +5898,8 @@ ereal_from_float (f)\n \n \n /* Convert a DFmode target `double' value to a REAL_VALUE_TYPE.\n-   This is the inverse of the function `etardouble' invoked by\n-   REAL_VALUE_TO_TARGET_DOUBLE.\n+   This is somewhat like ereal_unto_double, but the input types\n+   for these are different.\n \n    The DFmode is stored as an array of HOST_WIDE_INT in the target's\n    data format, with no holes in the bit packing.  The first element"}, {"sha": "5d4b87fe6b0cfa8c8511be9b0ba54e22e725130b", "filename": "gcc/real.h", "status": "modified", "additions": 8, "deletions": 0, "changes": 8, "blob_url": "https://github.com/Rust-GCC/gccrs/blob/7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5/gcc%2Freal.h", "raw_url": "https://github.com/Rust-GCC/gccrs/raw/7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5/gcc%2Freal.h", "contents_url": "https://api.github.com/repos/Rust-GCC/gccrs/contents/gcc%2Freal.h?ref=7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5", "patch": "@@ -153,6 +153,8 @@ extern long etarsingle\t\tPROTO((REAL_VALUE_TYPE));\n extern void ereal_to_decimal\tPROTO((REAL_VALUE_TYPE, char *));\n extern int ereal_cmp\t\tPROTO((REAL_VALUE_TYPE, REAL_VALUE_TYPE));\n extern int ereal_isneg\t\tPROTO((REAL_VALUE_TYPE));\n+extern REAL_VALUE_TYPE ereal_unto_float PROTO((long));\n+extern REAL_VALUE_TYPE ereal_unto_double PROTO((long *));\n extern REAL_VALUE_TYPE ereal_from_float PROTO((HOST_WIDE_INT));\n extern REAL_VALUE_TYPE ereal_from_double PROTO((HOST_WIDE_INT *));\n \n@@ -200,6 +202,12 @@ extern REAL_VALUE_TYPE real_value_truncate ();\n /* IN is a REAL_VALUE_TYPE.  OUT is a long. */\n #define REAL_VALUE_TO_TARGET_SINGLE(IN, OUT) ((OUT) = etarsingle ((IN)))\n \n+/* Inverse of REAL_VALUE_TO_TARGET_DOUBLE. */\n+#define REAL_VALUE_UNTO_TARGET_DOUBLE(d)  (ereal_unto_double (d))\n+\n+/* Inverse of REAL_VALUE_TO_TARGET_SINGLE. */\n+#define REAL_VALUE_UNTO_TARGET_SINGLE(f)  (ereal_unto_float (f))\n+\n /* d is an array of HOST_WIDE_INT that holds a double precision\n    value in the target computer's floating point format. */\n #define REAL_VALUE_FROM_TARGET_DOUBLE(d)  (ereal_from_double (d))"}, {"sha": "483094fb73760f2e11bed65eb0d09e23783f2fc9", "filename": "gcc/version.c", "status": "modified", "additions": 1, "deletions": 1, "changes": 2, "blob_url": "https://github.com/Rust-GCC/gccrs/blob/7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5/gcc%2Fversion.c", "raw_url": "https://github.com/Rust-GCC/gccrs/raw/7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5/gcc%2Fversion.c", "contents_url": "https://api.github.com/repos/Rust-GCC/gccrs/contents/gcc%2Fversion.c?ref=7bb6fbd1c6cab78c8b626caac74a387f8e1dc5b5", "patch": "@@ -1 +1 @@\n-char *version_string = \"testgcc-2.7.90 970802 experimental\";\n+char *version_string = \"gcc-3.0.0 970802 experimental\";"}]}