{"sha": "a8ddeb784c8f97463af446c4267b5f79553ac6ad", "node_id": "MDY6Q29tbWl0MTM2NTMxMDA6YThkZGViNzg0YzhmOTc0NjNhZjQ0NmM0MjY3YjVmNzk1NTNhYzZhZA==", "commit": {"author": {"name": "Benjamin Kosnik", "email": "bkoz@redhat.com", "date": "2008-12-23T01:27:39Z"}, "committer": {"name": "Benjamin Kosnik", "email": "bkoz@gcc.gnu.org", "date": "2008-12-23T01:27:39Z"}, "message": "stdheader.cc: Add cstdlib include.\n\n2008-12-22  Benjamin Kosnik  <bkoz@redhat.com>\n\n\t* doc/doxygen/stdheader.cc: Add cstdlib include.\n\t* doc/doxygen/user.cfg.in: Regenerate for doxygen 1.5.7.\n\nFrom-SVN: r142897", "tree": {"sha": "9a659d6a8a93e3e9cd25237958160aa949265c5e", "url": "https://api.github.com/repos/Rust-GCC/gccrs/git/trees/9a659d6a8a93e3e9cd25237958160aa949265c5e"}, "url": "https://api.github.com/repos/Rust-GCC/gccrs/git/commits/a8ddeb784c8f97463af446c4267b5f79553ac6ad", "comment_count": 0, "verification": {"verified": false, "reason": "unsigned", "signature": null, "payload": null}}, "url": "https://api.github.com/repos/Rust-GCC/gccrs/commits/a8ddeb784c8f97463af446c4267b5f79553ac6ad", "html_url": "https://github.com/Rust-GCC/gccrs/commit/a8ddeb784c8f97463af446c4267b5f79553ac6ad", "comments_url": "https://api.github.com/repos/Rust-GCC/gccrs/commits/a8ddeb784c8f97463af446c4267b5f79553ac6ad/comments", "author": null, "committer": null, "parents": [{"sha": "70e352ae984315548a3acae3cac5ce4544ca0b90", "url": "https://api.github.com/repos/Rust-GCC/gccrs/commits/70e352ae984315548a3acae3cac5ce4544ca0b90", "html_url": "https://github.com/Rust-GCC/gccrs/commit/70e352ae984315548a3acae3cac5ce4544ca0b90"}], "stats": {"total": 532, "additions": 388, "deletions": 144}, "files": [{"sha": "71f47b80903916269bd98099d532b39e57cfe60a", "filename": "libstdc++-v3/ChangeLog", "status": "modified", "additions": 5, "deletions": 0, "changes": 5, "blob_url": "https://github.com/Rust-GCC/gccrs/blob/a8ddeb784c8f97463af446c4267b5f79553ac6ad/libstdc%2B%2B-v3%2FChangeLog", "raw_url": "https://github.com/Rust-GCC/gccrs/raw/a8ddeb784c8f97463af446c4267b5f79553ac6ad/libstdc%2B%2B-v3%2FChangeLog", "contents_url": "https://api.github.com/repos/Rust-GCC/gccrs/contents/libstdc%2B%2B-v3%2FChangeLog?ref=a8ddeb784c8f97463af446c4267b5f79553ac6ad", "patch": "@@ -1,3 +1,8 @@\n+2008-12-22  Benjamin Kosnik  <bkoz@redhat.com>\n+\n+\t* doc/doxygen/stdheader.cc: Add cstdlib.\n+\t* doc/doxygen/user.cfg.in: Regenerate for doxygen 1.5.7.\n+\n 2008-12-21  Andrew Pinski  <pinskia@gmail.com>\n \n \tPR target/38300"}, {"sha": "8bcb1a059f9d1c8b8e14f87cc0e2b3fa5d577ee0", "filename": "libstdc++-v3/doc/doxygen/stdheader.cc", "status": "modified", "additions": 2, "deletions": 1, "changes": 3, "blob_url": "https://github.com/Rust-GCC/gccrs/blob/a8ddeb784c8f97463af446c4267b5f79553ac6ad/libstdc%2B%2B-v3%2Fdoc%2Fdoxygen%2Fstdheader.cc", "raw_url": "https://github.com/Rust-GCC/gccrs/raw/a8ddeb784c8f97463af446c4267b5f79553ac6ad/libstdc%2B%2B-v3%2Fdoc%2Fdoxygen%2Fstdheader.cc", "contents_url": "https://api.github.com/repos/Rust-GCC/gccrs/contents/libstdc%2B%2B-v3%2Fdoc%2Fdoxygen%2Fstdheader.cc?ref=a8ddeb784c8f97463af446c4267b5f79553ac6ad", "patch": "@@ -11,6 +11,7 @@ const char* const usage =\n \"Takes no command-line arguments.\\n\"\n \"\\n\";\n \n+#include <cstdlib>\n #include <string>\n #include <map>\n #include <iostream>\n@@ -157,7 +158,7 @@ int main (int argc, char**)\n     if (argc > 1)\n     {\n         std::cerr << usage;\n-        exit(0);\n+\tstd::exit(0);\n     }\n \n     init_map();"}, {"sha": "87e702a35e33094de4266cc19bf32ac4e1919dd7", "filename": "libstdc++-v3/doc/doxygen/user.cfg.in", "status": "modified", "additions": 381, "deletions": 143, "changes": 524, "blob_url": "https://github.com/Rust-GCC/gccrs/blob/a8ddeb784c8f97463af446c4267b5f79553ac6ad/libstdc%2B%2B-v3%2Fdoc%2Fdoxygen%2Fuser.cfg.in", "raw_url": "https://github.com/Rust-GCC/gccrs/raw/a8ddeb784c8f97463af446c4267b5f79553ac6ad/libstdc%2B%2B-v3%2Fdoc%2Fdoxygen%2Fuser.cfg.in", "contents_url": "https://api.github.com/repos/Rust-GCC/gccrs/contents/libstdc%2B%2B-v3%2Fdoc%2Fdoxygen%2Fuser.cfg.in?ref=a8ddeb784c8f97463af446c4267b5f79553ac6ad", "patch": "@@ -1,4 +1,4 @@\n-# Doxyfile 1.5.1\n+# Doxyfile 1.5.7.1\n \n # This file describes the settings to be used by the documentation system\n # doxygen (www.doxygen.org) for a project\n@@ -14,6 +14,14 @@\n # Project related configuration options\n #---------------------------------------------------------------------------\n \n+# This tag specifies the encoding used for all characters in the config file \n+# that follow. The default is UTF-8 which is also the encoding used for all \n+# text before the first occurrence of this tag. Doxygen uses libiconv (or the \n+# iconv built into libc) for the transcoding. See \n+# http://www.gnu.org/software/libiconv for the list of possible encodings.\n+\n+DOXYFILE_ENCODING      = UTF-8\n+\n # The PROJECT_NAME tag is a single word (or a sequence of words surrounded \n # by quotes) that should identify the project.\n \n@@ -46,46 +54,38 @@ CREATE_SUBDIRS         = NO\n # information to generate all constant output in the proper language. \n # The default language is English, other supported languages are: \n # Afrikaans, Arabic, Brazilian, Catalan, Chinese, Chinese-Traditional, \n-# Croatian, Czech, Danish, Dutch, Finnish, French, German, Greek, Hungarian, \n-# Italian, Japanese, Japanese-en (Japanese with English messages), Korean, \n-# Korean-en, Lithuanian, Norwegian, Polish, Portuguese, Romanian, Russian, \n-# Serbian, Slovak, Slovene, Spanish, Swedish, and Ukrainian.\n+# Croatian, Czech, Danish, Dutch, Farsi, Finnish, French, German, Greek, \n+# Hungarian, Italian, Japanese, Japanese-en (Japanese with English messages), \n+# Korean, Korean-en, Lithuanian, Norwegian, Macedonian, Persian, Polish, \n+# Portuguese, Romanian, Russian, Serbian, Serbian-Cyrilic, Slovak, Slovene, \n+# Spanish, Swedish, and Ukrainian.\n \n OUTPUT_LANGUAGE        = English\n \n-# This tag can be used to specify the encoding used in the generated output. \n-# The encoding is not always determined by the language that is chosen, \n-# but also whether or not the output is meant for Windows or non-Windows users. \n-# In case there is a difference, setting the USE_WINDOWS_ENCODING tag to YES \n-# forces the Windows encoding (this is the default for the Windows binary), \n-# whereas setting the tag to NO uses a Unix-style encoding (the default for \n-# all platforms other than Windows).\n-\n-USE_WINDOWS_ENCODING   = NO\n-\n # If the BRIEF_MEMBER_DESC tag is set to YES (the default) Doxygen will \n # include brief member descriptions after the members that are listed in \n # the file and class documentation (similar to JavaDoc). \n # Set to NO to disable this.\n \n BRIEF_MEMBER_DESC      = NO\n \n-# If the REPEAT_BRIEF tag is set to YES (the default) Doxygen will prepend \n-# the brief description of a member or function before the detailed description. \n-# Note: if both HIDE_UNDOC_MEMBERS and BRIEF_MEMBER_DESC are set to NO, the \n-# brief descriptions will be completely suppressed.\n+# If the REPEAT_BRIEF tag is set to YES (the default) Doxygen will\n+# prepend the brief description of a member or function before the\n+# detailed description.  Note: if both HIDE_UNDOC_MEMBERS and\n+# BRIEF_MEMBER_DESC are set to NO, the brief descriptions will be\n+# completely suppressed.\n \n REPEAT_BRIEF           = YES\n \n-# This tag implements a quasi-intelligent brief description abbreviator \n-# that is used to form the text in various listings. Each string \n-# in this list, if found as the leading text of the brief description, will be \n-# stripped from the text and the result after processing the whole list, is \n-# used as the annotated text. Otherwise, the brief description is used as-is. \n-# If left blank, the following values are used (\"$name\" is automatically \n-# replaced with the name of the entity): \"The $name class\" \"The $name widget\" \n-# \"The $name file\" \"is\" \"provides\" \"specifies\" \"contains\" \n-# \"represents\" \"a\" \"an\" \"the\"\n+# This tag implements a quasi-intelligent brief description\n+# abbreviator that is used to form the text in various listings. Each\n+# string in this list, if found as the leading text of the brief\n+# description, will be stripped from the text and the result after\n+# processing the whole list, is used as the annotated text. Otherwise,\n+# the brief description is used as-is.  If left blank, the following\n+# values are used (\"$name\" is automatically replaced with the name of\n+# the entity): \"The $name class\" \"The $name widget\" \"The $name file\"\n+# \"is\" \"provides\" \"specifies\" \"contains\" \"represents\" \"a\" \"an\" \"the\"\n \n ABBREVIATE_BRIEF       = \n \n@@ -95,10 +95,11 @@ ABBREVIATE_BRIEF       =\n \n ALWAYS_DETAILED_SEC    = YES\n \n-# If the INLINE_INHERITED_MEMB tag is set to YES, doxygen will show all \n-# inherited members of a class in the documentation of that class as if those \n-# members were ordinary class members. Constructors, destructors and assignment \n-# operators of the base classes will not be shown.\n+# If the INLINE_INHERITED_MEMB tag is set to YES, doxygen will show\n+# all inherited members of a class in the documentation of that class\n+# as if those members were ordinary class members. Constructors,\n+# destructors and assignment operators of the base classes will not be\n+# shown.\n \n INLINE_INHERITED_MEMB  = YES\n \n@@ -135,11 +136,19 @@ SHORT_NAMES            = YES\n # If the JAVADOC_AUTOBRIEF tag is set to YES then Doxygen \n # will interpret the first line (until the first dot) of a JavaDoc-style \n # comment as the brief description. If set to NO, the JavaDoc \n-# comments will behave just like the Qt-style comments (thus requiring an \n-# explicit @brief command for a brief description.\n+# comments will behave just like regular Qt-style comments \n+# (thus requiring an explicit @brief command for a brief description.)\n \n JAVADOC_AUTOBRIEF      = NO\n \n+# If the QT_AUTOBRIEF tag is set to YES then Doxygen will \n+# interpret the first line (until the first dot) of a Qt-style \n+# comment as the brief description. If set to NO, the comments \n+# will behave just like regular Qt-style comments (thus requiring \n+# an explicit \\brief command for a brief description.)\n+\n+QT_AUTOBRIEF           = NO\n+\n # The MULTILINE_CPP_IS_BRIEF tag can be set to YES to make Doxygen \n # treat a multi-line C++ special comment block (i.e. a block of //! or /// \n # comments) as a brief description. This used to be the default behaviour. \n@@ -148,13 +157,6 @@ JAVADOC_AUTOBRIEF      = NO\n \n MULTILINE_CPP_IS_BRIEF = YES\n \n-# If the DETAILS_AT_TOP tag is set to YES then Doxygen \n-# will output the detailed description near the top, like JavaDoc.\n-# If set to NO, the detailed description appears after the member \n-# documentation.\n-\n-DETAILS_AT_TOP         = YES\n-\n # If the INHERIT_DOCS tag is set to YES (the default) then an undocumented \n # member inherits the documentation from any documented member that it \n # re-implements.\n@@ -182,44 +184,106 @@ TAB_SIZE               = 4\n ALIASES                = \"doctodo=@todo\\nDoc me!  See doc/doxygen/TODO and http://gcc.gnu.org/ml/libstdc++/2002-02/msg00003.html for more.  \" \\\n                          \"isiosfwd=One of the @link s27_2_iosfwd I/O forward declarations @endlink  \"\n \n-# Set the OPTIMIZE_OUTPUT_FOR_C tag to YES if your project consists of C \n-# sources only. Doxygen will then generate output that is more tailored for C. \n-# For instance, some of the names that are used will be different. The list \n-# of all members will be omitted, etc.\n+# Set the OPTIMIZE_OUTPUT_FOR_C tag to YES if your project consists of\n+# C sources only. Doxygen will then generate output that is more\n+# tailored for C.  For instance, some of the names that are used will\n+# be different. The list of all members will be omitted, etc.\n \n OPTIMIZE_OUTPUT_FOR_C  = NO\n \n # Set the OPTIMIZE_OUTPUT_JAVA tag to YES if your project consists of Java \n-# sources only. Doxygen will then generate output that is more tailored for Java. \n-# For instance, namespaces will be presented as packages, qualified scopes \n-# will look different, etc.\n+# sources only. Doxygen will then generate output that is more tailored for \n+# Java. For instance, namespaces will be presented as packages, qualified \n+# scopes will look different, etc.\n \n OPTIMIZE_OUTPUT_JAVA   = NO\n \n-# If you use STL classes (i.e. std::string, std::vector, etc.) but do not want to \n-# include (a tag file for) the STL sources as input, then you should \n+# Set the OPTIMIZE_FOR_FORTRAN tag to YES if your project consists of Fortran \n+# sources only. Doxygen will then generate output that is more tailored for \n+# Fortran.\n+\n+OPTIMIZE_FOR_FORTRAN   = NO\n+\n+# Set the OPTIMIZE_OUTPUT_VHDL tag to YES if your project consists of VHDL \n+# sources. Doxygen will then generate output that is tailored for \n+# VHDL.\n+\n+OPTIMIZE_OUTPUT_VHDL   = NO\n+\n+# If you use STL classes (i.e. std::string, std::vector, etc.) but do not want \n+# to include (a tag file for) the STL sources as input, then you should \n # set this tag to YES in order to let doxygen match functions declarations and \n # definitions whose arguments contain STL classes (e.g. func(std::string); v.s. \n # func(std::string) {}). This also make the inheritance and collaboration \n # diagrams that involve STL classes more complete and accurate.\n \n BUILTIN_STL_SUPPORT    = NO\n \n+# If you use Microsoft's C++/CLI language, you should set this option to YES to\n+# enable parsing support.\n+\n+CPP_CLI_SUPPORT        = NO\n+\n+# Set the SIP_SUPPORT tag to YES if your project consists of sip\n+# sources only.  Doxygen will parse them like normal C++ but will\n+# assume all classes use public instead of private inheritance when no\n+# explicit protection keyword is present.\n+\n+SIP_SUPPORT            = NO\n+\n+# For Microsoft's IDL there are propget and propput attributes to\n+# indicate getter and setter methods for a property. Setting this\n+# option to YES (the default) will make doxygen to replace the get and\n+# set methods by a property in the documentation. This will only work\n+# if the methods are indeed getting or setting a simple type. If this\n+# is not the case, or you want to show the methods anyway, you should\n+# set this option to NO.\n+\n+IDL_PROPERTY_SUPPORT   = YES\n+\n # If member grouping is used in the documentation and the DISTRIBUTE_GROUP_DOC \n # tag is set to YES, then doxygen will reuse the documentation of the first \n # member in the group (if any) for the other members of the group. By default \n # all members of a group must be documented explicitly.\n \n DISTRIBUTE_GROUP_DOC   = YES\n \n-# Set the SUBGROUPING tag to YES (the default) to allow class member groups of \n-# the same type (for instance a group of public functions) to be put as a \n-# subgroup of that type (e.g. under the Public Functions section). Set it to \n-# NO to prevent subgrouping. Alternatively, this can be done per class using \n-# the \\nosubgrouping command.\n+# Set the SUBGROUPING tag to YES (the default) to allow class member\n+# groups of the same type (for instance a group of public functions)\n+# to be put as a subgroup of that type (e.g. under the Public\n+# Functions section). Set it to NO to prevent\n+# subgrouping. Alternatively, this can be done per class using the\n+# \\nosubgrouping command.\n \n SUBGROUPING            = YES\n \n+# When TYPEDEF_HIDES_STRUCT is enabled, a typedef of a struct, union, or enum \n+# is documented as struct, union, or enum with the name of the typedef. So \n+# typedef struct TypeS {} TypeT, will appear in the documentation as a struct \n+# with name TypeT. When disabled the typedef will appear as a member of a file, \n+# namespace, or class. And the struct will be named TypeS. This can typically \n+# be useful for C code in case the coding convention dictates that all compound \n+# types are typedef'ed and only the typedef is referenced, never the tag name.\n+\n+TYPEDEF_HIDES_STRUCT   = NO\n+\n+# The SYMBOL_CACHE_SIZE determines the size of the internal cache use\n+# to determine which symbols to keep in memory and which to flush to\n+# disk.  When the cache is full, less often used symbols will be\n+# written to disk.  For small to medium size projects (<1000 input\n+# files) the default value is probably good enough. For larger\n+# projects a too small cache size can cause doxygen to be busy\n+# swapping symbols to and from disk most of the time causing a\n+# significant performance penality.  If the system has enough physical\n+# memory increasing the cache will improve the performance by keeping\n+# more symbols in memory. Note that the value works on a logarithmic\n+# scale so increasing the size by one will rougly double the memory\n+# usage. The cache size is given by this formula:\n+# 2^(16+SYMBOL_CACHE_SIZE). The valid range is 0..9, the default is 0,\n+# corresponding to a cache size of 2^16 = 65536 symbols\n+\n+SYMBOL_CACHE_SIZE      = 0\n+\n #---------------------------------------------------------------------------\n # Build related configuration options\n #---------------------------------------------------------------------------\n@@ -254,6 +318,14 @@ EXTRACT_LOCAL_CLASSES  = YES\n \n EXTRACT_LOCAL_METHODS  = YES\n \n+# If this flag is set to YES, the members of anonymous namespaces will be \n+# extracted and appear in the documentation as a namespace called \n+# 'anonymous_namespace{file}', where file will be replaced with the base \n+# name of the file that contains the anonymous namespace. By default \n+# anonymous namespace are hidden.\n+\n+EXTRACT_ANON_NSPACES   = NO\n+\n # If the HIDE_UNDOC_MEMBERS tag is set to YES, Doxygen will hide all \n # undocumented members of documented classes, files or namespaces. \n # If set to NO (the default) these members will be included in the \n@@ -290,11 +362,12 @@ HIDE_IN_BODY_DOCS      = NO\n \n INTERNAL_DOCS          = NO\n \n-# If the CASE_SENSE_NAMES tag is set to NO then Doxygen will only generate \n-# file names in lower-case letters. If set to YES upper-case letters are also \n-# allowed. This is useful if you have classes or files whose names only differ \n-# in case and if your file system supports case sensitive file names. Windows \n-# and Mac users are advised to set this option to NO.\n+# If the CASE_SENSE_NAMES tag is set to NO then Doxygen will only\n+# generate file names in lower-case letters. If set to YES upper-case\n+# letters are also allowed. This is useful if you have classes or\n+# files whose names only differ in case and if your file system\n+# supports case sensitive file names. Windows and Mac users are\n+# advised to set this option to NO.\n \n CASE_SENSE_NAMES       = NO\n \n@@ -329,6 +402,12 @@ SORT_MEMBER_DOCS       = YES\n \n SORT_BRIEF_DOCS        = YES\n \n+# If the SORT_GROUP_NAMES tag is set to YES then doxygen will sort the\n+# hierarchy of group names into alphabetical order. If set to NO (the\n+# default) the group names will appear in their defined order.\n+\n+SORT_GROUP_NAMES       = NO\n+\n # If the SORT_BY_SCOPE_NAME tag is set to YES, the class list will be \n # sorted by fully-qualified names, including namespaces. If set to \n # NO (the default), the class list will be sorted only by class name, \n@@ -368,13 +447,14 @@ GENERATE_DEPRECATEDLIST= YES\n \n ENABLED_SECTIONS       = @enabled_sections@\n \n-# The MAX_INITIALIZER_LINES tag determines the maximum number of lines \n-# the initial value of a variable or define consists of for it to appear in \n-# the documentation. If the initializer consists of more lines than specified \n-# here it will be hidden. Use a value of 0 to hide initializers completely. \n-# The appearance of the initializer of individual variables and defines in the \n-# documentation can be controlled using \\showinitializer or \\hideinitializer \n-# command in the documentation regardless of this setting.\n+# The MAX_INITIALIZER_LINES tag determines the maximum number of lines\n+# the initial value of a variable or define consists of for it to\n+# appear in the documentation. If the initializer consists of more\n+# lines than specified here it will be hidden. Use a value of 0 to\n+# hide initializers completely.  The appearance of the initializer of\n+# individual variables and defines in the documentation can be\n+# controlled using \\showinitializer or \\hideinitializer command in the\n+# documentation regardless of this setting.\n \n MAX_INITIALIZER_LINES  = 0\n \n@@ -384,22 +464,45 @@ MAX_INITIALIZER_LINES  = 0\n \n SHOW_USED_FILES        = YES\n \n-# If the sources in your project are distributed over multiple directories \n-# then setting the SHOW_DIRECTORIES tag to YES will show the directory hierarchy \n-# in the documentation. The default is NO.\n+# If the sources in your project are distributed over multiple\n+# directories then setting the SHOW_DIRECTORIES tag to YES will show\n+# the directory hierarchy in the documentation. The default is NO.\n \n SHOW_DIRECTORIES       = YES\n \n-# The FILE_VERSION_FILTER tag can be used to specify a program or script that \n-# doxygen should invoke to get the current version for each file (typically from the \n-# version control system). Doxygen will invoke the program by executing (via \n-# popen()) the command <command> <input-file>, where <command> is the value of \n-# the FILE_VERSION_FILTER tag, and <input-file> is the name of an input file \n-# provided by doxygen. Whatever the program writes to standard output \n-# is used as the file version. See the manual for examples.\n+# Set the SHOW_FILES tag to NO to disable the generation of the Files page.\n+# This will remove the Files entry from the Quick Index and from the \n+# Folder Tree View (if specified). The default is YES.\n+\n+SHOW_FILES             = YES\n+\n+# Set the SHOW_NAMESPACES tag to NO to disable the generation of the \n+# Namespaces page.  This will remove the Namespaces entry from the Quick Index\n+# and from the Folder Tree View (if specified). The default is YES.\n+\n+SHOW_NAMESPACES        = YES\n+\n+# The FILE_VERSION_FILTER tag can be used to specify a program or\n+# script that doxygen should invoke to get the current version for\n+# each file (typically from the version control system). Doxygen will\n+# invoke the program by executing (via popen()) the command <command>\n+# <input-file>, where <command> is the value of the\n+# FILE_VERSION_FILTER tag, and <input-file> is the name of an input\n+# file provided by doxygen. Whatever the program writes to standard\n+# output is used as the file version. See the manual for examples.\n \n FILE_VERSION_FILTER    = \n \n+# The LAYOUT_FILE tag can be used to specify a layout file which will\n+# be parsed by doxygen. The layout file controls the global structure\n+# of the generated output files in an output format independent\n+# way. The create the layout file that represents doxygen's defaults,\n+# run doxygen with the -l option. You can optionally specify a file\n+# name after the option, if omitted DoxygenLayout.xml will be used as\n+# the name of the layout file.\n+\n+LAYOUT_FILE            = \n+\n #---------------------------------------------------------------------------\n # configuration options related to warning and progress messages\n #---------------------------------------------------------------------------\n@@ -428,11 +531,11 @@ WARN_IF_UNDOCUMENTED   = NO\n \n WARN_IF_DOC_ERROR      = NO\n \n-# This WARN_NO_PARAMDOC option can be abled to get warnings for \n-# functions that are documented, but have no documentation for their parameters \n-# or return value. If set to NO (the default) doxygen will only warn about \n-# wrong or incomplete parameter documentation, but not about the absence of \n-# documentation.\n+# This WARN_NO_PARAMDOC option can be abled to get warnings for\n+# functions that are documented, but have no documentation for their\n+# parameters or return value. If set to NO (the default) doxygen will\n+# only warn about wrong or incomplete parameter documentation, but not\n+# about the absence of documentation.\n \n WARN_NO_PARAMDOC       = NO\n \n@@ -500,7 +603,7 @@ INPUT                  = @srcdir@/libsupc++/cxxabi.h \\\n                          include/streambuf \\\n                          include/string \\\n                          include/system_error \\\n-\t\t\t include/thread \\\n+                         include/thread \\\n                          include/tuple \\\n                          include/type_traits \\\n                          include/unordered_map \\\n@@ -613,12 +716,21 @@ INPUT                  = @srcdir@/libsupc++/cxxabi.h \\\n                          include/ext/pb_ds/detail \\\n                          @srcdir@/doc/doxygen/doxygroups.cc\n \n-# If the value of the INPUT tag contains directories, you can use the \n-# FILE_PATTERNS tag to specify one or more wildcard pattern (like *.cpp \n-# and *.h) to filter out the source-files in the directories. If left \n-# blank the following patterns are tested: \n-# *.c *.cc *.cxx *.cpp *.c++ *.java *.ii *.ixx *.ipp *.i++ *.inl *.h *.hh *.hxx \n-# *.hpp *.h++ *.idl *.odl *.cs *.php *.php3 *.inc *.m *.mm *.py\n+# This tag can be used to specify the character encoding of the source\n+# files that doxygen parses. Internally doxygen uses the UTF-8\n+# encoding, which is also the default input encoding. Doxygen uses\n+# libiconv (or the iconv built into libc) for the transcoding. See\n+# http://www.gnu.org/software/libiconv for the list of possible\n+# encodings.\n+\n+INPUT_ENCODING         = UTF-8\n+\n+# If the value of the INPUT tag contains directories, you can use the\n+# FILE_PATTERNS tag to specify one or more wildcard pattern (like\n+# *.cpp and *.h) to filter out the source-files in the directories. If\n+# left blank the following patterns are tested: *.c *.cc *.cxx *.cpp\n+# *.c++ *.java *.ii *.ixx *.ipp *.i++ *.inl *.h *.hh *.hxx *.hpp *.h++\n+# *.idl *.odl *.cs *.php *.php3 *.inc *.m *.mm *.py *.f90\n \n FILE_PATTERNS          = *.h \\\n                          *.hpp \\\n@@ -654,6 +766,14 @@ EXCLUDE_PATTERNS       = stamp-* \\\n                          *extc++.h* \\\n                          */.svn/*\n \n+# The EXCLUDE_SYMBOLS tag can be used to specify one or more symbol names \n+# (namespaces, classes, functions, etc.) that should be excluded from the \n+# output. The symbol name can be a fully qualified name, a word, or if the \n+# wildcard * is used, a substring. Examples: ANamespace, AClass, \n+# AClass::ANamespace, ANamespace::*Test\n+\n+EXCLUDE_SYMBOLS        = \n+\n # The EXAMPLE_PATH tag can be used to specify one or more files or \n # directories that contain example code fragments that are included (see \n # the \\include command).\n@@ -709,10 +829,10 @@ FILTER_SOURCE_FILES    = NO\n # configuration options related to source browsing\n #---------------------------------------------------------------------------\n \n-# If the SOURCE_BROWSER tag is set to YES then a list of source files will \n-# be generated. Documented entities will be cross-referenced with these sources. \n-# Note: To get rid of all source code in the generated output, make sure also \n-# VERBATIM_HEADERS is set to NO.\n+# If the SOURCE_BROWSER tag is set to YES then a list of source files\n+# will be generated. Documented entities will be cross-referenced with\n+# these sources.  Note: To get rid of all source code in the generated\n+# output, make sure also VERBATIM_HEADERS is set to NO.\n \n SOURCE_BROWSER         = YES\n \n@@ -727,13 +847,13 @@ INLINE_SOURCES         = NO\n \n STRIP_CODE_COMMENTS    = NO\n \n-# If the REFERENCED_BY_RELATION tag is set to YES (the default) \n+# If the REFERENCED_BY_RELATION tag is set to YES \n # then for each documented function all documented \n # functions referencing it will be listed.\n \n REFERENCED_BY_RELATION = YES\n \n-# If the REFERENCES_RELATION tag is set to YES (the default) \n+# If the REFERENCES_RELATION tag is set to YES \n # then for each documented function all documented entities \n # called/used by that function will be listed.\n \n@@ -831,9 +951,44 @@ HTML_STYLESHEET        =\n \n HTML_ALIGN_MEMBERS     = NO\n \n+# If the HTML_DYNAMIC_SECTIONS tag is set to YES then the generated HTML \n+# documentation will contain sections that can be hidden and shown after the \n+# page has loaded. For this to work a browser that supports \n+# JavaScript and DHTML is required (for instance Mozilla 1.0+, Firefox \n+# Netscape 6.0+, Internet explorer 5.0+, Konqueror, or Safari).\n+\n+HTML_DYNAMIC_SECTIONS  = NO\n+\n+# If the GENERATE_DOCSET tag is set to YES, additional index files\n+# will be generated that can be used as input for Apple's Xcode 3\n+# integrated development environment, introduced with OSX 10.5\n+# (Leopard).  To create a documentation set, doxygen will generate a\n+# Makefile in the HTML output directory. Running make will produce the\n+# docset in that directory and running \"make install\" will install the\n+# docset in ~/Library/Developer/Shared/Documentation/DocSets so that\n+# Xcode will find it at startup.  See\n+# http://developer.apple.com/tools/creatingdocsetswithdoxygen.html for\n+# more information.\n+\n+GENERATE_DOCSET        = NO\n+\n+# When GENERATE_DOCSET tag is set to YES, this tag determines the name\n+# of the feed. A documentation feed provides an umbrella under which\n+# multiple documentation sets from a single provider (such as a\n+# company or product suite) can be grouped.\n+\n+DOCSET_FEEDNAME        = \"Doxygen generated docs\"\n+\n+# When GENERATE_DOCSET tag is set to YES, this tag specifies a string that \n+# should uniquely identify the documentation set bundle. This should be a \n+# reverse domain-name style string, e.g. com.mycompany.MyDocSet. Doxygen \n+# will append .docset to the name.\n+\n+DOCSET_BUNDLE_ID       = org.doxygen.Project\n+\n # If the GENERATE_HTMLHELP tag is set to YES, additional index files \n # will be generated that can be used as input for tools like the \n-# Microsoft HTML help workshop to generate a compressed HTML help file (.chm) \n+# Microsoft HTML help workshop to generate a compiled HTML help file (.chm) \n # of the generated HTML documentation.\n \n GENERATE_HTMLHELP      = NO\n@@ -858,6 +1013,12 @@ HHC_LOCATION           =\n \n GENERATE_CHI           = NO\n \n+# If the GENERATE_HTMLHELP tag is set to YES, the CHM_INDEX_ENCODING\n+# is used to encode HtmlHelp index (hhk), content (hhc) and project file\n+# content.\n+\n+CHM_INDEX_ENCODING     = \n+\n # If the GENERATE_HTMLHELP tag is set to YES, the BINARY_TOC flag \n # controls whether a binary table of contents is generated (YES) or a \n # normal table of contents (NO) in the .chm file.\n@@ -869,6 +1030,42 @@ BINARY_TOC             = NO\n \n TOC_EXPAND             = NO\n \n+# If the GENERATE_QHP tag is set to YES and both QHP_NAMESPACE and\n+# QHP_VIRTUAL_FOLDER are set, an additional index file will be\n+# generated that can be used as input for Qt's qhelpgenerator to\n+# generate a Qt Compressed Help (.qch) of the generated HTML\n+# documentation.\n+\n+GENERATE_QHP           = NO\n+\n+# If the QHG_LOCATION tag is specified, the QCH_FILE tag can \n+# be used to specify the file name of the resulting .qch file. \n+# The path specified is relative to the HTML output folder.\n+\n+QCH_FILE               = \n+\n+# The QHP_NAMESPACE tag specifies the namespace to use when generating\n+# Qt Help Project output. For more information please see <a\n+# href=\"http://doc.trolltech.com/qthelpproject.html#namespace\">Qt Help\n+# Project / Namespace</a>.\n+\n+QHP_NAMESPACE          = org.doxygen.Project\n+\n+# The QHP_VIRTUAL_FOLDER tag specifies the namespace to use when\n+# generating Qt Help Project output. For more information please see\n+# <a\n+# href=\"http://doc.trolltech.com/qthelpproject.html#virtual-folders\">Qt\n+# Help Project / Virtual Folders</a>.\n+\n+QHP_VIRTUAL_FOLDER     = doc\n+\n+# If the GENERATE_QHP tag is set to YES, the QHG_LOCATION tag can \n+# be used to specify the location of Qt's qhelpgenerator. \n+# If non-empty doxygen will try to run qhelpgenerator on the generated \n+# .qhp file .\n+\n+QHG_LOCATION           = \n+\n # The DISABLE_INDEX tag can be used to turn on/off the condensed index at \n # top of each HTML page. The value NO (the default) enables the index and \n # the value YES disables it.\n@@ -880,12 +1077,21 @@ DISABLE_INDEX          = YES\n \n ENUM_VALUES_PER_LINE   = 4\n \n-# If the GENERATE_TREEVIEW tag is set to YES, a side panel will be\n-# generated containing a tree-like index structure (just like the one that \n-# is generated for HTML Help). For this to work a browser that supports \n-# JavaScript, DHTML, CSS and frames is required (for instance Mozilla 1.0+, \n-# Netscape 6.0+, Internet explorer 5.0+, or Konqueror). Windows users are \n-# probably better off using the HTML help feature.\n+# The GENERATE_TREEVIEW tag is used to specify whether a tree-like\n+# index structure should be generated to display hierarchical\n+# information.  If the tag value is set to FRAME, a side panel will be\n+# generated containing a tree-like index structure (just like the one\n+# that is generated for HTML Help). For this to work a browser that\n+# supports JavaScript, DHTML, CSS and frames is required (for instance\n+# Mozilla 1.0+, Netscape 6.0+, Internet explorer 5.0+, or\n+# Konqueror). Windows users are probably better off using the HTML\n+# help feature. Other possible values for this tag are: HIERARCHIES,\n+# which will generate the Groups, Directories, and Class Hierarchy\n+# pages using a tree view instead of an ordered list; ALL, which\n+# combines the behavior of FRAME and HIERARCHIES; and NONE, which\n+# disables this behavior completely. For backwards compatibility with\n+# previous releases of Doxygen, the values YES and NO are equivalent\n+# to FRAME and NONE respectively.\n \n GENERATE_TREEVIEW      = YES\n \n@@ -895,6 +1101,14 @@ GENERATE_TREEVIEW      = YES\n \n TREEVIEW_WIDTH         = 250\n \n+# Use this tag to change the font size of Latex formulas included \n+# as images in the HTML documentation. The default is 10. Note that \n+# when you change the font size after a successful doxygen run you need \n+# to manually remove any form_*.png images from the HTML output directory \n+# to force them to be regenerated.\n+\n+FORMULA_FONTSIZE       = 10\n+\n #---------------------------------------------------------------------------\n # configuration options related to the LaTeX output\n #---------------------------------------------------------------------------\n@@ -1171,9 +1385,9 @@ INCLUDE_FILE_PATTERNS  =\n # instead of the = operator.\n \n PREDEFINED             = __cplusplus \\\n-\t\t         __GTHREADS \\\n-\t\t\t _GLIBCXX_HAS_GTHREADS \\\n-\t\t\t __GXX_EXPERIMENTAL_CXX0X__ \\\n+                         __GTHREADS \\\n+                         _GLIBCXX_HAS_GTHREADS \\\n+                         __GXX_EXPERIMENTAL_CXX0X__ \\\n                          \"_GLIBCXX_STD_P= \" \\\n                          \"_GLIBCXX_STD_D= \" \\\n                          _GLIBCXX_STD=std \\\n@@ -1189,18 +1403,17 @@ PREDEFINED             = __cplusplus \\\n                          _GLIBCXX_DEPRECATED \\\n                          _GLIBCXX_USE_WCHAR_T \\\n                          _GLIBCXX_USE_LONG_LONG \\\n-\t\t\t _GLIBCXX_USE_C99_STDINT_TR1 \\\n+                         _GLIBCXX_USE_C99_STDINT_TR1 \\\n                          __glibcxx_function_requires=// \\\n                          __glibcxx_class_requires=// \\\n                          __glibcxx_class_requires2=// \\\n                          __glibcxx_class_requires3=// \\\n                          __glibcxx_class_requires4=//\n \n-# If the MACRO_EXPANSION and EXPAND_ONLY_PREDEF tags are set to YES\n-# then this tag can be used to specify a list of macro names that\n-# should be expanded.  The macro definition that is found in the\n-# sources will be used.  Use the PREDEFINED tag if you want to use a\n-# different macro definition.\n+# If the MACRO_EXPANSION and EXPAND_ONLY_PREDEF tags are set to YES then \n+# this tag can be used to specify a list of macro names that should be expanded. \n+# The macro definition that is found in the sources will be used. \n+# Use the PREDEFINED tag if you want to use a different macro definition.\n \n EXPAND_AS_DEFINED      = \n \n@@ -1268,6 +1481,15 @@ PERL_PATH              = /usr/bin/perl\n \n CLASS_DIAGRAMS         = YES\n \n+# You can define message sequence charts within doxygen comments using\n+# the \\msc command. Doxygen will then run the mscgen tool (see\n+# http://www.mcternan.me.uk/mscgen/) to produce the chart and insert\n+# it in the documentation. The MSCGEN_PATH tag allows you to specify\n+# the directory where the mscgen tool resides. If left empty the tool\n+# is assumed to be found in the default search path.\n+\n+MSCGEN_PATH            = \n+\n # If set to YES, the inheritance and collaboration graphs will hide \n # inheritance and usage relations if the target is undocumented \n # or is not a class.\n@@ -1281,6 +1503,30 @@ HIDE_UNDOC_RELATIONS   = NO\n \n HAVE_DOT               = YES\n \n+# By default doxygen will write a font called FreeSans.ttf to the\n+# output directory and reference it in all dot files that doxygen\n+# generates. This font does not include all possible unicode\n+# characters however, so when you need these (or just want a\n+# differently looking font) you can specify the font name using\n+# DOT_FONTNAME. You need need to make sure dot is able to find the\n+# font, which can be done by putting it in a standard location or by\n+# setting the DOTFONTPATH environment variable or by setting\n+# DOT_FONTPATH to the directory containing the font.\n+\n+DOT_FONTNAME           = FreeSans\n+\n+# The DOT_FONTSIZE tag can be used to set the size of the font of dot graphs. \n+# The default size is 10pt.\n+\n+DOT_FONTSIZE           = 10\n+\n+# By default doxygen will tell dot to use the output directory to look for the \n+# FreeSans.ttf font (which doxygen will put there itself). If you specify a \n+# different font using DOT_FONTNAME you can set the path where dot \n+# can find it using this tag.\n+\n+DOT_FONTPATH           = \n+\n # If the CLASS_GRAPH and HAVE_DOT tags are set to YES then doxygen \n # will generate a graph for each documented class showing the direct and \n # indirect inheritance relations. Setting this tag to YES will force the \n@@ -1325,19 +1571,19 @@ INCLUDE_GRAPH          = NO\n \n INCLUDED_BY_GRAPH      = NO\n \n-# If the CALL_GRAPH and HAVE_DOT tags are set to YES then doxygen will \n-# generate a call dependency graph for every global function or class method. \n-# Note that enabling this option will significantly increase the time of a run. \n-# So in most cases it will be better to enable call graphs for selected \n-# functions only using the \\callgraph command.\n+# If the CALL_GRAPH and HAVE_DOT options are set to YES then \n+# doxygen will generate a call dependency graph for every global function \n+# or class method. Note that enabling this option will significantly increase \n+# the time of a run. So in most cases it will be better to enable call graphs \n+# for selected functions only using the \\callgraph command.\n \n CALL_GRAPH             = NO\n \n-# If the CALLER_GRAPH and HAVE_DOT tags are set to YES then doxygen will \n-# generate a caller dependency graph for every global function or class method. \n-# Note that enabling this option will significantly increase the time of a run. \n-# So in most cases it will be better to enable caller graphs for selected \n-# functions only using the \\callergraph command.\n+# If the CALLER_GRAPH and HAVE_DOT tags are set to YES then \n+# doxygen will generate a caller dependency graph for every global function \n+# or class method. Note that enabling this option will significantly increase \n+# the time of a run. So in most cases it will be better to enable caller \n+# graphs for selected functions only using the \\callergraph command.\n \n CALLER_GRAPH           = NO\n \n@@ -1370,39 +1616,31 @@ DOT_PATH               =\n \n DOTFILE_DIRS           = \n \n-# The MAX_DOT_GRAPH_WIDTH tag can be used to set the maximum allowed width \n-# (in pixels) of the graphs generated by dot. If a graph becomes larger than \n-# this value, doxygen will try to truncate the graph, so that it fits within \n-# the specified constraint. Beware that most browsers cannot cope with very \n-# large images.\n-\n-MAX_DOT_GRAPH_WIDTH    = 1024\n-\n-# The MAX_DOT_GRAPH_HEIGHT tag can be used to set the maximum allows height \n-# (in pixels) of the graphs generated by dot. If a graph becomes larger than \n-# this value, doxygen will try to truncate the graph, so that it fits within \n-# the specified constraint. Beware that most browsers cannot cope with very \n-# large images.\n+# The DOT_GRAPH_MAX_NODES tag can be used to set the maximum number of \n+# nodes that will be shown in the graph. If the number of nodes in a graph \n+# becomes larger than this value, doxygen will truncate the graph, which is \n+# visualized by representing a node as a red box. Note that doxygen if the \n+# number of direct children of the root node in a graph is already larger than \n+# DOT_GRAPH_MAX_NODES then the graph will not be shown at all. Also note \n+# that the size of a graph can be further restricted by MAX_DOT_GRAPH_DEPTH.\n \n-MAX_DOT_GRAPH_HEIGHT   = 1024\n+DOT_GRAPH_MAX_NODES    = 50\n \n # The MAX_DOT_GRAPH_DEPTH tag can be used to set the maximum depth of the \n # graphs generated by dot. A depth value of 3 means that only nodes reachable \n # from the root by following a path via at most 3 edges will be shown. Nodes \n # that lay further from the root node will be omitted. Note that setting this \n # option to 1 or 2 may greatly reduce the computation time needed for large \n-# code bases. Also note that a graph may be further truncated if the graph's \n-# image dimensions are not sufficient to fit the graph (see MAX_DOT_GRAPH_WIDTH \n-# and MAX_DOT_GRAPH_HEIGHT). If 0 is used for the depth value (the default), \n-# the graph is not depth-constrained.\n+# code bases. Also note that the size of a graph can be further restricted by \n+# DOT_GRAPH_MAX_NODES. Using a depth of 0 means no depth restriction.\n \n MAX_DOT_GRAPH_DEPTH    = 0\n \n # Set the DOT_TRANSPARENT tag to YES to generate images with a transparent \n-# background. This is disabled by default, which results in a white background. \n-# Warning: Depending on the platform used, enabling this option may lead to \n-# badly anti-aliased labels on the edges of a graph (i.e. they become hard to \n-# read).\n+# background. This is disabled by default, because dot on Windows does not \n+# seem to support this out of the box. Warning: Depending on the platform used, \n+# enabling this option may lead to badly anti-aliased labels on the edges of \n+# a graph (i.e. they become hard to read).\n \n DOT_TRANSPARENT        = NO\n "}]}