{"url": "https://api.github.com/repos/rust-lang/rust/issues/59845", "repository_url": "https://api.github.com/repos/rust-lang/rust", "labels_url": "https://api.github.com/repos/rust-lang/rust/issues/59845/labels{/name}", "comments_url": "https://api.github.com/repos/rust-lang/rust/issues/59845/comments", "events_url": "https://api.github.com/repos/rust-lang/rust/issues/59845/events", "html_url": "https://github.com/rust-lang/rust/issues/59845", "id": 431605321, "node_id": "MDU6SXNzdWU0MzE2MDUzMjE=", "number": 59845, "title": "rustdoc styling improvements for readability", "user": {"login": "lambda", "id": 37398, "node_id": "MDQ6VXNlcjM3Mzk4", "avatar_url": "https://avatars.githubusercontent.com/u/37398?v=4", "gravatar_id": "", "url": "https://api.github.com/users/lambda", "html_url": "https://github.com/lambda", "followers_url": "https://api.github.com/users/lambda/followers", "following_url": "https://api.github.com/users/lambda/following{/other_user}", "gists_url": "https://api.github.com/users/lambda/gists{/gist_id}", "starred_url": "https://api.github.com/users/lambda/starred{/owner}{/repo}", "subscriptions_url": "https://api.github.com/users/lambda/subscriptions", "organizations_url": "https://api.github.com/users/lambda/orgs", "repos_url": "https://api.github.com/users/lambda/repos", "events_url": "https://api.github.com/users/lambda/events{/privacy}", "received_events_url": "https://api.github.com/users/lambda/received_events", "type": "User", "site_admin": false}, "labels": [{"id": 203738, "node_id": "MDU6TGFiZWwyMDM3Mzg=", "url": "https://api.github.com/repos/rust-lang/rust/labels/T-rustdoc", "name": "T-rustdoc", "color": "bfd4f2", "default": false, "description": "Relevant to the rustdoc team, which will review and decide on the PR/issue."}, {"id": 2406929537, "node_id": "MDU6TGFiZWwyNDA2OTI5NTM3", "url": "https://api.github.com/repos/rust-lang/rust/labels/A-rustdoc-ui", "name": "A-rustdoc-ui", "color": "f7e101", "default": false, "description": "Area: rustdoc UI (generated HTML)"}], "state": "open", "locked": false, "assignee": null, "assignees": [], "milestone": null, "comments": 16, "created_at": "2019-04-10T16:43:50Z", "updated_at": "2023-04-21T13:11:17Z", "closed_at": null, "author_association": "CONTRIBUTOR", "active_lock_reason": null, "body": "This is being broken out of #59829 to provide smaller, actionable items that can be independently discussed and worked on.\r\n\r\nComparing the overall rustdoc styling with recommendations for accessibility, including for dyslexia and attention disorders, there are a number of improvements that could be made.\r\n\r\nIn addition, the [mdBook](https://github.com/rust-lang-nursery/mdBook) default styling, which is already used for the [Rust Book](https://doc.rust-lang.org/book/) and other official Rust documentation, already meets or comes closer to meeting several of these criteria, so one way to achieve several of these goals would be to unify styling with mdBook.\r\n\r\nA few of these recommendations may be more appropriate for a separate theme rather than the default theme, but I think many of these changes could improve readability and usability for all users.\r\n\r\n* [x] Remove extraneous horizontal rules; horizontal rules should generally be used sparingly, but are used heavily in rustdoc. Appropriate spacing and sizing of headers can replace most uses of horizontal rules.\r\n* [ ] Use a sans-serif font for the body text\r\n* [x] Change the font size and column width such that lines are at most 100 characters wide, [preferably under 80](https://www.w3.org/TR/WCAG21/#visual-presentation). This probably means also limiting width of example code to 70 or 80 columns or so, but that's probably OK, example code shouldn't need as much room as the standard convention of 100 columns.\r\n* [ ] Consider a lower contrast theme, either as the default or as an option distinct from the dark theme. This can be overdone, some sites go overboard with low-contrast themes, but there's a lot of room for going lower contrast before getting to that point.\r\n* [ ] Reduce use of color, as colored text can catch attention and the more colors used the more distracting it can be. Additionally, relying on color to convey information presents problems for those with colorblindness.\r\n  - [x] Consider removing use of different colors for links to different kinds of items (structs, enums, type aliases, macros, etc). This may be worth its own issue as it interacts with the search UI. #91480\r\n  - [x] Consider removing colored headings; headings are already distinguished by size, font, spacing, and horizontal rules (though those should probably be also be dropped). In general, only one or two attributes should change to distinguish headings, otherwise they become too prominent and can drown out the text.\r\n  - [x] Consider removing the color from the \"Run\" link in the example code, or only coloring it upon hover. Also consider unifying styling of example code \"Run\" link with mdBook, though mdBook could also use lower contrast controls by default. #92058\r\n* [ ] Reduce or eliminate the use of background boxes for inline `<code>` spans; the Python approach of not having a background box if it is already highlighted as a link seems like a nice idea.\r\n* [x] Increase leading to 1.5 times the font size, and greater inter-paragraph spacing ([WCAG recommends 250% of the line height](https://www.w3.org/WAI/WCAG21/Understanding/visual-presentation.html), but that looks quite excessive to me; 2em looks like a readability improvement to me without being excessive) #93694\r\n* [x] Provide a theme with a larger font size, or use a `1 rem` default font size to pick up the browser default font size (increasing the font size across the board doesn't necessarily improve readability; some users actually find smaller fonts more readable) #92448 ", "closed_by": null, "reactions": {"url": "https://api.github.com/repos/rust-lang/rust/issues/59845/reactions", "total_count": 0, "+1": 0, "-1": 0, "laugh": 0, "hooray": 0, "confused": 0, "heart": 0, "rocket": 0, "eyes": 0}, "timeline_url": "https://api.github.com/repos/rust-lang/rust/issues/59845/timeline", "performed_via_github_app": null, "state_reason": null}