{"url": "https://api.github.com/repos/rust-lang/rust/issues/61905", "repository_url": "https://api.github.com/repos/rust-lang/rust", "labels_url": "https://api.github.com/repos/rust-lang/rust/issues/61905/labels{/name}", "comments_url": "https://api.github.com/repos/rust-lang/rust/issues/61905/comments", "events_url": "https://api.github.com/repos/rust-lang/rust/issues/61905/events", "html_url": "https://github.com/rust-lang/rust/issues/61905", "id": 456718221, "node_id": "MDU6SXNzdWU0NTY3MTgyMjE=", "number": 61905, "title": "recruitment：Block chain rust development engineer", "user": {"login": "caesarchad", "id": 17776934, "node_id": "MDQ6VXNlcjE3Nzc2OTM0", "avatar_url": "https://avatars.githubusercontent.com/u/17776934?v=4", "gravatar_id": "", "url": "https://api.github.com/users/caesarchad", "html_url": "https://github.com/caesarchad", "followers_url": "https://api.github.com/users/caesarchad/followers", "following_url": "https://api.github.com/users/caesarchad/following{/other_user}", "gists_url": "https://api.github.com/users/caesarchad/gists{/gist_id}", "starred_url": "https://api.github.com/users/caesarchad/starred{/owner}{/repo}", "subscriptions_url": "https://api.github.com/users/caesarchad/subscriptions", "organizations_url": "https://api.github.com/users/caesarchad/orgs", "repos_url": "https://api.github.com/users/caesarchad/repos", "events_url": "https://api.github.com/users/caesarchad/events{/privacy}", "received_events_url": "https://api.github.com/users/caesarchad/received_events", "type": "User", "site_admin": false}, "labels": [], "state": "closed", "locked": false, "assignee": null, "assignees": [], "milestone": null, "comments": 1, "created_at": "2019-06-17T02:45:34Z", "updated_at": "2019-06-17T03:57:12Z", "closed_at": "2019-06-17T03:57:12Z", "author_association": "NONE", "active_lock_reason": null, "body": "Hello, I'm Bob from Bitconch, the world's only high-performance blockchain with 120,000 TPS(MVP) compatible with eitfang smart contracts.It benefits from innovative reputation proof (POR) algorithms.Bitconch also helps developers engage and share their perspective users.Developers can deploy their dapps or nodes on the Bitconch blockchain to achieve more users, higher bit-r values and better rewards.Developers who need to attract users will also benefit from bit-t systems, which encourage users to use as many applications as possible.\r\n\r\nWhat benefits do we have as a young Internet company???\r\nThe administration department beautiful greasy young lady sisters will prepare delicious snacks for you!What!!!Let's eat and knock on some code.There are so many different kinds of drinks.\r\n\r\nWe Bitconch to and from work do not knock card, do not knock card, do not knock card, ultra-elastic working time, free zero touch.\r\n\r\nBitconch also has independent gyms and showers. Bitconch promotes healthy work and healthy living. Nothing is more important than your health.\r\nThere are many benefits to explore for yourself!\r\n\r\nCurrent position ↓\r\n\r\nBlock chain Rust development engineer\r\n\r\nMain work list:\r\n\r\nBitconch is an early stage startup based in the business heart of China, Shanghai. We are set to revolutionize the financial services world by leveraging Social Graph and Blockchain Technology. Our mission is to create an autonomous, decentralized financial services platform that will enable our customers to quickly build applications with top performance and high availability.\r\n\r\nWe are looking for exceptional developers, whether experienced or junior, that are entrepreneurial/innovative at heart. You must be able to demonstrate your excellence through projects, and/or open source technology contribution. You will need to have a deep passion for technology, perseverance and determination to succeed in this position.\r\n\r\nThe ideal candidate is looking for a challenge and has experience working on a large scale platform. You should have an aptitude for architectural decisions which optimize scalability and performance. This role also requires you to wear multiple hats and think outside of the box, it is a rewarding experience full of opportunities for growth and professional development.\r\n\r\nIf you wish to be a part of the next wave of technical innovation and have a passion for software development and continuous learning, this is the opportunity for you!\r\n\r\nResponsibilities:\r\n\r\n• Design and architect the blockchain protocol based on the product demand, implement decentralized, distributed blockchain consensus and syncing protocol\r\n• Design, develop, test, deploy, maintain, and improve software across the stack. Write clean, high quality code and test cases\r\n• Deploy product on cloud-base infrastructure, and provide input on improvement of such hardware and software work with IT staff in providing assistance in software development, creating of test plans, deployment plans, and other project direction\r\n• Use continuous integration technology to build, deploy and test all aspect of the products to ensure high quality delivery\r\n• Strictly adhere to all security protocols and processes and work diligently to protect the assets of the company and its customers\r\n• Developing new functionality and maintaining existing components, Develop automated tests and deliver high-quality code to production within a short development cycle\r\n• Identify issues and implement solutions to complex problems in large-scale backend infrastructure platforms\r\n• Manage and maintain blockchain/cloud infrastructure as required\r\n• Work with researchers to transform prototype solutions into well architected applications\r\n• Work with development teams to ensure reliable transfer of technology\r\n• Keep abreast of the latest developments in the field by continuous learning and proactively champion promising new methods relevant to the problems at hand\r\n• Monitor, research and evaluate Blockchain technologies\r\nBasic Qualifications:\r\n\r\n• Expert knowledge of multiple programming languages such as C++, Go, Java, JavaScript, Python\r\n• Strong knowledge of data structures, algorithms, operating systems, and distributed systems fundamentals.\r\n• Strong understanding of databases, NoSQL systems, storage and distributed persistence technologies\r\n• Strong troubleshooting and performance tuning skills\r\n• Understanding of microservices architecture and Docker infrastructure,familiar with Linux and DevOps in Docker\r\n• Understanding of security technologies: PKI, Crypto, identity management\r\n• Strong sense of ownership, passion to build quality products for massive scale in collaborative, agile environment and excitement to learn.\r\n• Strong communication (written and verbal), time management and interpersonal skills\r\n• Experience working in an Agile/Scrum development process, including flexibility and willingness to accept a change in priorities as necessary\r\n• BS in in Computer Science or related engineering fields\r\nPreferred Qualifications:\r\n\r\n• Demonstrated hands-on experience with blockchain technology, ideally with Bitcoin, Ethereum, Hyperledger Fabric and cryptocurrencies in general\r\n• Deep understanding of mainstream consensus algorithm, including but not limited to PoW, PoR, PoS, DPoS, PBFT, Paxos, Raft and so on.\r\n• Experience creating blockchain frameworks and business applications, including decentralized applications (DAPPS), smart contracts and custom tokens\r\n• Experience with one or more blockchain application development platform: Ethereum Solidity, HyperLedger Fabric, R3/Corda, NEO, etc.\r\n• MS/PhD in in Computer Science or related engineering fields\r\nExperience:\r\n\r\n• Software Development: 3 years\r\nEducation:\r\n\r\n• Bachelor's\r\nLanguage:\r\n\r\n• Chinese Mandarin\r\n• English\r\n\r\nLooking forward to your joining\r\nPlease send your resume (including all previous excellent projects and experience, if possible) to:\r\n563279521 @qq.com\r\nAddress: 7 / f, building C7, no.36, lane 1688, guo-quan north road, yangpu district, Shanghai", "closed_by": {"login": "csmoe", "id": 35686186, "node_id": "MDQ6VXNlcjM1Njg2MTg2", "avatar_url": "https://avatars.githubusercontent.com/u/35686186?v=4", "gravatar_id": "", "url": "https://api.github.com/users/csmoe", "html_url": "https://github.com/csmoe", "followers_url": "https://api.github.com/users/csmoe/followers", "following_url": "https://api.github.com/users/csmoe/following{/other_user}", "gists_url": "https://api.github.com/users/csmoe/gists{/gist_id}", "starred_url": "https://api.github.com/users/csmoe/starred{/owner}{/repo}", "subscriptions_url": "https://api.github.com/users/csmoe/subscriptions", "organizations_url": "https://api.github.com/users/csmoe/orgs", "repos_url": "https://api.github.com/users/csmoe/repos", "events_url": "https://api.github.com/users/csmoe/events{/privacy}", "received_events_url": "https://api.github.com/users/csmoe/received_events", "type": "User", "site_admin": false}, "reactions": {"url": "https://api.github.com/repos/rust-lang/rust/issues/61905/reactions", "total_count": 0, "+1": 0, "-1": 0, "laugh": 0, "hooray": 0, "confused": 0, "heart": 0, "rocket": 0, "eyes": 0}, "timeline_url": "https://api.github.com/repos/rust-lang/rust/issues/61905/timeline", "performed_via_github_app": null, "state_reason": "completed"}