{"url": "https://api.github.com/repos/rust-lang/rust/issues/93216", "repository_url": "https://api.github.com/repos/rust-lang/rust", "labels_url": "https://api.github.com/repos/rust-lang/rust/issues/93216/labels{/name}", "comments_url": "https://api.github.com/repos/rust-lang/rust/issues/93216/comments", "events_url": "https://api.github.com/repos/rust-lang/rust/issues/93216/events", "html_url": "https://github.com/rust-lang/rust/issues/93216", "id": 1111701980, "node_id": "I_kwDOAAsO6M5CQznc", "number": 93216, "title": "Please bring back the paintbrush icon, or an equivalent!", "user": {"login": "steffahn", "id": 3986214, "node_id": "MDQ6VXNlcjM5ODYyMTQ=", "avatar_url": "https://avatars.githubusercontent.com/u/3986214?v=4", "gravatar_id": "", "url": "https://api.github.com/users/steffahn", "html_url": "https://github.com/steffahn", "followers_url": "https://api.github.com/users/steffahn/followers", "following_url": "https://api.github.com/users/steffahn/following{/other_user}", "gists_url": "https://api.github.com/users/steffahn/gists{/gist_id}", "starred_url": "https://api.github.com/users/steffahn/starred{/owner}{/repo}", "subscriptions_url": "https://api.github.com/users/steffahn/subscriptions", "organizations_url": "https://api.github.com/users/steffahn/orgs", "repos_url": "https://api.github.com/users/steffahn/repos", "events_url": "https://api.github.com/users/steffahn/events{/privacy}", "received_events_url": "https://api.github.com/users/steffahn/received_events", "type": "User", "site_admin": false}, "labels": [{"id": 203738, "node_id": "MDU6TGFiZWwyMDM3Mzg=", "url": "https://api.github.com/repos/rust-lang/rust/labels/T-rustdoc", "name": "T-rustdoc", "color": "bfd4f2", "default": false, "description": "Relevant to the rustdoc team, which will review and decide on the PR/issue."}], "state": "closed", "locked": false, "assignee": null, "assignees": [], "milestone": null, "comments": 16, "created_at": "2022-01-22T22:11:02Z", "updated_at": "2022-10-27T20:04:53Z", "closed_at": "2022-10-27T20:04:53Z", "author_association": "MEMBER", "active_lock_reason": null, "body": "It seems as if #92629 has removed the theme picker from rustdoc. Both the way to change themes as well as any indication of the fact that changing themes is possible in the first place is hidden behind a setting page that many users will probably not even use at all.\r\n\r\nMy initial experience with rustdoc and mdbook, back over 1 year ago, was quite positive _**because**_ of the easy option to customize the looks / themes. I hadn't set up my browser for any dark theme yet at the point; the easy accessibility and good visibility of the paintbrush icon largely introduced me to the appeal of dark-themed documentation pages.\r\n\r\nI have switched themes in rustdoc countless times. For every new browser, for every new device, for every new incognito window on a non-dark-theme-configured browser / device. And that number multiplied by the amount of websites that contain rustdoc, which is docs.rs, doc.rust-lang.org, and a whole lot of self-hosted pages for certain crates, like docs.serde.rs.\r\n\r\nThe change in #92629 makes changing themes about **20x** more effort. Instead of 2 clicks (click paint brush, then the theme) in the same area of the page, you need to:\r\n* click the (less conveniently and less visibly located) setting button\r\n* _this takes you to a different page!_\r\n* traverse the whole screen with the mouse\r\n* click to toggle \"use system theme\"\r\n* traverse the whole screen with the mouse again\r\n* click to open the drop down menu\r\n* click to select theme (this changes the theme)\r\n* move mouse to browser's \"back\" button to get to previous page\r\n* click back button\r\n* _this takes you back to the previous page, and the new theme is no longer visible_ (admitted, this issue only happened sometimes)\r\n* click refresh\r\n* _this changes the theme back back into the newly selected one_\r\n\r\nSo over all\r\n* **the page changed 5 times** (2 navigation, 3 theme changes)\r\n* the mouse traversed width of the the screen twice\r\n* I had to click 6 times\r\n\r\nPreviously it was\r\n* 1 page change (theme change)\r\n* two clicks\r\n* no significant forced extra mouse movement\r\n\r\nAdditionally, discoverability is **terrible** (I estimate that – optimistically – less than half as many users will be able to find out on there own that there are themes in the first place), the settings page with its initial layout showing \"preferred dark / light theme\" is confusing, the need to go back to the previous page using browser navigation is confusing, and the need to refresh the page is _absolutely_ confusing.\r\n\r\nFinally, if I don’t know my favorite theme yet and want to compare the looks:\r\n* I can’t get a direct visual comparison at all because it displays a different page in-between,\r\n  * unless I open multiple tabs to be able to switch themes for direct visual comparison\r\n* The issue of having to click more and do more stuff multiplies, because I want to take a look at all the themes. With just 3 themes right now, this is _somewhat_ manageable, because you “only” need to play the game twice to be able to see all the themes, and a third time to select your favorite; but assuming that more themes might be added in the future, it will get worse.\r\n\r\n<hr>\r\n\r\nThe change on nightly rustdoc unfortunately affects crate documentations on docs.rs immediately. In my personal opinion this change is a terrible user experience and should be reverted as fast as possible. Future attempts to remove the paintbrush icon should, in my opinion\r\n* make sure that changing the theme is less effort, including _at least_ that you don't have to leave the page at all\r\n  * maybe a pop-up version of (a subset of) the settings could be implemented\r\n* make sure that themes stay discoverable\r\n  * maybe, if rustdoc is able to save theme selection, it’s also possible to show a visual hint to “first-time” users, that there’s an option for theme selection in the settings\r\n\r\nBut I don’t actually see any problem with just keeping a paintbrush symbol. Mdbook does this, too. Rustdoc pages are usually huge and full of information, I don’t see why there wouldn’t be room to keep the paintbrush symbol. I also don’t understand why a redundant way to change the same setting has to be a problem; after all, themes are a great feature, (who expects API docs to have themes? wow, Rust is so great...) and discoverability of this feature is only improved if there’s multiple ways to change them.\r\n\r\nIf you want to address the main point of #84539, well, I don’t understand how that’s a significant issue in the first place, and there are probably better solutions than removing the paintbrush symbol. For example I personally wasn’t even aware that there was a different way of choosing themes than using the paintbrush symbol. My first reaction to browsing nightly std docs was “oh no, have they now joined those websites that don’t give you any configuration option besides automagically syncing with system settings?” (These websites are terrible if you’re on a device where it’s hard to bring your browser into an actual working dark mode; this took me multiple days to achieve on my current PC (linux), and actually it’s still kind-of broken). The main question\r\n> It's not clear how these are related. Does one override the other? Also, what is the \"system theme\"?\r\n\r\ndescribes a minor problem; it doesn’t really matter whether a user understands the precise logic of these settings as long as they find _some option_ easily that makes the website look the way they want it to look. And Github is a bad comparison because it’s a central (single host) website that basically assumes you’re logged in, which immediately makes (the equivalent of) the problem of having to reconfigure for\r\n* new devices and browsers\r\n* new rustdoc-hosting pages\r\n\r\ngo away. Good luck trying to change your Github theme _when you’re not logged in_ (I’m not even sure if that’s possible at all!) Well, but for rustdoc paged, _**you’re never logged in!**_ Hence, adapting Github’s approach is probably a terrible idea, isn’t it?\r\n\r\n@rustbot label T-rustdoc\r\n\r\ncc @jsha", "closed_by": {"login": "GuillaumeGomez", "id": 3050060, "node_id": "MDQ6VXNlcjMwNTAwNjA=", "avatar_url": "https://avatars.githubusercontent.com/u/3050060?v=4", "gravatar_id": "", "url": "https://api.github.com/users/GuillaumeGomez", "html_url": "https://github.com/GuillaumeGomez", "followers_url": "https://api.github.com/users/GuillaumeGomez/followers", "following_url": "https://api.github.com/users/GuillaumeGomez/following{/other_user}", "gists_url": "https://api.github.com/users/GuillaumeGomez/gists{/gist_id}", "starred_url": "https://api.github.com/users/GuillaumeGomez/starred{/owner}{/repo}", "subscriptions_url": "https://api.github.com/users/GuillaumeGomez/subscriptions", "organizations_url": "https://api.github.com/users/GuillaumeGomez/orgs", "repos_url": "https://api.github.com/users/GuillaumeGomez/repos", "events_url": "https://api.github.com/users/GuillaumeGomez/events{/privacy}", "received_events_url": "https://api.github.com/users/GuillaumeGomez/received_events", "type": "User", "site_admin": false}, "reactions": {"url": "https://api.github.com/repos/rust-lang/rust/issues/93216/reactions", "total_count": 19, "+1": 19, "-1": 0, "laugh": 0, "hooray": 0, "confused": 0, "heart": 0, "rocket": 0, "eyes": 0}, "timeline_url": "https://api.github.com/repos/rust-lang/rust/issues/93216/timeline", "performed_via_github_app": null, "state_reason": "completed"}